[
  {
    "title": "СИСТЕМА УПРАВЛЕНИЯ",
    "url": "https://www.rosenergoatom.ru/about/sistema-upravleniya/",
    "text": "Росэнергоатом / О концерне / Система управления / Дивизион является организационной единицей и объединяет организации Корпорации по определенным видам деятельности и направлениям бизнеса.\n \nХарактеристики Дивизиона: Основные компетенции Дивизиона: Текущая система управления организациями атомной отрасли выглядит следующим образом: Регламент взаимодействия представляет собой совместный документ, который определяет порядок взаимодействия Корпорации и Концерна при осуществлении деятельности Концерном и организациями в контуре управления Концерна, устанавливает основания и условия участия Корпорации в принятии решений по вопросам, относящимся к отраслевым процессам. © 2025 АО «Концерн Росэнергоатом» При использовании материалов ссылка на сайт www.rosenergoatom.ru обязательна"
  },
  {
    "title": "ОЦЕНКА И ВОЗНАГРАЖДЕНИЕ ПЕРСОНАЛА",
    "url": "https://www.rosenergoatom.ru/about/sistema-upravleniya/otsenka-i-voznagrazhdenie-personala/",
    "text": "Росэнергоатом / О концерне / Система управления / Оценка и вознаграждение персонала / МОСКОВСКИЙ ЦЕНТР ВАО АЭС Система управления эффективностью деятельности и мотивации персонала была введена в Концерне «Росэнергоатом» в 2010 году. В ее основе лежит применение ключевых показателей эффективности (КПЭ), что позволяет измерить результативность и сформировать критерии эффективности деятельности каждого отдельного сотрудника. Процесс вознаграждения и его связь с результативностью и развитием сотрудника стали открытыми и прозрачными. Ежегодно Госкорпорация «Росатом» формирует перечень КПЭ на предстоящий год, обязательных для включения в карты КПЭ руководителей организаций Госкорпорации «Росатом», устанавливает целевые уровни выполнения показателей, определяет методики подведения итогов и расчета значений показателей. В соответствии с принципами декомпозиции формируются показатели, направленные на выполнение КПЭ Генерального директора Концерна, которые транслируются на руководителей всех уровней. Назначение системы ключевых показателей эффективности и мотивации состоит в фокусировании усилий всех работников на достижении наиболее значимых для организации результатов, а также в увязке размеров вознаграждения по итогам года с выполнением КПЭ. Наряду с мотивационной функцией, КПЭ прививают работникам Концерна культуру эффективности, в рамках которой все усилия должны оцениваться с точки зрения получаемой выгоды. © 2025 АО «Концерн Росэнергоатом» При использовании материалов ссылка на сайт www.rosenergoatom.ru обязательна"
  },
  {
    "title": "УПРАВЛЕНИЕ РИСКАМИ",
    "url": "https://www.rosenergoatom.ru/about/sistema-upravleniya/upravlenie-riskami/",
    "text": "Росэнергоатом / О концерне / Система управления / Управление рисками / МОСКОВСКИЙ ЦЕНТР ВАО АЭС Для эффективного управления и устойчивого развития Госкорпорации «Росатом» решением ее руководства несколько лет назад была начата работа по формированию Корпоративной системы управления рисками (КСУР), предполагающей интеграцию накопленного входящими в Госкорпорацию «Росатом» организациями опыта управления рисками в общекорпоративную систему, обеспечивающую комплексное управление техническими, технологическими, операционными, инвестиционными и другими рисками. Основной принцип Корпоративной системы управления рисками Госкорпорации «Росатом» – это встроенность в существующие процессы управления, в первую очередь – стратегическое и среднесрочное планирование, бюджетирование и инвестиционное планирование. © 2025 АО «Концерн Росэнергоатом» При использовании материалов ссылка на сайт www.rosenergoatom.ru обязательна"
  },
  {
    "title": "ВНУТРЕННИЙ КОНТРОЛЬ И АУДИТ",
    "url": "https://www.rosenergoatom.ru/about/sistema-upravleniya/vnutrenniy-kontrol-i-audit/",
    "text": "Росэнергоатом / О концерне / Система управления / Внутренний контроль и аудит / МОСКОВСКИЙ ЦЕНТР ВАО АЭС Совершенствование системы внутреннего контроля АО «Концерн Росэнергоатом», встроенной в отраслевую вертикально интегрированную систему внутреннего контроля, является принципиально важной задачей в условиях развития атомного энергопромышленного комплекса. Внутренний контроль и аудит в АО «Концерн Росэнергоатом» ориентированы на обеспечение законности и обоснованности финансовой дисциплины, результативности и эффективности производственной и управленческой деятельности, а также повышение гарантий достижения стратегических целей. Все это достигается путем принятия действенных мер по пресечению и предотвращению выявленных в ходе проверок и аудитов нарушений и устранению причин и условий им способствующих, а также проведением последующего постконтрольного мониторинга исполнения поручений по результатам контрольных мероприятий. © 2025 АО «Концерн Росэнергоатом» При использовании материалов ссылка на сайт www.rosenergoatom.ru обязательна"
  },
  {
    "title": "РАЗВИТИЕ ТЕРРИТОРИЙ ПРИСУТСТВИЯ",
    "url": "https://www.rosenergoatom.ru/about/strategiya-razvitiya/razvitie-territoriy-prisutstviya/",
    "text": "Росэнергоатом / О концерне / Стратегия развития / Развитие территорий присутствия / МОСКОВСКИЙ ЦЕНТР ВАО АЭС © 2025 АО «Концерн Росэнергоатом» При использовании материалов ссылка на сайт www.rosenergoatom.ru обязательна"
  },
  {
    "title": "КЛЮЧЕВЫЕ СТРАТЕГИЧЕСКИЕ ЦЕЛИ И ИНИЦИАТИВЫ",
    "url": "https://www.rosenergoatom.ru/about/strategiya-razvitiya/klyuchevye-strategicheskie-tseli-i-initsiativy/",
    "text": "Росэнергоатом / О концерне / Стратегия развития / Ключевые стратегические цели и инициативы / МОСКОВСКИЙ ЦЕНТР ВАО АЭС © 2025 АО «Концерн Росэнергоатом» При использовании материалов ссылка на сайт www.rosenergoatom.ru обязательна"
  },
  {
    "title": "Атом.Порт_Описание функциональных характеристик",
    "url": null,
    "text": "ё ПРОГРАММА ДЛЯ ЭВМ «СИСТЕМА УПРАВЛЕНИЯ КОНФИГУРАЦИЯМИ «АТОМ.ПОРТ: ЦЕЛЕВОЙ РЕЛИЗ» Описание функциональных характеристик Листов: 6 Дата: 18.09.2023 Версия: 1.0 Система управления конфигурациями «Атом.Порт: Целевой релиз» ЛИСТ ИЗМЕНЕНИЙ Дата Версия Краткое описание изменений Фамилия, инициалы Автор Ворожев А. В. Страница 2 Описание функциональных характеристик Дата созд. 18.09.2023 Страниц 6 Система управления конфигурациями «Атом.Порт: Целевой релиз» СОДЕРЖАНИЕ 1 Общие сведения 5 1.1 Наименование программы 5 1.2 Область применения программы 5 2 Описание функциональных характеристик 6 2.1 Функциональные возможности 6 Автор Ворожев А. В. Страница 3 Описание функциональных характеристик Дата созд. 18.09.2023 Страниц 6 Система управления конфигурациями «Атом.Порт: Целевой релиз» ТЕРМИНЫ И СОКРАЩЕНИЯ Термины/сокращения Определение ОС Операционная система ПО Программное обеспечение Программа для ЭВМ «Система управления Программа конфигурациями «Атом.Порт: Целевой релиз» Автор Ворожев А. В. Страница 4 Описание функциональных характеристик Дата созд. 18.09.2023 Страниц 6 Система управления конфигурациями «Атом.Порт: Целевой релиз» 1 Общие сведения 1.1 Наименование программы Полное наименование: Программа для ЭВМ «Система управления конфигурациями «Атом.Порт: Целевой релиз». 1.2 Область применения программы Система управления конфигурациями «Атом.Порт» (далее – Система) — это программный комплекс, предназначенный для централизованного управления программными конфигурациями рабочих станций на базе операционных систем семейств GNU/Linux и Microsoft Windows. Система предназначена для автоматизации следующих процессов: 1. инвентаризация аппаратного и программного обеспечения автоматизированных рабочих мест пользователей; 2. конфигурирование рабочих станций и групп рабочих станций, в том числе перевод рабочих станций пользователей на использование российского программного обеспечения; 3. управление конфигурациями рабочих станций в гибридной инфраструктуре. Автор Ворожев А. В. Страница 5 Описание функциональных характеристик Дата созд. 18.09.2023 Страниц 6 Система управления конфигурациями «Атом.Порт: Целевой релиз» 2 Описание функциональных характеристик 2.1 Функциональные возможности Программа позволяет осуществлять следующие операции: 1. Получать детальную информацию о действующем парке вычислительной техники предприятия, статистическую информацию об используемом аппаратном и программном обеспечении. 2. Осуществлять автоматизированный групповой перевод рабочих станций пользователей на использование российского офисного ПО, в том числе российской операционной системы:  с возможностью создания виртуальной машины с исходной ОС, функционирующей в системе виртуализации для ОС Linux;  с возможностью выбора загружаемой ОС из нескольких установленных на рабочей станции. 3. Управлять гибридной инфраструктурой по окончании процесса миграции, в том числе:  устанавливать, обновлять и удалять ПО для ОС Linux;  управлять сертификатами электронной цифровой подписи;  управлять учётными записями локальных пользователей;  выполнять настройку периферийных устройств, подключённых к рабочей станции;  администрировать рабочую станцию с использованием удалённого рабочего стола. Автор Ворожев А. В. Страница 6 Описание функциональных характеристик Дата созд. 18.09.2023 Страниц 6"
  },
  {
    "title": "Атом.Порт_Руководство пользователя",
    "url": null,
    "text": "Программа для ЭВМ «Система управления конфигурациями «Атом.Порт: Целевой релиз» ПРОГРАММА ДЛЯ ЭВМ «СИСТЕМА УПРАВЛЕНИЯ Руководство пользователя КОНФИГУРАЦИЯМИ «АТОМ.ПОРТ: ЦЕЛЕВОЙ РЕЛИЗ» Листов: 81 Руководство пол ьзователя Листов: 81 Дата: 18.09.2023 Версия: 1.0 2023 Система управления конфигурациями «Атом.Порт: Целевой релиз» ЛИСТ ИЗМЕНЕНИЙ Дата Версия Краткое описание изменений Фамилия, инициалы Автор Ворожев А. В. Страница 2 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» АННОТАЦИЯ В настоящем документе содержится руководство пользователя Программы для ЭВМ Система управления конфигурациями «Атом.Порт: Целевой релиз» (далее – Программа). В документе представлена информация, необходимая для эксплуатации Программы. Описана последовательность действий пользователя Программы при выполнении функций, задач, комплексов задач, процедур, реализованных в Программе. В разделе «Назначение программы» приведено описание назначения Программы, её возможностей, а также основные характеристики и ограничения Программы, накладываемые на область её применения. В разделе «Условия выполнения программы» определены условия, необходимые для выполнения программы (требования к необходимым для данной программы техническим средствам и другим программам). В разделе «Выполнение программы» описана последовательность действий пользователя Программы, обеспечивающих загрузку, запуск, выполнение и завершение программы, приведены описание функций, формата и возможных вариантов команд, с помощью которых пользователь Программы осуществляет загрузку и управляет выполнением программы, а также ответы программы на эти команды. Документ подготовлен в соответствии с ГОСТ 19.103-77 – в части наименования и обозначения, ГОСТ 19.106-78 – в части оформления, ГОСТ 19.505-79 – в части структуры и содержания. Автор Ворожев А. В. Страница 3 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» СОДЕРЖАНИЕ 1 Назначение программы ................................................................................................. 6 1.1 Общие сведения ....................................................................................................... 6 1.2 Возможности Программы ........................................................................................ 6 2 Условия выполнения программы ............................................................................... 7 2.1 Требования к программным и техническим средствам ....................................... 7 2.1.1 Требования к аппаратному обеспечению АРМ.......................................... 7 2.1.2 Требования к серверу ................................................................................... 8 2.1.3 Требования к сетевой инфраструктуре ...................................................... 9 3 Выполнение программы ............................................................................................. 11 3.1 Порядок загрузки данных и программ .................................................................. 11 3.2 Проверка работоспособности ............................................................................... 11 3.2.1 Проверка работоспособности работы клиента в ОС Windows .............. 11 3.2.2 Проверка работоспособности работы клиента в ОС Linux .................... 12 3.3 Общие сведения о пользовательском интерфейсе Программы ...................... 12 3.3.1 Реализация пользовательского интерфейса Программы ...................... 12 3.4 Структура пользовательского интерфейса Программы .................................... 12 3.4.1 Главное меню ............................................................................................... 13 3.4.2 Рабочая область .......................................................................................... 14 3.4.2.1 Управление отображением страницы ............................................... 14 3.4.2.2 Фильтры данных в таблицах ............................................................. 15 3.4.3 Страница «Рабочие станции» .................................................................... 18 3.4.3.1 Таблица рабочих станций ................................................................. 18 3.4.3.2 Подменю управления рабочей станцией .......................................... 21 3.4.3.2.1 Страница детальной информации о рабочей станции ...... 21 3.4.3.2.2 Страницы информации об аппаратном обеспечении, программном обеспечении и периферийном оборудовании рабочей станции ................................................................ 24 3.4.3.2.3 Страница «Задачи»............................................................ 24 3.4.3.2.4 Страница «Удалённый доступ» ......................................... 24 3.4.3.2.5 Страница «Автоматизации» ............................................... 24 3.4.3.2.6 Страница «Отчёты» ........................................................... 24 3.4.3.3 Групповые операции ......................................................................... 24 3.4.4 Подменю «Клиенты» ................................................................................... 25 3.4.4.1 Страница «Ключи Salt» ..................................................................... 25 3.4.4.1.1 Взаимодействие сервера и клиента Программы «Атом.Порт»....................................................................... 25 3.4.4.1.2 Установка статуса готовности рабочей станции к работе в Программе «Атом.Порт» .................................................... 26 3.4.4.2 Страница «Клиенты» ......................................................................... 28 Автор Ворожев А. В. Страница 4 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3.4.5 Подменю «Справочники»............................................................................ 31 3.4.6 Подменю «Управление» ............................................................................. 32 3.4.6.1 Страница «Графы» ........................................................................... 34 3.4.6.2 Страница «Автоматизации» .............................................................. 38 3.4.6.3 Страница «Задачи» ........................................................................... 40 3.4.7 Страница «Группы» ..................................................................................... 41 3.4.7.1 Общие сведения о группах Программы ............................................ 41 3.4.7.2 Создание группы ............................................................................... 42 3.4.8 Подменю «Служба каталогов» ................................................................... 43 3.4.8.1 Страница «Домены» .......................................................................... 43 3.4.9 Подменю «Система» ................................................................................... 45 3.4.9.1 Страница «Настройки» ...................................................................... 45 3.4.9.2 Страница «Пользователи» ................................................................ 47 3.4.9.2.1 Ролевая модель ................................................................. 47 3.4.9.2.2 Управление учётными записями пользователей ............... 48 3.4.9.2.3 Изменение принадлежности пользователей группам ........ 50 3.4.9.3 Страница «Файловый менеджер» ..................................................... 50 3.5 Изменение принадлежности рабочих станций к группам .................................. 53 3.6 Задачи и шаблоны задач клиента Программы ................................................... 54 3.7 Автоматизации ........................................................................................................ 57 3.7.1 Создание автоматизаций............................................................................ 57 3.7.2 Управление выполнением автоматизаций. Статусы автоматизаций ... 62 3.8 Встроенные сценарии управления конфигурациями ......................................... 66 3.8.1 Сценарий 1. Базовая миграция рабочих станций на отечественные ОС 72 3.8.2 Сценарий 2. Упрощенная миграция рабочих станций на отечественные ОС 73 3.8.3 Сценарий 3. Миграция рабочих станций на отечественные ОС с двойной загрузкой ........................................................................................ 73 3.9 Инструменты удалённого управления рабочими станциями ............................ 75 3.10 Создание отчётов ................................................................................................... 78 Перечень терминов ........................................................................................................... 80 Перечень сокращений и условных обозначений ....................................................... 81 Автор Ворожев А. В. Страница 5 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 1 Назначение программы 1.1 Общие сведения Система управления конфигурациями «Атом.Порт» (далее – Программа) — это программный комплекс, предназначенный для централизованного управления программными конфигурациями рабочих станций на базе операционных систем семейств GNU/Linux и Microsoft Windows. Программа предназначена для автоматизации следующих процессов: 1. инвентаризации автоматизированных рабочих мест (далее – АРМ) пользователей; 2. мониторинга состояния рабочих станций; 3. конфигурирования рабочих станций и групп рабочих станций, в том числе перевода (далее также – миграции) рабочих станций пользователей на использование российского ПО; 4. управления конфигурациями рабочих станций в гибридной инфраструктуре. 1.2 Возможности Программы Программа позволяет осуществлять следующие операции: 1. Получать актуальную и подробную информацию о действующем парке вычислительной техники предприятия, включая статистическую информацию об используемом аппаратном и программном обеспечении. 2. Осуществлять автоматизированную миграцию рабочих станций пользователей на российское офисное ПО, в том числе российскую ОС: 1) с созданием виртуальной машины с исходной ОС; 2) без создания виртуальной машины; 3) с альтернативной загрузкой ОС. 3. Управлять гибридной инфраструктурой по окончании процесса миграции, в том числе: 1) устанавливать, обновлять и удалять ПО для ОС Linux; 2) управлять сертификатами электронной цифровой подписи; 3) управлять учётными записями локальных пользователей; 4) подключать печатно-копировальное оборудование; 5) администрировать рабочую станцию с использованием удалённого рабочего стола. Автор Ворожев А. В. Страница 6 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 2 Условия выполнения программы 2.1 Требования к программным и техническим средствам Программа может быть установлена как на выделенный сервер, так и на виртуальную машину под управлением совместимого дистрибутива GNU/Linux. Программе требуется один высокоскоростной сетевой интерфейс. Должен предоставляться сетевой адрес, корректно настроенный DNS-сервер и шлюз с доступом к сети Интернет. Программе должно быть предоставлено достаточное дисковое хранилище, подключенное непосредственно к Серверу, либо предоставляемое по одному из поддерживаемых сетевых протоколов. Сетевой интерфейс сервера «Атом.Порт» должен быть доступен для рабочих станций. Для работоспособности всех функций Программы сетевые интерфейсы рабочих станций также должны быть доступны для сервера «Атом.Порт». Сетевой экран должен позволять подключения к ряду предопределённых портов, указанных в разделе 2.1.3 настоящего документа. Сервер «Атом.Порт» активно взаимодействует с управляемыми рабочими станциями с использованием нескольких сетевых протоколов и должен быть добавлен в разрешающий список системы предотвращения вторжений. 2.1.1 Требования к аппаратному обеспечению АРМ Таблица 1 – Требования к аппаратному обеспечению АРМ Без создания С созданием виртуальной машины виртуальной машины № Параметр Минималь- Рекомендуе- Минималь- Рекомендуе- ное значение мое значение ное значение мое значение 1. Ар хитектура процессора x86_64 x86_64 x86_64 x86_64 2. Та ктовая частота 1.2 1.2 1.8 2 процессора, ГГц 3. Ко личество ядер 2 2 4 4 процессора, шт. 4. Об ъем оперативной 2 4 8 8 памяти, ГБ 5. До ступное свободное 20 50 100 200 место на жестком диске или твердотельном накопителе, Гбайт 6. Оп ерационная система Windows 7 / 8 Windows 7 / 8 Windows 7 / 8 Windows 7 / 8 / 8.1 / 10 / 8.1 / 10 / 8.1 / 10 / 8.1 / 10 Автор Ворожев А. В. Страница 7 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» В сценарии миграции с созданием виртуальной машины с ОС Windows, работающей под управлением отечественной ОС, материнская плата рабочей станции должна поддерживать технологию виртуализации (Intel VT, AMD SVM). РС должна иметь возможность локального или сетевого подключения к печатающему устройству. Общие требования:  Оборудование должно быть совместимо с дистрибутивом развёртываемой операционной системы и отвечать его системным требованиям.  На рабочих станциях в настройках микропрограммы EFI должен быть отключен протокол Secure Boot.  На накопителе, содержащем системный раздел, не должно содержаться динамических и шифрованных разделов.  Недопустимы блокировки доступа к информации на HDD со стороны систем безопасности. Каталоги пользователей должны быть открыты на чтение и запись. 2.1.2 Требования к серверу Аппаратные требования к серверу «Атом.Порт» определяются планируемой максимальной единовременной нагрузкой на Программу. Нагрузка, в свою очередь, зависит от количества обслуживаемых рабочих станций. Таблица 2 – Требования серверу Минимальное значение № Параметр Для небольшой Для инфраструктуры инфраструктуры среднего размера (не более 100 рабочих (от 100 до 2000 рабочих станций) станций) 1. Ар хитектура процессора x86_64 x86_64 2. Та ктовая частота процессора, 1.8 2 ГГц 3. Ко личество ядер процессора, 4 8 шт. 4. Об ъем оперативной памяти, 4 16 ГБ 5. До ступное свободное место 80 200 на накопителе на жестких магнитных дисках или твердотельном накопителе, Гбайт 6. Пр опускная способность 100 1000 сетевого интерфейса, Мбит/с Автор Ворожев А. В. Страница 8 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 2.1.3 Требования к сетевой инфраструктуре Для рабочих станций должны быть доступны следующие TCP-порты сервера: 22 (SSH), 4505 (AMQ), 4506 (AMQ). Пользователю Программы должны быть доступны TCP-порты 22 (SSH), 80 (HTTP), 443 (HTTPS) сервера. Трансляция сетевых адресов (NAT) между сервером и рабочими станциями должна отсутствовать для обеспечения работоспособности функции отслеживания онлайн-статуса рабочих станций. Для удалённого управления необходима доступность TCP-порта 22 (SSH) на рабочих станциях. Для графического доступа требуется доступность TCP-портов 5900, 5901, 3389 (RDP), а также UDP-порта 3389 (RDP). Для выполнения работ по миграции и обслуживанию рекомендуется организовать внешний доступ к серверу «Атом.Порт» при помощи технологии VPN. Доступ может быть организован средствами сервера «Атом.Порт» в случае согласования разрешительной политики. В случае необходимости создания резервных копий и образов дисков (в некоторых сценариях перевода АРМ на использование отечественного ПО) необходимо предусмотреть дополнительное локальное хранилище на сервере «Атом.Порт» либо автономное файловое хранилище с доступом по протоколу SSH. Для выполнения одновременного перевода АРМ на использование отечественного ПО с созданием виртуальной машины рекомендуется обеспечить ресурс файлового хранилища не менее 1 Тбайт для каждых десяти АРМ, планируемых к переводу. В случае необходимости ввода рабочих станций в домен Microsoft Windows необходимо обеспечить наличие контроллера домена, доступного рабочим станциям. Применение сценария, предполагающего создание виртуальной машины с сетевым интерфейсом, функционирующем в режиме моста, дополнительно требует обеспечить:  наличие доступного рабочим станциям DHCP-сервера с пулом адресов, достаточным для выдачи рабочим станциям и виртуальным машинам;  отсутствие иного сетевого оборудования, подключенного к физическому сетевому интерфейсу рабочей станции в режиме моста (например, IP- телефонов);  сетевые коммутаторы должны позволять использование нескольких клиентских MAC-адресов на одном порту. Ключевое влияние на скорость процессов миграции оказывает скорость обмена данными между рабочими станциями, с одной стороны, и, сервером и файловым Автор Ворожев А. В. Страница 9 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» хранилищем, с другой стороны. Основными факторами, ограничивающими скорость, являются:  пропускная способность дисковых подсистем рабочих станций, сервера и хранилища;  пропускная способность сегментов сети между рабочей станцией и сервером, рабочей станцией и файловым хранилищем, включая сетевые интерфейсы сервера, файлового хранилища и рабочей станции, а также всё коммутационное оборудование, образующее соответствующий сегмент сети. На каждые три рабочие станции, одновременно участвующие в процессах миграции, необходимо не менее 100 Мбит/c пропускной способности. Автор Ворожев А. В. Страница 10 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3 Выполнение программы 3.1 Порядок загрузки данных и программ Развёртывание Программы и подготовка к работе осуществляется в соответствии с документом «Руководство системного администратора» На ПК, имеющем доступ к серверу «Атом.Порт», ввести в строке адреса веб-браузера: http://<адрес сервера> Выполнить аутентификацию в Программе: имя пользователя: admin пароль пользователя: password 3.2 Проверка работоспособности 3.2.1 Проверка работоспособности работы клиента в ОС Windows Для выявления проблем в работе клиента Программы «Атом.Порт» в ОС Linux необходимо:  убедиться, что клиент Программы установлен – в списке установленных программ должна присутствовать запись salt minion;  убедиться, что клиент Программы запущен – при выполнении в командной строке команды sc query salt-minion должно отобразиться состояние «RUNNING». Пример вывода: Имя_службы: salt-minion Тип : 10 WIN32_OWN_PROCESS Состояние : 4 RUNNING (STOPPABLE, NOT_PAUSABLE, ACCEPTS_SHUTDOWN) Код_выхода_Win32 : 0 (0x0) Код_выхода_службы : 0 (0x0) Контрольная_точка : 0x0 Ожидание : 0x0  убедиться, что есть связь с сервером: o При выполнении команды ping <IP-адрес сервера Атом.Порт> должно выводиться сообщение об отсутствии потерь пакетов (0% потерь) o При выполнении команды salt-call test.ping должен выдаваться ответ: local: True o В выводе команды netstat -an | findstr 450 должна присутствовать строка: <IP-адрес сервера Атом.Порт>:4505 ESTABLESHED либо <IP-адрес сервера Атом.Порт>:4506 ESTABLESHED Автор Ворожев А. В. Страница 11 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз»  убедиться, что архитектура системы и клиента совпадают, для этого запустить: C:\\Program Files\\Salt Project\\Salt\\bin\\python.exe. На экране в 64-разрядных системах должна появиться строка, содержащая текст: 64 bit (AMD64) 3.2.2 Проверка работоспособности работы клиента в ОС Linux В таблице 3 представлен перечень процессов и утилит, выполняемых на АРМ, с указанием формируемых ими файлов журналов. Таблица 3 – Процессы, выполняемые на АРМ Имя процесса Файлы № (исполняемого Назначение журналов файла) 1 salt-minion Служба клиента SaltStack /var/log/salt/minion В файлах журналов не должно быть сообщений о повторяющихся приоритетных ошибках (уровень «ERROR» и выше). 3.3 Общие сведения о пользовательском интерфейсе Программы 3.3.1 Реализация пользовательского интерфейса Программы Пользовательский интерфейс Программы представляет собой одностраничное приложение (англ. single page application, SPA) — веб-приложение, использующее единственный HTML-документ как оболочку для всех функциональных блоков интерфейса, и организующее взаимодействие с пользователем через динамически подгружаемые модули HTML, CSS, JavaScript. 3.4 Структура пользовательского интерфейса Программы После входа в систему в окне браузера должен отобразиться пользовательский интерфейс Программы (Рисунок 1). В верхней части страницы справа расположена пиктограмма, запускающая диалоговое окно управления профилем активного пользователя Программы (Рисунок 1, поз. 11). Окно интерфейса Программы делится на два функциональных блока:  Главное меню (Рисунок 1, поз. 1)  Рабочая область (Рисунок 1, поз. 2) Автор Ворожев А. В. Страница 12 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3.4.1 Главное меню Главное меню имеет древовидную структуру и позволяет переключать набор инструментов в Рабочей области интерфейса. В Главном меню расположены пункты меню:  «Рабочие станции» – открывает страницу, содержащую инструменты для работы с рабочими станциями, зарегистрированными в Программе. При выборе данного пункта меню в рабочей области отображается таблица с информацией о рабочих станциях. Таблица содержит интерактивные элементы, предназначенные для просмотра детальной информации, связанной с рабочими станциями, и для перехода к инструментам управления конфигурациями рабочих станций. Информация в данной таблице носит статический характер.  «Клиенты» – подменю, предназначенное для работы с информацией, полученной от экземпляров клиентов Программы для различных ОС1. При выборе данного пункта меню в рабочей области отображается таблица с информацией о рабочих станциях, полученной от всех установленных экземпляров клиентов.  «Справочники» – подменю, предназначенное для работы со статистической информацией, полученной при выполнении на рабочих станциях автоматизаций, предназначенных для инвентаризации АРМ пользователей.  «Управление» – подменю, предназначенное для просмотра и редактирования сценариев управления конфигурациями (графов), управления выполнением и мониторинга процессов управления конфигурациями рабочих станций (автоматизаций).  «Группы» – открывает страницу, с инструментарием для работы с группами рабочих станций.  «Служба каталогов» – подменю, предназначенное для управления записями, содержащими информацию для аутентификации в службах каталогов с целью присоединения рабочих станций к доменам.  «Система» – подменю, предназначенное для управления общими настройками Программы, учётными записями пользователей Программы, а также файлами, используемыми в качестве параметров задач и автоматизаций. Подробные описания инструментов Программы, доступных из Главного меню, приведены в разделах 3.4.3 – 3.4.9. 1 На различных этапах своего цикла эксплуатации рабочая станция может запускаться под управлением различных ОС. Система «Атом.Порт» имеет 3 версии клиента: Клиент для ОС Windows, Клиент для ОС Windows, Служебный клиент (для вспомогательной ОС, или среды установки). Автор Ворожев А. В. Страница 13 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3.4.2 Рабочая область 3.4.2.1 Управление отображением страницы После авторизации в Программе в рабочей области по умолчанию отображается таблица со списком рабочих станций, зарегистрированных на сервере «Атом.Порт» (Рисунок 1, поз. 3). Рисунок 1 – Рабочее окно пользовательского интерфейса Программы В нижней части страницы слева размещены элементы управления отображением страницы:  Кнопка включения режима автоматического обновления данных на странице (Рисунок 1, поз. 7) При включении режима автоматического обновления цвет кнопки меняется на синий.  Кнопка выбора столбцов таблицы (Рисунок 1, поз. 8) При нажатии кнопки открывается диалоговое окно выбора столбцов таблицы для отображения на странице (Рисунок 2). В верхней части диалогового окна расположена строка поиска наименования столбца в перечне доступных. Ниже в диалоговом окне отображается перечень доступных столбцов. Для отображения столбцов в таблице необходимо установить соответствующие флажки. Автор Ворожев А. В. Страница 14 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Рисунок 2 – Диалоговое окно выбора столбцов таблицы  Кнопка сброса настроек отображения страницы в значения по умолчанию (Рисунок 1, поз. 9) При нажатии кнопки все настройки отображения страницы (настройки пагинации, отображения столбцов и прочие) устанавливаются в значения по умолчанию. В нижней части рабочей области справа размещены элементы управления пагинацией и поле установки количества отображаемых на странице строк таблицы (Рисунок 1, поз. 10). 3.4.2.2 Фильтры данных в таблицах В верхней части рабочей области слева размещены элементы управления фильтром данных таблицы:  Кнопка фильтрации по значению поля (Рисунок 1, поз. 5) При нажатии кнопки открывается диалоговое окно фильтра по значению поля (Рисунок 3). В диалоговом окне расположены следующие поля ввода: «Поле для фильтрации» – в данном поле указывается поле (имя столбца) таблицы, по значению которого выполняется фильтрация; «Оператор сравнения» – варианты выбора в данном поле зависят от типа значения поля для фильтрации; «Значение» – в данном поле указывается одно или несколько вариантов значения поля, при этом, если указано несколько значений, в правиле фильтрации они объединяются логическим оператором «ИЛИ» Автор Ворожев А. В. Страница 15 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» (Рисунок 3, поз. 1). В верхней части поля ввода расположена строка поиска наименования столбца в перечне доступных; Рисунок 3 – Диалоговое окно фильтра по значению поля В нижней части диалогового окна фильтра по значению поля расположена кнопка «Применить фильтр». После нажатия на данную кнопку правило фильтрации немедленно применяются к таблице. К таблице может одновременно применяться несколько правил фильтрации. Для этого после применения очередного фильтра необходимо повторно нажать кнопку фильтрации по значению поля (Рисунок 1, поз. 5), ввести параметры нового правила фильтрации и применить фильтр. Отдельные правила фильтрации объединяются в фильтре логическим оператором «И» и отображаются в виде блоков правее кнопок управления фильтрами (Рисунок 3, поз. 2). Любой блок правила фильтрации может быть удалён или отредактирован. Автор Ворожев А. В. Страница 16 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз»  Меню управления сохранёнными фильтрами (Рисунок 4) Рисунок 4 – Меню управления сохранёнными фильтрами Меню управления сохранёнными фильтрами предназначено для сохранения и последующего использования фильтров, применённых к таблице. В меню управления сохранёнными фильтрами входят следующие пункты: «Сохранить фильтр» – предназначен для сохранения фильтра, применённого к таблице, для последующего использования. При выборе данного пункта открывается форма ввода параметров фильтра (Рисунок 5). В форме необходимо заполнить обязательное поле «Название», при необходимости настроить другие параметры и нажать кнопку «Сохранить фильтр»; Рисунок 5 – Окно параметров сохранённого фильтра Автор Ворожев А. В. Страница 17 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» «Загрузить фильтр» – фильтр с названием, выбранным из списка сохранённых фильтров, применяется к таблице, отображаемой на текущей странице (Рисунок 6); Рисунок 6 – Загрузка сохранённого фильтра «Удалить фильтр» – удаляется фильтр с названием, выбранным из списка сохранённых фильтров; «Очистить поля для фильтрации – выполняется сброс фильтров; 3.4.3 Страница «Рабочие станции» 3.4.3.1 Таблица рабочих станций Страница «Рабочие станции» открывается при выборе пункта «Рабочие станции» в Главном меню. Запись рабочей станции – это строка таблицы рабочих станций – набор полей и их значений, однозначно представляющих объект управления конфигурацией – физическую рабочую станцию. В таблице рабочих станций отображаются данные, полученные от клиентов Программы (миньонов) для различных ОС – как установленных ранее (на предыдущих этапах цикла эксплуатации рабочей станции), так и функционирующих в момент просмотра таблицы. В таблице 4 приведены сведения о полях, доступных для отображения в таблице рабочих станций (поля, отображаемые по умолчанию, указаны жирным шрифтом). Автор Ворожев А. В. Страница 18 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Все указанные поля можно выбрать для отображения в диалоговом окне выбора столбцов таблицы (см. описание в разделе 3.4.2.1). Таблица 4 – Поля таблицы рабочих станций Связанный Поле Назначение элемент интерфейса ID Числовой идентификатор рабочей станции в Страница установленном экземпляре Программы детальной информации о рабочей станции (см. описание в разделе 3.4.3.2) Автоматизации Количество автоматизаций, назначенных рабочей Страница станции автоматизаций рабочей станции (см. описание в разделе 3.4.3.2.5) Инвентарный номер Инвентарный номер рабочей станции (опциональный, может задаваться пользователем вручную) Группы Список идентификаторов групп, в которые входит рабочая станция Описание Описание рабочей станции (опциональное, может добавляться пользователем вручную) Статус Состояние рабочей станции  Принятый – рабочая станция доступна для управления  Непринятый – рабочая станция недоступна для управления Создано Дата и время создания записи рабочей станции Группы Список названий групп, в которые входит рабочая станция Автоматизации Количество автоматизаций, назначенных рабочей станции Клиент (Windows): Полное наименование операционной системы, под ОС управлением которой работает клиент Программы для ОС Windows Клиент (Windows): Имя домена, в который входит рабочая станция с ОС домен Windows Клиент (Windows): IP-адрес мастера или промежуточного сервера Syndic «Атом.Порт», к которому подключена рабочая станция с ОС Windows Клиент (Windows): Модель BIOS BIOS Клиент (Windows): Модель центрального процессора CPU Клиент (Windows): Список IP-адресов сетевых интерфейсов, доступных из Окно детальной сетевые интерфейсы ОС Windows информации о сетевом интерфейсе Клиент (Windows): Идентификатор клиента Программы для ОС Windows в ID рамках установленного экземпляра Программы Клиент (Windows): Сетевое имя рабочей станции с ОС Windows хост Автор Ворожев А. В. Страница 19 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Связанный Поле Назначение элемент интерфейса Клиент (Windows): Полное доменное имя рабочей станции с ОС Windows FQDN Клиент (Windows): Уникальный идентификатор (UUID) клиента Программы UUID для ОС Windows Клиент (Windows): Объём оперативной памяти, доступной в ОС Windows ОЗУ Клиент (Windows): Модель материнской платы (платформа ПК) материнская плата Клиент (Windows): Среда виртуализации, в которой выполняется ОС Virtual Windows Клиент (Windows): Номер версии ПО Python3 для ОС Windows версия Python Клиент (Windows): Номер версии ПО salt-minion для ОС Windows версия Salt Клиент (Windows): Состояние сетевой активности рабочей станции с ОС посл. активность Windows Клиент (Linux): Полное наименование операционной системы, под ОС управлением которой работает клиент Программы для ОС Linux Клиент (Linux): Имя домена, в который входит рабочая станция с ОС домен Linux Клиент (Linux): IP-адрес мастера или промежуточного сервера Syndic «Атом.Порт», к которому подключена рабочая станция с ОС Linux Клиент (Linux): Модель BIOS BIOS Клиент (Linux): Модель центрального процессора CPU Клиент (Linux): Список IP-адресов сетевых интерфейсов, доступных из Окно детальной сетевые интерфейсы ОС Linux информации о сетевом интерфейсе Клиент (Linux): Идентификатор клиента Программ для ОС Linux в рамках ID установленного экземпляра Программы Клиент (Linux): Сетевое имя рабочей станции с ОС Linux хост Клиент (Linux): Полное доменное имя рабочей станции с ОС Linux FQDN Клиент (Linux): Уникальный идентификатор (UUID) клиента Программы UUID для ОС Linux Клиент (Linux): Объём оперативной памяти, доступной в ОС Linux ОЗУ Клиент (Linux): Модель материнской платы (платформа ПК) материнская плата Клиент (Linux): Среда виртуализации, в которой выполняется ОС Linux Virtual Клиент (Linux): Номер версии ПО Python3 для ОС Linux версия Python Клиент (Linux): Номер версии ПО salt-minion для ОС Linux версия Salt Автор Ворожев А. В. Страница 20 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Связанный Поле Назначение элемент интерфейса Клиент (Linux): Состояние сетевой активности рабочей станции с ОС посл. активность Windows Клиент (служебный): Полное наименование операционной системы, под ОС управлением которой работает служебный клиент Программы Клиент (служебный): Имя домена, в который входит рабочая станция со домен служебной ОС Клиент (служебный): IP-адрес мастера или промежуточного сервера Syndic «Атом.Порт», к которому подключена рабочая станция со служебной ОС Клиент (служебный): Модель BIOS BIOS Клиент (служебный): Модель центрального процессора CPU Клиент (служебный): Список IP-адресов сетевых интерфейсов, доступных из Окно детальной сетевые интерфейсы служебной ОС информации о сетевом интерфейсе Клиент Идентификатор клиента Программы для служебной ОС в (служебный): рамках установленного экземпляра Программы ID Клиент (служебный): Сетевое имя рабочей станции со служебной ОС хост Клиент (служебный): Полное доменное имя рабочей станции со служебной ОС FQDN Клиент (служебный): Уникальный идентификатор (UUID) клиента Программы UUID для служебной ОС Клиент (служебный): Объём оперативной памяти, доступной в служебной ОС ОЗУ Клиент (служебный): Модель материнской платы (платформа ПК) материнская плата Клиент (служебный): Среда виртуализации, в которой выполняется служебная Virtual ОС Клиент (служебный): Номер версии ПО Python3 для служебной ОС версия Python Клиент (служебный): Номер версии ПО salt-minion для служебной ОС версия Salt Клиент Состояние сетевой активности рабочей станции с ОС (служебный): Windows посл. активность 3.4.3.2 Подменю управления рабочей станцией 3.4.3.2.1 Страница детальной информации о рабочей станции Страница детальной информации о рабочей станции открывается при нажатии на ссылку в поле «ID» записи рабочей станции. Автор Ворожев А. В. Страница 21 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» На рисунке 7 показан пример страницы детальной информации о рабочей станции. Рисунок 7 – Страница детальной информации о рабочей станции  Блок идентификационных данных рабочей станции (Рисунок 7, поз. 1). В этом блоке отображаются уникальный идентификатор (UUID) и дата создания записи о рабочей станции. Внизу блока идентификационных данных расположено поле с описанием рабочей станции. При нажатии на пиктограмму 🖉 выводится форма ввода (редактирования) описания.  Кнопка «Инвентарный номер» (Рисунок 7, поз. 2). При нажатии кнопки выводится форма ввода инвентарного номера.  Кнопка «Автоматизации» (Рисунок 7, поз. 3). При нажатии кнопки осуществляется переход на страницу автоматизаций, назначенных данной рабочей станции. Автор Ворожев А. В. Страница 22 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз»  Кнопка «Отчёты» (Рисунок 7, поз. 4). При нажатии кнопки осуществляется переход на страницу отчётов, созданных для данной рабочей станции.  Блок групп (Рисунок 7, поз. 5). В этом блоке отображаются названия групп, в которые входит данная рабочая станция.  Блок «Активность клиента» (Рисунок 7, поз. 6). В этом блоке расположена диаграмма активности миньонов для разных операционных систем с момента, когда впервые было установлено соединение с сервером, до настоящего времени. Кнопка настройки диаграммы (Рисунок 7, поз. 7) позволяет выбрать интервал активности для отображения на диаграмме.  Блоки «Клиент Linux», «Служебный клиент», «Клиент Windows» (Рисунок 7, поз. 8, 12, 16, соответственно). В этих блоках расположены: o блок общей информации о клиенте (Рисунок 7, поз. 9, 13, 17); o блок детальной информации об аппаратном обеспечении ПК (Рисунок 7, поз. 10, 14, 18); при нажатии на пиктограммы в данном блоке отображаются:  справочные данные о центральном и графическом процессорах;  детальная информация о настройках сетевого интерфейса;  ёмкости разделов диска; o элементы управления клиентом Программы (Рисунок 7, поз. 11, 15, 19):  ссылка на страницу задач клиента Программы для соответствующей ОС;  ссылка на страницу управления сеансами удалённого доступа (только для ОС Linux);  ссылки на страницы с табличной информацией об аппаратном и программном обеспечении, периферийном оборудовании рабочей станции. 🛈 При нажатии кнопки справа от названия миньона выводится окно с информацией о рабочей станции, полученной от миньона для соответствующей ОС. Статус миньона отображается в виде цветного кружка: красного ● – в случае отсутствия соединения с миньоном, зелёного ● – в случае наличия соединения с миньоном, серого ● – в случае, когда миньон для данной ОС ещё не был установлен. Автор Ворожев А. В. Страница 23 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3.4.3.2.2 Страницы информации об аппаратном обеспечении, программном обеспечении и периферийном оборудовании рабочей станции Переход на страницы информации осуществляется с помощью элементов управления клиентом Программы (Рисунок 7, поз. 11, 15, 19) или из подменю «Windows клиент», «Linux клиент», «Служебный клиент» соответствующей рабочей станции, входящих в дерево главного меню. Состав информации, представленной на данных страницах, подробно описан в разделе 3.4.5. 3.4.3.2.3 Страница «Задачи» Описание инструментов управления задачами клиентов Программы приведено в разделе 3.6. 3.4.3.2.4 Страница «Удалённый доступ» Описание инструментов удалённого доступа приведено в разделе 3.9. 3.4.3.2.5 Страница «Автоматизации» Описание инструментов для работы со сценариями управления конфигурациями рабочих станций приведено в разделе 3.7. 3.4.3.2.6 Страница «Отчёты» Описание средств создания отчётов приведено в разделе 3.10. 3.4.3.3 Групповые операции В верхней части страницы рабочих станций расположена Кнопка выбора групповой операции (Рисунок 1, поз. 4). Групповая операция – это любая операция, выполняемая с одной или несколькими рабочими станциями, из следующего перечня:  Изменение статуса готовности рабочей станции к миграции (описание см. в разделе 3.4.4.1.2);  Создание автоматизации (описание см. в разделе 3.7.1);  Изменение принадлежности объектов к группам (описание см. в разделах 3.4.9.2.3 – для пользователей, 3.5 – для рабочих станций);  Создание отчёта (описание см. в разделе 3.10);  Экспорт записей рабочих станций в табличный документ. Автор Ворожев А. В. Страница 24 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3.4.4 Подменю «Клиенты» 3.4.4.1 Страница «Ключи Salt» Страница «Ключи Salt» открывается при выборе пункта «Ключи Salt» в подменю «Клиенты» Главного меню. 3.4.4.1.1 Взаимодействие сервера и клиента Программы «Атом.Порт» В основе взаимодействия сервера «Атом.Порт» и управляемых рабочих станций лежит программное обеспечение SaltStack – модульная система управления конфигурациями, написанная на языке Python. В топологии системы на базе ПО SaltStack могут использоваться три типа узлов:  главный сервер («мастер») – полнофункциональный сервер, направляющий клиентам («миньонам») команды управления конфигурацией и выполняющий обработку публикаций и событий, получаемых от миньонов. На мастере функционирует служба salt-master;  промежуточный сервер («синдик») – этот тип сервера можно рассматривать как специальный сквозной узел. На синдике функционируют службы salt-syndic и salt-master. Служба salt-master управляет группой миньонов более низкого уровня, а служба salt-syndic подключает главный узел более высокого уровня. Служба salt-syndic ретранслирует публикации и события между главным узлом и локальной службой salt-master. Это дает мастеру контроль над миньонами, находящимися ниже в топологии, и подключенными к службе salt-master, работающей на синдике. Использование синдиков обеспечивает большую структурную гибкость и масштабируемость при построении топологий SaltStack, чем топологии, построенные только из типов узлов «мастер» и «миньон».  Клиент («миньон»2) – узел, на котором функционирует служба salt-minion, получающая команды от мастера и выполняющая запрошенные задачи управления конфигурацией. При первом запуске миньон устанавливает соединение с сервером, адрес которого указан в конфигурационном файле миньона. Миньон инициирует процедуру «рукопожатия» и отправляет свой публичный ключ серверу. 2 Система «Атом.Порт» имеет 3 версии клиента: Клиент для ОС Windows, Клиент для ОС Windows, Служебный клиент (для вспомогательной ОС, или среды установки). Автор Ворожев А. В. Страница 25 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» После первоначального соединения публичный ключ миньона сохраняется на сервере. Для дальнейшей работы миньона в инфраструктуре SaltStack ключ должен быть принят на мастере. После принятия публичного ключа миньона мастер передаёт свой публичный ключ вместе с ротируемым симметричным ключом AES, используемым для шифрования и дешифрования сообщений, передаваемых мастером. Ключ AES передаётся зашифрованным публичным ключом, полученным ранее от миньона. Весь дальнейший обмен между мастером и миньоном шифруется ключами AES. Ротация ключа AES используется для шифрования задач, отправляемых мастером миньону, и для шифрования соединений с файловым сервером мастера. Ключ генерируется повторно при каждом перезапуске мастера, а также каждый раз, когда ключ миньона удаляется командой salt-key. После ротации ключа все миньоны должны выполнить повторную аутентификацию для получения обновлённого ключа. Это позволяет выполнять ротацию ключа AES без необходимости прерывания соединения с миньоном. Данные публикаций между мастером и миньоном шифруются ключом AES с ротацией. При прямом взаимодействии мастера и миньона данные шифруются уникальным ключом AES для каждой сессии. 3.4.4.1.2 Установка статуса готовности рабочей станции к работе в Программе «Атом.Порт» В Программе используется механизм автоматического принятия ключей миньонов. При первой регистрации в Программе рабочей станции присваивается статус «Принятый». Запись рабочей станции в базе данных Программы соответствует одной физической рабочей станции. При выполнении автоматизаций с установкой новых ОС на одну рабочую станцию идентификатор миньона наследуется миньоном в новой ОС, и привязка миньона к записи рабочей станции происходит автоматически. Автор Ворожев А. В. Страница 26 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» На рисунке 8 приведён пример страницы с таблицей ключей Salt. Рисунок 8 – Таблица ключей Salt Внимание! Для обеспечения корректной привязки миньона к рабочей станции не удаляйте вручную ключи шифрования, находящиеся в соответствующих каталогах установки ПО SaltStack на серверах и рабочих станциях! Для исключения возможности запуска на рабочей станции задач, автоматизаций и сеансов удалённого доступа необходимо назначить ей статус «Отклоненный», используя следующий алгоритм: 1. В главном меню веб-интерфейса перейти на страницу «Рабочие станции». 2. Отметить флажками рабочие станции, статус которых необходимо изменить на «Отклоненный» (Рисунок 9, поз. 1). 3. Нажать кнопку «Групповые операции» (Рисунок 9, поз. 2). 4. В открывшемся окне выбрать пункт «Изменить статус» (Рисунок 9, поз. 3). 5. В открывшемся окне выбрать значение «Отклоненный» и нажать кнопку «Изменить» (Рисунок 10). Статус рабочих станций будет изменён. Автор Ворожев А. В. Страница 27 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Рисунок 9 – Выбор рабочих станций для изменения статуса Рисунок 10 – Выбор статуса рабочей станции «Отклоненный» При установке статуса рабочей станции производится одновременное изменение статусов ключей всех связанных с ней клиентов Программы из значения «accepted» в значение «rejected». 3.4.4.2 Страница «Клиенты» Страница «Клиенты» открывается при выборе пункта «Клиенты» в подменю «Клиенты» Главного меню. В таблице 5 приведены сведения о полях, доступных для отображения в таблице клиентов (поля, отображаемые по умолчанию, указаны жирным шрифтом). Автор Ворожев А. В. Страница 28 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Все указанные поля можно выбрать для отображения в диалоговом окне выбора столбцов таблицы (см. описание в разделе 3.4.2.1). Таблица 5 – Поля таблицы клиентов Связанный Поле Назначение элемент интерфейса ID Числовой идентификатор клиента Программы в установленном экземпляре Программы Клиент ID Идентификатор клиента Программы для ОС Linux в рамках установленного экземпляра Программы UUID Уникальный идентификатор (UUID) клиента Программы Последняя активность Состояние сетевой активности клиента Программы Мат. плата: модель Модель материнской платы Мат. плата: название Название материнской платы Мат. плата: продукт Мат. плата: производитель Производитель материнской платы Мат. плата: версия Версия модели материнской платы Мат. плата: серийный номер Серийный номер материнской платы Мат. плата: part номер Обозначение (part number) материнской платы BIOS: дата релиза Дата релиза BIOS BIOS: версия Версия BIOS Secure Boot Признак включения режима безопасной загрузки Вариант загрузки Используемый протокол загрузки рабочей станции (Legacy/UEFI) CPU: модель Модель ЦП CPU: архитектура Архитектура ЦП CPU: количество Количество ЦП в многопроцессорных системах CPU: сокет Сокет ЦП CPU: кол-во ядер Количество вычислительных ядер ЦП CPU: кол-во потоков Количество вычислительных потоков ЦП с учётом Hyperthreading CPU: частота Номинальная тактовая частота ЦП CPU: мощность Выделяемая тепловая мощность («тепловой пакет») ЦП CPU: рейтинг Рейтинг производительности ЦП по терминологии вендора cwd Текущая рабочая директория модуля salt.grains Диски Перечень дисковых/твердотельных Окно детальной накопителей рабочей станции информации о дисковых разделах Домен: название Имя домена Домен: сервер IP-адрес контроллера домена Автор Ворожев А. В. Страница 29 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Связанный Поле Назначение элемент интерфейса LDAP: domain LDAP-атрибуты рабочей станции в схеме AD LDAP: lastLogoff LDAP: lastLogon LDAP: lastLogonTimestamp LDAP: pwdLastSent LDAP: badPasswordTime LDAP: cn LDAP: name LDAP: distinguishedName LDAP: objectCategory LDAP: sAMAccountName LDAP: operatingSyatem LDAP: operatingSystemVersion LDAP: operatingSyatemServicePack LDAP: dNSHostName LDAP: location LDAP: description LDAP: logonCount LDAP: badPwdCount LDAP: whenChanged LDAP: whenCreated LDAP: managedBy LDAP: memberOf FQDN Полное доменное имя рабочей станции GPU: модель Модель графического адаптера GPU: чип Набор микросхем графической подсистемы GPU: память Объём оперативной памяти графической подсистемы GPU: производитель Производитель графического адаптера Хост Сетевое имя рабочей станции Кол-во установленного ПО Сетевые интерфейсы Список IP-адресов сетевых интерфейсов, Окно детальной доступных из ОС клиента информации о сетевом интерфейсе Кол-во задач ОЗУ Объём оперативной памяти, доступной в ОС клиента Семейство ОС Название семейства (кодовой базы) ОС ОС отпечаток Краткое название ОС (с номером версии) Полное название ОС Полное название ОС Ядро Тип ядра ОС (Windows/Linux) Релиз ядра Номер релиза ядра ОС клиента Версия ядра Версия ядра ОС клиента (для Linux – с датой релиза) Автор Ворожев А. В. Страница 30 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Связанный Поле Назначение элемент интерфейса LSB описание LSB-дистрибутив Linux path Значение системной переменной path Ожидает перезагрузки Признак ожидания перезагрузки ОС Мат.плата python_executable Путь к исполняемому файлу python3 Версия Python Версия python3 Версия Salt Версия salt-minion Версия ZeroMQ Версия библиотеки ZeroMQ Пользователь Пользователь, в контексте которого выполняется служба salt-minion virtual Платформа виртуализации, на которой запущена рабочая станция virtualization Признак включенной аппаратной виртуализации на рабочей станции Поддержка VT-D Признак включения поддержки технологии VT-D в BIOS рабочей станции 3.4.5 Подменю «Справочники» На рисунке 11 показан состав подменю «Справочники». Все пункты меню открывают страницы со сводными таблицами об аппаратном и программном обеспечении, пользователях, периферийном оборудовании и сетевых дисках рабочих станций. Автор Ворожев А. В. Страница 31 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Имеется возможность с помощью табличного фильтра ограничить область источников данных одной рабочей станцией (клиентом Программы) или их группой. Рисунок 11 – Подменю «Справочники» Главного меню На странице «Отчёты» подменю «Справочники» доступна возможность загрузки отчётов. Средства создания отчётов описаны в разделе 0. 3.4.6 Подменю «Управление» Структура и функционирование сценариев управления конфигурациями Программы могут быть интерпретированы в понятиях теории графов. Сценарий управления конфигурацией рабочей станции — это записанная на встроенном в Программу декларативном языке разметки программа перевода рабочей станции в требуемое (целевое) состояние. Такой сценарий обладает свойством идемпотентности — воспроизводимости результата вне зависимости от начального состояния конфигурационных элементов, затрагиваемых сценарием, в том числе, при повторном выполнении сценария. Конфигурационный элемент — это любой компонент среды ИТ, для которого подразумевается управление конфигурацией и, таким образом, управление изменениями. Автор Ворожев А. В. Страница 32 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Граф — математическая модель описания сценария управления конфигурацией. В терминологии теории графов это взвешенный ориентированный граф, обладающий свойством ацикличности, т. е. не содержит контуров (замкнутых путей). Вершины графа (узлы) соответствуют либо атомарным операциям, таким как вызовы модулей SaltStack, операции присвоения значений переменным и т. п., либо составным операциям — рекурсивно вложенным графам. Направленные рёбра графа — дуги — соответствуют переходам между операциями сценария управления конфигурацией. Каждой дуге поставлено в соответствие значение – вес дуги. Первоначальные значения весов дуг определяются в файле описания графа. Путь на графе — последовательность дуг, в которой конец одной дуги является началом другой дуги. Граф имеет один или более путей от начального узла к конечному. Автоматизация — это созданный на основе графа вычислительный процесс, связанный с одной рабочей станцией, осуществляющий перевод её программной конфигурации в целевое состояние. Процесс может быть создан пользователем Программы либо порождён другой автоматизацией. Автоматизации могут передаваться аргументы, автоматизация может возвращать результат выполнения для использования в других автоматизациях или задачах Программы. При выполнении автоматизации осуществляется проход графа, при этом выбирается путь с наименьшим общим весом. Автоматизация может изменять вес дуги графа. Так, дуга к узлу, отмеченному успешно пройденным, становится невесомой, т. е. её вес становится равным 0. Вес дуги к узлу, пройденному неуспешно, т. е. в случае неуспешного выполнения операции, становится бесконечным. Изменённый вес дуги графа сохраняется в базе данных и оказывает влияние на выполнение автоматизаций того же типа. Автоматизация, вес кратчайшего пути которой вырос до бесконечного, считается неуспешной: нет возможности достичь конечной вершины. Некоторые вершины графа могут быть непосещёнными после выполнения автоматизации (т. е. операции, связанные с такими вершинами, не выполнены). Автор Ворожев А. В. Страница 33 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3.4.6.1 Страница «Графы» Страница «Графы» открывается при выборе пункта «Графы» в подменю «Управление» Главного меню. Пример таблицы графов приведён на рисунке 12. Рисунок 12 – Страница «Графы» В таблице 6 приведены сведения о полях, доступных для отображения в таблице графов (поля, отображаемые по умолчанию, указаны жирным шрифтом). Таблица 6 – Поля таблицы графов Поле Назначение ID Числовой идентификатор графа алгоритма в установленном экземпляре Программы Название Наименование графа Описание Краткое описание назначения графа Группы Список названий групп, в которые входит граф Использован, раз Количество использований графа для создания автоматизаций Процент Доля успешно выполненных автоматизаций, созданных на основе данного успешных графа Теги Параметры Признак наличия параметров вызова у автоматизаций, создаваемых на основе данного графа При нажатии на строке таблицы графов открывается страница свойств соответствующего сценария управления конфигурацией (Рисунок 13). В левой части страницы отображается граф алгоритма сценария, а в области сводной информации – блок «Информация о графе» с кратким описанием сценария. При нажатии на вершину графа в области сводной информации отображается блок «Информация об узле», содержащий информацию о соответствующей операции сценария. Автор Ворожев А. В. Страница 34 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Рисунок 13 – Страница свойств графа Автор Ворожев А. В. Страница 35 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» В таблице 7 приведён перечень атрибутов узла. Таблица 7 – Атрибуты узла Поле Назначение Имя Имя узла ID Идентификатор узла Описание Произвольное описание узла Источник Файл сценария, связанного с узлом Успешный вес Тип узла Может принимать значения:  UnitAutoProcess — создаёт дочернюю автоматизацию. Текущая автоматизация становится на паузу.  UnitCommand — запускает функции модулей исполнения SaltStack. Основной тип узла для конфигурирования рабочих станций.  UnitEnd — завершает путь. Конечный узел графа (сток).  UnitFail — безусловно устанавливает значение веса входящей дуги равным бесконечности. Используется преимущественно для отладки.  UnitGroup — добавляет и удаляет рабочую станцию из заданных групп.  UnitIF — условный оператор, выполняющий сравнение переменных Атом.Порт и литералов. Устанавливает вес входящей дуги в зависимости от результата.  UnitMessage — отправляет уведомление в Телеграм (интеграция с мессенджером должна быть настроена).  UnitPause — ожидает перед переходом к следующей вершине пути.  UnitRunner — запускает функции модулей SaltStack.  UnitSet — устанавливает значения переменных Атом.Порт.  UnitStart — начинает путь. Начальный узел графа (исток).  UnitSystemMessage — отправляет уведомление через интерфейс Атом.Порт.  UnitWaitingMinion — ожидает доступности миньона указанного типа. Используется при перезагрузке рабочей станции в другую операционную систему. Максимальное Максимально допустимое количество попыток выполнения операции при количество попыток возникновении ошибок (до присвоения статуса выполнения «FAILED»). Автор Ворожев А. В. Страница 36 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» В верхней части страницы справа расположена кнопка запуска встроенного редактора (Рисунок 13, поз. 1), предназначенного для редактирования файла определения узла (Рисунок 14). Рисунок 14 – Редактор графа На странице свойств графа также расположена кнопка масштабирования, позволяющая вписать граф в область отображения (Рисунок 13, поз. 2), и кнопка обновления страницы (Рисунок 13, поз. 3), предназначенная для повторной отрисовки графа после редактирования файла его определения. Автор Ворожев А. В. Страница 37 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3.4.6.2 Страница «Автоматизации» Страница «Автоматизации» открывается при выборе пункта «Автоматизации» в подменю «Управление» Главного меню. Пример таблицы графов приведён на рисунке 15. Рисунок 15 – Страница «Автоматизации» В таблице 8 приведены сведения о полях, доступных для отображения в таблице автоматизаций (поля, отображаемые по умолчанию, указаны жирным шрифтом). Таблица 8 – Поля таблицы автоматизаций Связанный элемент Поле Назначение интерфейса ID Числовой идентификатор автоматизации в Страница свойств установленном экземпляре Программы автоматизации Рабочая станция Числовой идентификатор целевой рабочей станции Страница детальной информации о рабочей станции (см. описание в разделе 3.4.3.2) Граф Наименование графа, на основе которого создана автоматизация Кол-во процессов Количество процессов в составе автоматизации Источник Способ создания автоматизации. Может принимать значения:  “Web API” – запущена из интерфейса пользователя Программы  “Автоматизация” – является дочерней для другой автоматизации Создал Имя пользователя-владельца автоматизации Автор Ворожев А. В. Страница 38 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Связанный элемент Поле Назначение интерфейса ID источника Числовой идентификатор родительской автоматизации Страница свойств автоматизации Создан Дата и время создания автоматизации Статус Подробное описание статусов и переходов см. в разделе 3.7.2 На рисунке 16 приведён общий вид страницы свойств автоматизации. Возможности Программы по управлению выполнением автоматизациями описано в разделе 3.7.2. Рисунок 16 – Страница свойств автоматизации Автор Ворожев А. В. Страница 39 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Слева в нижней части страницы свойств графа также расположена кнопка масштабирования, позволяющая вписать граф в область отображения, и кнопка обновления страницы, предназначенная для обновления страницы. 3.4.6.3 Страница «Задачи» В Программе реализован инструментарий «Задачи», позволяющий выполнять на рабочих станциях модули SaltStack. В SaltStack явно разграничены императивные и декларативные модули. Execution modules — («модули выполнения») императивны и не идемпотентны. Модуль выполнения фактически представляет собой набор функционально связанных подпрограмм. State modules — («модули состояния») декларативны и идемпотентны. Модули состояния приводят систему в определенное состояние, описывая финальный (целевой) результат, а не процедуру достижения состояния. Задача может быть выполнена только на совместимом клиенте Программы. Инструментарий «Задачи» позволяет сохранять шаблоны вызовов функций модулей SaltStack с параметрами по умолчанию, описанием применения задачи и примерами использования. Страница «Задачи» открывается при выборе пункта «Задачи» в подменю «Управление» Главного меню. Пример страницы задач приведён на рисунке 17. Рисунок 17 – Страница «Задачи» Автор Ворожев А. В. Страница 40 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» В таблице 9 приведены сведения о полях, доступных для отображения в таблице задач (поля, отображаемые по умолчанию, указаны жирным шрифтом). Таблица 9 – Поля таблицы задач Поле Назначение JID Числовой идентификатор задачи Функция Имя вызываемой функции модуля SaltStack Создана Дата и время создания задачи Тип нацеливания Тип нацеливания на миньон Salt Может принимать значения:  glob  grain – использование для нацеливания данных, возвращаемых запросом grain  compound – сложное нацеливание (сочетание нескольких шаблонов в строке нацеливания) Нацеливание Строка нацеливания При нажатии кнопки раскрытия списка в строке задачи (Рисунок 17, поз. 1) отображаются списки позиционных и именованных параметров и JSON-запись результата, возвращённого функцией модуля SaltStack. Порядок создания задачи, сохранения и использования шаблонов задач описаны в разделе 3.6. 3.4.7 Страница «Группы» 3.4.7.1 Общие сведения о группах Программы Группа – множество объектов Программы, объединённых пользователем Программы по произвольному признаку, либо множество объектов, объединённых в результате выполнения какого-либо сценария управления конфигурацией. Группа универсальна, т. е. одна группа может содержать объекты различных типов, например, «пользователь», «рабочая станция», «граф». Группы могут образовывать иерархию. Между пользователями, с одной стороны, и объектами других типов, с другой стороны, включаемыми в одну группу, автоматически создаются отношения разрешения доступа: Тип доступа Субъект доступа Объект доступа  Пользователь может просматривать и управлять Рабочая станция Пользователь может применять для создания Граф автоматизации Страница «Группы» открывается при выборе пункта подменю «Группы» Главного меню. Автор Ворожев А. В. Страница 41 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» В левой части страницы расположено дерево групп (Рисунок 18, поз. 4). Рисунок 18 – Страница «Группы» Внимание! Порядок изменения принадлежности объектов к группам описан в разделах: для пользователей – 3.4.9.2.3, для рабочих станций – 3.5. 3.4.7.2 Создание группы Для создания новой группы необходимо: + 1. Нажать кнопку создания группы (Рисунок 18, поз. 1). 2. Ввести название группы, заполнить необязательное поле «Описание» (Рисунок 19). 3. При необходимости отметить флажком родительскую группу в поле «Родительская группа». 4. Нажать кнопку «Сохранить». В дереве групп отобразится новая группа. Рисунок 19 – Диалоговое окно создания новой группы Автор Ворожев А. В. Страница 42 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» На странице также расположены кнопки редактирования группы, действующая аналогично кнопке создания группы (Рисунок 18, поз. 2), и удаления группы (Рисунок 18, поз. 3). 3.4.8 Подменю «Служба каталогов» В некоторых сценариях управления конфигурациями в Программе, например, при переводе рабочих станций на использование российского ПО («миграции»), выполняется операция ввода рабочей станции в домен. Целевым доменом операции может являться как домен, в котором находится рабочая станция под управлением ОС Windows, так и иной домен, для которого в сети доступен контроллер домена. В Программе реализована возможность ввода рабочей станции с установленной ОС Linux в домены Microsoft Active Directory и FreeIPA. 3.4.8.1 Страница «Домены» Страница «Домены» открывается при выборе пункта «Домены» в подменю «Служба каталогов» Главного меню. Пример страницы приведён на рисунке 20. Для того, чтобы в процессе миграции ввести рабочие станции в домен, необходимо добавить в Программу информацию о домене. Для этого необходимо: Рисунок 20 – Список доменов Таблица 10 – Поля таблицы доменов Поле Назначение ID Числовой идентификатор домена в установленном экземпляре Программы Имя Имя домена Сервер IP-адрес контроллера домена (сервера LDAP) Администратор Имя учётной записи пользователя с правом ввода рабочих станций в домен или администратора домена Описание Описание домена Целевой домен Идентификатор целевого домена для ввода рабочей станции при установке новой ОС (для этого домена должна быть добавлена соответствующая запись в Программе). Добавлен Дата и время создания записи о домене Автор Ворожев А. В. Страница 43 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» + 1. Для создания описания нового домена нажать кнопку (Рисунок 20, поз. 1). 2. В открывшемся диалоговом окне (Рисунок 21) ввести информацию о домене (см. таблицу 10). 3. Нажать кнопку «Добавить домен». Рисунок 21 – Форма сведений о домене На странице также расположены кнопки редактирования записи таблицы доменов, действующая аналогично кнопке создания записи таблицы доменов (Рисунок 20, поз. 2), и удаления записи таблицы доменов (Рисунок 20, поз. 3). Автор Ворожев А. В. Страница 44 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3.4.9 Подменю «Система» 3.4.9.1 Страница «Настройки» Страница «Настройки» открывается при выборе пункта «Настройки» в подменю «Система» Главного меню. Пример страницы настроек приведён на рисунке 22. Рисунок 22 – Страница настроек Программы По умолчанию в Программе существует три группы настроек: INSTALL — установочные параметры экземпляра Программы. LDAP — настройки подключения к контроллеру домена для синхронизации групп Программы с организационными подразделениями домена. Поддерживаются домены Microsoft Active Directory и FreeIPA. TELEGRAM — настройки подключения к Telegram-боту для мониторинга и управления сервером Программы. Пользователь Программы может создавать дополнительные группы и настройки. + Для создания группы настроек используется кнопка , расположенная в блоке групп настроек (Рисунок 22, поз. 1). Автор Ворожев А. В. Страница 45 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» В диалоговом окне (Рисунок 23) ввести имя и описание группы настроек, для сохранения нажать кнопку «Ok». Рисунок 23 – Создание группы настроек + Для создания настройки используется кнопка , расположенная в блоке настроек (Рисунок 22, поз. 2). Название группы, в которой будет создана настройка, отображается слева в верхней части блока настроек. Группы настроек образуют одноуровневый список. В диалоговом окне (Рисунок 24) ввести имя и описание настройки, её значение, при необходимости маскирования значения на странице настроек установить переключатель «Шифрование» в активное положение. Для сохранения настройки нажать кнопку «Ok». Рисунок 24 – Создание настройки Для изменения настройки используется кнопка редактирования настройки, расположенная в блоке групп настроек (Рисунок 22, поз. 3). Автор Ворожев А. В. Страница 46 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» В диалоговом окне (Рисунок 25) можно изменить любое поле настройки, включая родительскую группу. Включение и отключение режима маскирования настройки после её создания недоступно. Для сохранения изменений нажать кнопку «Ok». Рисунок 25 – Редактирование настройки Для удаления настройки используется кнопка удаления настройки, расположенная в блоке групп настроек (Рисунок 22, поз. 4). 3.4.9.2 Страница «Пользователи» 3.4.9.2.1 Ролевая модель В Программе предусмотрены две пользовательские роли: Администратор — привилегированный пользователь:  обладает правом регистрации, отключения и активации учётных записей пользователей Программы;  может просматривать и управлять всеми рабочими станциями, зарегистрированными в Программе;  может просматривать и управлять всеми рабочими станциями, зарегистрированными в Программе;  может просматривать все отчёты, созданные в Программе. Непривилегированный пользователь:  не обладает правом регистрации, отключения и активации учётных записей пользователей Программы;  может просматривать и управлять только теми рабочими станциями, которые входят в те же группы, что и сам пользователь;  может применять только те автоматизации, которые входят в те же группы, что и сам пользователь; Автор Ворожев А. В. Страница 47 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз»  может просматривать только те отчёты, которые созданы для рабочих станций, входящих в те же группы, что и сам пользователь. Пользователь Программы может быть членом нескольких групп. 3.4.9.2.2 Управление учётными записями пользователей Страница «Пользователи» открывается при выборе пункта «Пользователи» в подменю «Система» Главного меню. Пример страницы приведён на рисунке 26. Рисунок 26 – Список пользователей Программы Для добавления учётной записи пользователя необходимо: 1. нажать кнопку «Добавить», расположенную слева в верхней части страницы. 2. В открывшемся диалоговом окне (Рисунок 27) ввести аутентификационные данные пользователя – адрес электронной почты, имя учётной записи и пароль. Внимание! Минимальная длина пароля должна составлять 14 символов. Пароль должен содержать цифры, заглавные и строчные буквы и дополнительные символы. Для исключения возможности запуска на рабочей станции задач, автоматизаций и сеансов С помощью переключателя «Admin» установить роль пользователя. Автор Ворожев А. В. Страница 48 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Нажать кнопку «Сохранить». Будет создана учётная запись нового пользователя. Рисунок 27 – Окно создания учётной записи пользователя Программы Для просмотра и редактирования информации о пользователе и управления его членством в группах: 1. Нажать кнопку «Редактировать» в столбце «Действия» соответствующей учётной записи (Рисунок 26). Откроется окно редактирования учётной записи пользователя (Рисунок 28). Рисунок 28 – Окно редактирования учётной записи пользователя Автор Ворожев А. В. Страница 49 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 2. Администратор может отключить учётную запись пользователя, временно запретив ему вход в Программу (Рисунок 28, поз. 1). 3. Для смены пароля пользователя нажать кнопку «Сменить пароль» (Рисунок 28, поз. 2). В окне смены пароля пользователя ввести и подтвердить новый пароль, соблюдая требования к его сложности, затем нажать кнопку «Сохранить». Рисунок 29 – Окно смены пароля пользователя 4. Для добавления (изменения) информации о пользователе нажать кнопку редактирования (Рисунок 28, поз. 3). Для редактирования станут доступны поля «Имя», «Фамилия», «Организация», «Должность», «Телефон». Для  сохранения внесённых изменений нажать кнопку (Сохранить), для отказа от  изменений – (Закрыть). 3.4.9.2.3 Изменение принадлежности пользователей группам В нижней части окна редактирования учётной записи пользователя расположен блок «Группы», в котором отображено дерево групп (Рисунок 28, поз. 4). Для изменения принадлежности пользователей к группам необходимо отметить флажками только те группы, в которые должен входить пользователь, остальные флажки необходимо снять. Данное изменение применяется немедленно. 3.4.9.3 Страница «Файловый менеджер» Встроенный файловый менеджер предназначен для обмена файлами между ПК пользователя Программы и специальным файловым хранилищем, размещённым на сервере «Атом.Порт». Это могут быть файлы образов системы Linux, предназначенные для развёртывания на АРМ пользователей, пакеты ПО, сертификаты и прочие файлы, используемые при работе сценариев управления конфигурациями. Автор Ворожев А. В. Страница 50 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Страница «Файловый менеджер» открывается при выборе пункта «Файловый менеджер» в подменю «Система» Главного меню. Пример страницы приведён на рисунке 30. Рисунок 30 – Встроенный файловый менеджер Автор Ворожев А. В. Страница 51 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Основную часть страницы занимает список файлов и каталогов (Рисунок 30, поз. 3). На странице файлового менеджера также расположены:  Стандартные кнопки навигации с навигационной цепочкой (Рисунок 30, поз. 1);  Кнопка обновления страницы (Рисунок 30, поз. 2);  Кнопка «Загрузить». При нажатии кнопки выводится стандартное модальное окно выбора файлов (Рисунок 31). Рисунок 31 – Окно выбора файлов При нажатии правой кнопки мыши на имени файла или каталога отображается контекстное меню (Рисунок 30, поз. 4), позволяющее скачать файл (каталог) на ПК пользователя Программы или удалить файл (каталог). Автор Ворожев А. В. Страница 52 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3.5 Изменение принадлежности рабочих станций к группам Внимание! Операция изменения принадлежности рабочих станций к группам доступна пользователю с ролью «Администратор». Включение рабочих станций в определённые группы ограничивает права непривилегированных пользователей на создание задач, автоматизаций, просмотр информации о рабочих станциях. Указанные права предоставляются пользователю только тогда, когда хотя бы одна из групп, в которых состоит пользователь, совпадает хотя бы с одной из групп, в которых состоит рабочая станция. Для изменения принадлежности рабочих станций к группам необходимо: 1. В окне со списком РС, допущенных к миграции, выбрать рабочие станции для выполнения групповой операции и нажать кнопку «Групповые операции» (Рисунок 32, поз. 1): Рисунок 32 – Выбор рабочих станций для изменения групп Автор Ворожев А. В. Страница 53 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 2. В открывшемся контекстном меню выбрать пункт «Изменить группы» (Рисунок 32, поз. 2). 3. В открывшемся окне выбора групп (Рисунок 33) отметить флажками группы, в которые требуется включить рабочую станцию, остальные флажки необходимо снять. Рисунок 33 – Окно выбора групп рабочей станции 4. Нажать кнопку «Задать группы». 3.6 Задачи и шаблоны задач клиента Программы В разделе 3.4.6.3 приведены базовые сведения об инструментарии «Задачи», реализованном в Программе. Создавать задачи клиента Программы и шаблоны задач, сохранять шаблоны задач можно с общей страницы «Задачи» (пункт «Задачи» в подменю «Управление» Главного меню) или со страницы «Задачи» конкретной рабочей станции (пункт «Задачи» подменю доступного для данной рабочей станции клиента – для ОС Windows, ОС Linux или служебного клиента). + Для создания новой задачи нажать кнопку (Рисунок 34, поз. 1). Откроется диалоговое окно создания управления задачами и шаблонами задач (Рисунок 35). Новая задача может быть создана с заполнением всех параметров (Рисунок 35, поз. 2) вручную или с использованием одного из шаблонов задач, сохранённых в Программе. Список доступных шаблонов отображается в левой части диалогового окна (Рисунок 35, поз. 1). При выборе одного из шаблонов в поля параметров задачи подставляются значения по умолчанию, сохранённые в шаблоне (Рисунок 35, поз. 3, 4, 5), а в правой части диалогового окна выводятся описания аргументов метода и другие сведения из документации модуля и метода SaltStack (Рисунок 35, поз. 6). Автор Ворожев А. В. Страница 54 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Завершается создание задачи нажатием кнопки «Создать задачу» (Рисунок 35, поз. 8). Рисунок 34 – Создание новой задачи Рисунок 35 – Диалоговое окно управления задачами и шаблонами задач Автор Ворожев А. В. Страница 55 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Вызов метода SaltStack с набором аргументов по умолчанию может быть сохранён в качестве шаблона для дальнейшего использования в Программе. Для этого после заполнения поля «Метод» и ввода позиционных и именованных аргументов необходимо нажать кнопку «Сохранить как шаблон» (Рисунок 35, поз. 7). В диалоговом окне управления задачами и шаблонами задач вместо блока «Параметры задачи» будет отображён блок «Параметры шаблона» (Рисунок 36, поз. 1). В блоке «Параметры шаблона» необходимо заполнить поля: Имя шаблона — наименование создаваемого шаблона; Описание шаблона — произвольное текстовое описание создаваемого шаблона; Фильтр клиентов — строка нацеливания на миньон; Группа шаблона — добавить создаваемый шаблон в указанную группу шаблонов по функциональному назначению; Рисунок 36 – Создание шаблона задачи Завершается создание шаблона нажатием кнопки «Создать шаблон» (Рисунок 36, поз. 2). Автор Ворожев А. В. Страница 56 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3.7 Автоматизации В отличие от задач клиента Программы, автоматизации представляют из себя сложные алгоритмы, составленные из более простых, «элементарных» операций управления конфигурацией. Операции могут быть как удалёнными действиями, выполняемыми клиентом Программы посредствам вызова функций SaltStack, так и активностями сервера. Отдельные операции одной автоматизации могут выполняться на клиентах Программы для разных ОС (например, при переводе рабочей станции на использование ОС Linux), в то время как задача клиента Программы выполняется только на совместимом клиенте Программы. Программа поставляется с набором сценариев управления конфигурациями, охватывающим множество задач миграции на российские ОС, установки системного и прикладного ПО и администрирования систем на базе ОС Linux. Эти сценарии могут применяться для создания автоматизаций. Перечень сценариев приведён в таблице 14. 3.7.1 Создание автоматизаций Ниже разобран пример выполнения автоматизации, созданной на основе графа windows_migration_using_system_drive, осуществляющей перевод рабочей станции с ОС Windows на использование российской ОС, заданной в качестве параметра при создании автоматизации. В данном сценарии ОС Linux устанавливается на системный диск вместо ОС Windows. 1. В окне со списком рабочих станций, имеющих статус «Принятый», выбрать рабочие станции для выполнения групповой операции и нажать кнопку «Групповые операции» (Рисунок 37, поз. 1). Рисунок 37 – Выбор рабочих станций для создания автоматизаций Автор Ворожев А. В. Страница 57 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» В примере выбрана одна рабочая станция. Если выбирается больше одной рабочей станции, то для каждой из них создаётся собственная автоматизация, выполняемая независимо. 2. В открывшемся контекстном меню выбрать пункт «Создать автоматизацию» (Рисунок 37, поз. 2). 3. В открывшемся окне выбрать требуемый граф windows_migration_using_system_drive (Рисунок 38, поз. 2) и нажать кнопку «Далее» или выбрать вкладку «Настройка параметров» (Рисунок 38, поз. 3). Вернуться на вкладку выбору графа можно нажатием кнопки «Выбор графа» (Рисунок 38, поз. 1). Рисунок 38 – Окно выбора графа 4. На вкладке настройки параметров (Рисунок 39) указать значения параметров запуска автоматизаций:  TTL — максимальное время ожидания корректного завершения автоматизации. По истечении этого времени автоматизация будет считаться выполненной с ошибкой. Обязательный параметр. Допустимые значения: “Один час”, “Один день”, “Одна неделя”, “Один месяц”, «No limit». Автор Ворожев А. В. Страница 58 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз»  Целевая операционная система — ОС, устанавливаемая на системный диск вместо ОС Windows. Обязательный параметр. Допустимые значения: “Astra Linux”, “RED OS”, “ALT Linux”.  Целевое имя компьютера — Сетевое имя узла после установки ОС Linux. Необязательный параметр.  Режим работы виртуального сетевого интерфейса — режим работы сетевого интерфейса виртуальной машины, созданной на базе образа раздела с ОС Windows. Обязательный параметр. Допустимые значения: “Сетевой мост (bridge)”, “NAT”. Рисунок 39 – Установка параметров автоматизаций 5. Нажать кнопку «Создать». Выполнение автоматизации начинается сразу после создания. В примере созданная автоматизация имеет идентификатор ID = 17. Автор Ворожев А. В. Страница 59 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Рисунок 40 – Сводная информация о выполняемой автоматизации Как видно из рисунка 40 (блок Информация об автоматизации  Параметры), автоматизация получила набор именованных Автор Ворожев А. В. Страница 60 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» аргументов, необходимых для выполнения. Этот же набор аргументов будет передаваться дочерним автоматизациям. В блоке «Информация об автоматизации  Описание» отображается общий ход выполнения автоматизации: метки времени запусков дочерних автоматизаций, статусы их выполнения. При выделении любого узла автоматизации в блоке сводной информации отображается блок «Информация об узле». Состав информации в этом блоке зависит от типа узла. В составе рассматриваемой в примере автоматизации есть узлы типа UnitAutoProcess, при выполнении которых создаются дочерние автоматизации. На рисунке 41 представлена отфильтрованная таблица автоматизаций, где значение поля «ID источника» равно 17, т. е. выведены все дочерние автоматизации. Рисунок 41 – Список дочерних автоматизаций Для просмотра состояния выполнения дочерних автоматизаций необходимо перейти по ссылке в поле «ID» соответствующей автоматизации. Перечень и назначение полей таблицы автоматизаций подробно описаны в разделе 3.4.6.2. Автор Ворожев А. В. Страница 61 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3.7.2 Управление выполнением автоматизаций. Статусы автоматизаций На рисунке 42 приведён граф состояний автоматизации. Автоматизация может иметь одну или множество целей (объектов управления конфигурацией) – рабочих станций. Рисунок 42 – Граф состояний автоматизации Автор Ворожев А. В. Страница 62 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» В таблице 11 указаны возможные переходы состояний автоматизации с описанием условий перехода и выполняемых функций. Таблица 11 – Переходы состояний автоматизации № Исходное Конечное Условие и функция перехода дуги состояние состояние 1. С оздана Ожидает Автоматизация поставлена в очередь автоматизаций для выполнения рабочей станции (FIFO, приоритет по времени создания). 2. О жидает Выполняется Автоматизация первая в очереди. Запуск начального узла выполнения графа автоматизации (UnitStart). 3. В ыполняется Выполнена Достигнут конечный узел графа автоматизации (UnitEnd). 4. В ыполняется Ошибка Очередной узел пути графа автоматизации перешёл в состояние «Ошибка». 5. О шибка Выполняется Нажатие пользователем Программы кнопки («Пуск»). 6. В ыполняется Пауза Выполняется дочерняя автоматизация (узел типа UnitAutoProcess). 7. П ауза Выполняется Дочерняя автоматизация завершена успешно (узел типа UnitAutoProcess перешёл в состояние «Выполнен»). Продолжение выполнения автоматизации. 8. В ыполняется Остановлена Нажатие пользователем Программы кнопки («Стоп»). 9. О становлена Выполняется Нажатие пользователем Программы кнопки («Пуск»). Автор Ворожев А. В. Страница 63 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» На рисунке 43 приведён граф состояний узла автоматизации. Рисунок 43 – Граф состояний узла В таблице 12 указаны возможные переходы состояний узла с описанием условий перехода и выполняемых функций. Таблица 12 – Переходы состояний узла № Исходное Конечное Условие и функция перехода дуги состояние состояние 1. Н овый Выполняется Узел после перерасчёта веса кратчайшего пути появляется в пути графа автоматизации. 2. В ыполняется Выполнен Выполнение процесса узла завершилась успешно. Далее производится расчёт веса кратчайшего пути и переход к выполнению следующего узла пути. 3. В ыполняется Ошибка Достигнут лимит неудачных попыток выполнения узла. 4. О шибка Выполняется Нажатие пользователем Программы кнопки («Перезапуск»). Счётчик попыток сбрасывается в 0. 5. О шибка Пропущен Нажатие пользователем Программы кнопки («Пропустить»). Далее производится расчёт веса кратчайшего пути и переход к выполнению следующего узла пути. Узел ситается выполненным и в расчёте веса кратчайшего пути не участвует. Автор Ворожев А. В. Страница 64 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» На рисунке 44 приведён граф состояний процесса, связанного с процессом узла графа автоматизации. Рисунок 44 – Граф состояний процесса узла Программой предпринимаются попытки выполнения узла в соответствии со значением атрибута узла «Максимальное количество попыток» (см. таблицу 7). Каждой попытке соответствует отдельный процесс узла. В таблице 13 указаны возможные переходы состояний процесса узла с описанием условий перехода и выполняемых функций. Таблица 13 – Переходы состояний процесса № Исходное Конечное Условие и функция перехода дуги состояние состояние 1. Новый Выполняется Родительский узел перешёл в состояние «Выполняется», лимит неудачных попыток выполнения узла не достигнут. 2. В ыполняется Выполнен Процесс завершился без ошибок. 3. В ыполняется Ошибка Процесс завершился с ошибкой. 4. О шибка Ошибка / Пропущен Нажатие пользователем Программы кнопки («Перезапуск»). Родительский узел перешёл в состояние «Выполняется». 5. О шибка Выполнен / Пропущен Нажатие пользователем Программы кнопки («Пропустить»). Родительский узел перешёл в состояние «Пропущен». Автор Ворожев А. В. Страница 65 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3.8 Встроенные сценарии управления конфигурациями В таблице 14 приведён перечень графов, входящих в дистрибутив Программы «Атом.Порт: Целевой релиз». Графы распределены по сценариям применения. Автор Ворожев А. В. Страница 66 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» Таблица 14 – Перечень графов дистрибутива Программы «Атом.Порт: Целевой релиз» Группы сценариев Наименование и описание графа Конфигурация Оборудование Принтеры linux_add_printer Подключить принтер 7 6 8 1 компьютера Программное Установка ПО linux_install_packages_from_file Установка пакетов программ из фай- обеспечение лов (RPM, DEB) а ц и н а р т ц и н а р т linux_install_packages_from_repo р епози У т с о т р а и н я о вка пакетов программ из С С Работа с доме- Active Directory Ввод в домен linux_join_domain_active_directory Присоединить клиента ОС ном Linux к домену Active Directory Вывод из домена linux_leave_domain_active_directory Удалить клиента ОС Linux из домена Active Directory FreeIPA Ввод в домен linux_join_domain_freeipa Присоединить клиента ОС Linux к до- я мену FreeIPA л е т Вывод из домена linux_leave_domain_freeipa Удалить клиента ОС Linux из домена а в FreeIPA о з ь л Сеть Сетевые каталоги linux_add_net_share Подключить сетевой каталог о п о Конфигурация Внешний вид Параметры окон | Диспетчер окон user_change_window_manager Настройка параметров окон fly в т пользователя с Хранитель экрана | Блокировка экрана | За- user_change_screensaver Блокировка рабочего стола д о ставка в о к у Оборудование Электропитание | Менеджер питания | user_change_power_manager Управление параметрами электропи- Р Управление питанием тания Оконный мене- Управление сессиями user_change_desktop_session Сессии Fly джер Рабочий стол Значки рабочего стола user_create_desktop_shortcut Создать ярлык на рабочем столе .В .А 3 2 Меню \"Пуск\" | Главное меню user_change_start_menu К \"П о у н с ф к и \" гурация пользователя - Меню в 0 2 е ж о р .9 0 8. П Ф а о н н е р л а ь б б о ы че с г т о р о с г т о о л з а а п | у О ск б а о и | Панель задач u u s s e e r r _ _ c c h h a a n n g g e e _ _ q w u a i l c lp k a _ p la e u r n ch_toolba И r з мен П ен а и не е л о ь б б о ы ев с т р р а о б г о о ч з е а г п о у с с т к о а л а о 1 В Система Автозапуск | Запуск приложений user_add_program_startup Автозапуск приложений в графиче- .д ском интерфейсе системы р з о о т с а Дата и время user_change_datetime Настройка даты и времени в т А а Переменные окружения user_change_environment Переменные окружения Д Приложения для типов файлов | Приложе- user_change_mimeapps_list Приложения для типов файлов technicaldocs.ru ния по умолчанию | Предпочитаемые при- ложения Система управления конфигурациями «Атом.Порт: Целевой релиз» Группы сценариев Наименование и описание графа Переход на оте- Миграция Восстановление пользовательских данных helper_restore_linux Восстановление пользовательских чественное ПО из резервной копии данных ОС Linux из резервной копии ОС Linux 8 1 6 8 Восстановление пользовательских данных helper_restore_user_folders Восстановление пользовательских из резервной копии из helper данных ОС Windows из резервной ко- а ц и н а р т ц и н а р т Восстановление пользовательских данных linux_restore_user_folders п В и о и с с н т а а н О о С в л L е in н u и x е пользовательских С С из резервной копии на linux данных ОС Windows из резервной ко- пии на ОС Linux Резервное копи- Создание резервной ко- helper_backup_user_folders Создание резервной копии пользова- рование пии пользовательских тельских данных ОС Windows данных helper_backup_linux Создание резервной копии пользова- я тельских данных ОС Linux л е т Создание резервной ко- helper_create_image_system_drive Создание резервной копии си- а в о пии системного диска стемного диска ОС Windows з ь л Установка ОС Использовать второй helper_install_linux_second_drive Установка ОС Linux на второй о п о Linux диск (двойная загрузка) диск (двойная загрузка) в т Использовать второй helper_install_linux_second_drive_with_virtual_machine Уста- с д о диск с локальной вирту- новка ОС Linux на второй диск с ло- в о к альной машиной (двой- кальной виртуальной машиной (двой- у Р ная загрузка) ная загрузка) Использовать второй helper_install_linux_second_drive_with_crypto Установка ОС Linux на диск с шифрованием второй диск с шифрованием (двой- (двойная загрузка) ная загрузка) Использовать раздел helper_install_linux_drive_partition Установка ОС Linux на раздел .В .А в 3 2 0 2 д И и с с п к о а л ь (д з в о о в й а н ть а я р а за зд гр е у л з ка) helper_install_linux_rootfs_partitio д n и ска У (д с в т о а й н н о а вк я а з О аг С ру L з i к n а u ) x на раздел е ж о р .9 0 8. диска (обновление rootfs) диска (обновление rootfs) о 1 Использовать системный helper_install_linux_system_drive Установка ОС Linux на В диск (с удалением ОС системный диск .д Windows) р з о о с Использовать системный helper_install_linux_pxe Установка ОС Linux на системный т а в А т а диск (с удалением ОС диск - PXE Д Windows) - PXE technicaldocs.ru Установка служебного клиента windows_install_helper Установка служебного клиента для ОС Windows Система управления конфигурациями «Атом.Порт: Целевой релиз» Группы сценариев Наименование и описание графа Настройка ОС Подключение пользовательских каталогов linux_mount_user_folders_from_partition Подключение пользова- Linux и приклад- из разделов ОС Windows тельских каталогов из раздела ОС ного ПО Windows 9 1 6 8 Работа с обра- Создание локальной вир- linux_create_virtual_machine Cоздание локальной виртуальной зом ОС Windows туальной машины машины а ц и н а р т ц и н а р т З но а г г о р у д з и к с а к о а б и р а с з о а з д с а и н с и т е е м- linux_download_image_and_creat с e и _ с v т i е rt м ua но l_ г m о a д c и h с i к n а e ОС З W аг i р n у d з o к w а s о и б р с а о з - а С С локальной виртуальной здание локальной виртуальной ма- машины шины Копирование пользова- linux_copy_user_folders_from_image Копирование пользовательских тельских каталогов из об- каталогов из образа системного раза диска ОС Windows я Подрезка файловой си- linux_shrink_system_volume_in_image Уменьшение размера л е т стемы в образе файловой системы в образе систем- а в ного диска ОС Windows о з ь Сбор информации о системе, оборудова- linux_collect_information Сбор информации о системе, обору- л о п нии, пользователях довании, пользователях в ОС Linux о в т Установка ПО linux_install_software Установка дополнительного ПО на с д ОС Linux о в о к Откат миграции Вернуть ОС Windows на системный диск helper_restore_windows_from_image Распаковка ОС Windows из ре- у Р зервной копии на системный диск Установка служебного клиента linux_install_helper Установка служебного клиента для ОС Linux Подготовка Изменение разметки диска (двойная за- helper_resize_windows_partition Уменьшение размера раздела Win- грузка) dows и установка метки нового раз- .В .А 3 2 д ш е е л м а с , я с о м з е д с а т н е н . ого на освободив- в 0 2 е ж о р .9 0 8. П W р in о d в o е w рк s а и п з р а а г в р у д з о о с ч т н у о п й а з к а р п е и е с с и т ру ОС windows_check_permissions П W р in о d в o е w рк s а и п з р а а г в р у д з о о с ч т н у о п й а з к а р п е и е с с и т ру ОС о 1 В Проверка системного диска на наличие windows_check_system_drive Проверка системного диска на нали- .д ошибок файловой системы чие ошибок файловой системы р з о о с Сбор информации о системе, оборудова- windows_collect_information Сбор информации о системе, обору- т а в А т а нии, пользователях довании, пользователях в ОС Win- Д dows technicaldocs.ru Система управления конфигурациями «Атом.Порт: Целевой релиз» Группы сценариев Наименование и описание графа Полный цикл Миграция без использования локальной windows_migration_without_virtual_machine Полный цикл миграции виртуальной машины (только перенос без использования локальной вирту- пользовательских данных) альной машины (только перенос 0 1 7 8 пользовательских данных) Миграция с использованием второго диска windows_migration_using_second_drive Полный цикл миграции а ц и н а р т ц и н а р т (двойная загрузка) с (д и в с о п й о н л а ь я з з о а в г а р н у и з е к м а) второго диска С С Миграция с использованием второго диска windows_migration_using_second_drive_with_virtual_machine Полный и созданием локальной виртуальной ма- цикл миграции с использованием шины (двойная загрузка) второго диска и созданием локаль- ной виртуальной машины (двойная загрузка) я Миграция с использованием раздела жёст- windows_migration_using_drive_partition Полный цикл миграции л е кого диска (двойная загрузка) с использованием раздела жёсткого т а диска (двойная загрузка) в о з ь Миграция с использованием системного windows_migration_using_system_drive Полный цикл миграции л о диска с использованием системного диска п о в Полный цикл обновления Linux helper_upgrade_linux Полный цикл обновления корневого т с раздела Linux д о в о Служебные про- Работа с доме- Ввод в домен windows_join_domain_active_directory Присоединить клиента ОС Win- к у Р цессы ном dows к домену Active Directory Установка и настройка контроллера до- windows_setup_active_directory Установка и настройка контроллера мена Active Directory домена Active Directory Установка и настройка контроллера до- linux_setup_freeipa_domain Установка и настройка контроллера мена FreeIPA домена FreeIPA .В .А 3 2 Тестирование Проверка дискового пространства master_check_storage П ст р р о а в н е с р т к в а а с н в а о с б е о р д в н е о р го е , д к и к с о к т о о в р о о го м у п ро- в 0 2 е ж о р .9 0 8. Сообщение в Telegram test_send_telegram п С о о д о к б л щ ю е ч н е и н е а в р а T б e о le ч g а r я a m ст анция о 1 В Тестирование групп test_group_remove Удаление станции из группы .д test_add_group Добавление станции в группу р з о о с т а Тестирование пропускной способности linux_install_iperf_server Установка и настройка сервера iPerf в т А а сети windows_network_performance_measurement Тестирование пропуск- Д ной способности сети (iperf) - Win- technicaldocs.ru dows. Система управления конфигурациями «Атом.Порт: Целевой релиз» Группы сценариев Наименование и описание графа Тестовые автоматизации test_noop_with_params_1 Тестовая автоматизация с парамет- рами 1 1 test_noop_fail Тестовая автоматизация с падением 7 8 test-noop-nested Тестовый вложенный граф а ц и н а р т С ц и н а р т С t t e e s s t t_ _ t n p o l op_double_nested Т 2 Т е е с с т т о о в в ы ы й й г g р ra а p ф h _ ур d о e в s н c е rip м t i в o л n о женности test_noop_nested_with_params Тестовый вложенный граф с пара- метрами test_noop Тестовая автоматизация test_noop_bifurcation Тестовая автоматизация с ветвле- я нием л е т Управление Настройка конфигурации linux_configure_minion Настройка конфигурации клиента ОС а в агентом Linux о з ь л Перезагрузка windows_reboot Перезагрузка клиента ОС Windows о п о reboot_and_wait Перезагрузка рабочей станции с под- в т тверждением загрузки с д о linux_reboot Перезагрузка клиента ОС Linux в о к у helper_reboot Перезагрузка служебного клиента Р Установка графического клиента windows_install_atomport_client Установка графического клиента Атом.Порт Атом.Порт на ОС Windows linux_install_atomport_client Установка графического клиента Атом.Порт на ОС Linux .В .А 3 2 в 0 2 е ж о р .9 0 8. о 1 В .д р з о о с т а в т А а Д technicaldocs.ru Система управления конфигурациями «Атом.Порт: Целевой релиз» Функциональные возможности Программы могут расширяться посредством интеграции сценариев управления конфигурациями (см. «Руководство программиста», «Описание языка» из состава программной документации на Программу). В разделах 3.8.1 – 3.8.3 приведены варианты практических сценариев миграции рабочих станций на российские операционные системы, которые пользователь Программы может реализовать выполнением автоматизаций на основе графов, приведённых в таблице 14. 3.8.1 Сценарий 1. Базовая миграция рабочих станций на отечественные ОС Для обеспечения автоматизированной миграции с операционных систем семейства Windows на отечественные операционные системы разработан базовый сценарий, включающий в себя следующие операции: 1. Проверка готовности РС к миграции. Осуществляется тестирование РС на наличие необходимых для миграции прав доступа и версий клиентского программного обеспечения. Это позволяет минимизировать количество сбоев в процессе миграции. 2. Инициализация РС. Производится не деструктивная подготовка РС к миграции, осуществляется сбор данных, доставляются необходимые утилиты, изменяется схема электропитания. 3. Проверка диска. Средствами ОС производится проверка и исправление файловой системы. Это снижает риск сбоев в процессе создания образа виртуальной машины в дальнейшем. 4. Загрузка временной операционной системы. Осуществляется замена загрузчика операционной системы Windows, доставка временной операционной системы, конфигурирование загрузчика и перезагрузка рабочей станции во вспомогательную ОС. 5. Создание образа виртуальной машины. Создается файл, несущий в себе полную копию содержимого и структуры файловой системы и данных, находящихся на системном диске. Данный файл сохраняется в файловом хранилище. 6. Установка целевой ОС. Производится доставка и запись на системный диск образа отечественной операционной системы. По завершении этапа производится запуск целевой ОС. 7. Создание виртуальной машины с исходной ОС. Производится установка системы виртуализации, на базе ранее сохранённого образа системного диска создается виртуальная машина. 8. Настройка операционной системы и программного обеспечения. Завершающий этап, на котором осуществляется комплекс процессов, необходимых для ввода рабочей станции в эксплуатацию: ввод в домен, Автор Ворожев А. В. Страница 72 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» установка дополнительного ПО, настройка прикладного ПО и информационных систем. 3.8.2 Сценарий 2. Упрощенная миграция рабочих станций на отечественные ОС Сценарий существует для случаев, когда технические характеристики рабочей станции или требования безопасности не позволяют создать виртуальную машину с исходной ОС, либо отсутствует такая потребность. Перечень операций идентичен базовому сценарию, за исключением операции по созданию виртуальной машины: 1. Проверка готовности РС к миграции. Осуществляется тестирование РС на наличие необходимых для миграции прав доступа и версий клиентского программного обеспечения. Это позволяет минимизировать количество сбоев в процессе миграции. 2. Инициализация РС. Производится не деструктивная подготовка РС к миграции, осуществляется сбор данных, доставляются необходимые утилиты, изменяется схема электропитания. 3. Проверка диска. Средствами ОС производится проверка и исправление файловой системы. Это снижает риск сбоев в процессе создания образа виртуальной машины в дальнейшем. 4. Загрузка временной операционной системы. Осуществляется подмена загрузчика операционной системы Windows, доставка временной операционной системы, конфигурирование загрузчика и перезагрузка рабочей станции во вспомогательную ОС. 5. Установка целевой ОС. Производится доставка и запись на системный диск образа отечественной операционной системы. По завершении этапа производится запуск целевой ОС. 6. Настройка операционной системы и программного обеспечения. Завершающий этап, на котором осуществляется комплекс процессов, необходимых для ввода рабочей станции в эксплуатацию: ввод в домен, установка дополнительного ПО, настройка прикладного ПО и информационных систем. 3.8.3 Сценарий 3. Миграция рабочих станций на отечественные ОС с двойной загрузкой Данный сценарий может быть применён в случаях, когда технические характеристики рабочей станции не позволяют запускать виртуальную машину. Операционные системы располагаются на одном системном диске, при включении ПК загружается одна из них по выбору пользователя. Файловая система целевой ОС размещается в виде файла в главном дисковом разделе исходной ОС. Сценарий включает следующие операции: 1. Проверка готовности РС к миграции. Осуществляется тестирование РС на наличие необходимых для миграции прав доступа и версий клиентского Автор Ворожев А. В. Страница 73 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» программного обеспечения. Это позволяет минимизировать количество сбоев в процессе миграции. 2. Инициализация РС. Производится не деструктивная подготовка РС к миграции, осуществляется сбор данных, доставляются необходимые утилиты, изменяется схема электропитания. 3. Проверка диска. Средствами ОС производится проверка и исправление файловой системы. Это снижает риск сбоев в процессе создания образа виртуальной машины в дальнейшем. 4. Установка целевой операционной системы. Осуществляется подмена загрузчика операционной системы Windows, доставка образа целевой операционной системы, конфигурирование загрузчика и перезагрузка рабочей станции в целевую ОС. 5. Настройка операционной системы и программного обеспечения. Завершающий этап, на котором осуществляется комплекс процессов, необходимых для ввода рабочей станции в эксплуатацию: ввод в домен, установка дополнительного ПО, настройка прикладного ПО и информационных систем. Автор Ворожев А. В. Страница 74 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3.9 Инструменты удалённого управления рабочими станциями В Программе реализована подсистема удалённого управления рабочими станциями с ОС Linux. Для запуска сеанса удалённого рабочего стола необходимо, чтобы на рабочей станции был установлен клиент Программы для ОС Linux. На ПК пользователя Программы установка дополнительного ПО не требуется. Запуск сеанса удалённого рабочего стола производится в окне браузера, в котором запущен пользовательский интерфейс Программы. Выбор рабочей станции для удалённого подключения осуществляется из списка доступных с учётом ограничений конкретного пользователя по доступу. Для запуска сеанса удалённого управления необходимо выполнить следующие операции: 1. В главном меню веб-интерфейса перейти на страницу «Рабочие станции». 2. Нажатием ссылку в поле «ID» записи рабочей станции открыть страницу детальной информации о рабочей станции. 3. Выбрать пункт «Удаленный доступ» в подменю «Linux клиент» рабочей станции. Будет открыта страница управления сеансами удалённого доступа к рабочей станции (Рисунок 45, поз. 1). В таблице 15 приведены сведения о полях, доступных для отображения в таблице автоматизаций (поля, отображаемые по умолчанию, указаны жирным шрифтом). Рисунок 45 – Страница управления сеансами удалённого доступа к рабочей станции Таблица 15 – Поля таблицы сеансов удалённого доступа Поле Назначение ID Числовой идентификатор сеанса в установленном экземпляре Программы Статус Статус выполнения сеанса. Может принимать значения: „Новое подключение“, „Подготовка“, „Активация“, „Активный“, „Деактивация“, „Неактивный“, „Ошибка“ Создал Имя учётной записи пользователя, создавшего сеанс Создано Дата и время создания сеанса Активно Время активности сеанса Отключено Дата и время отключения сеанса Описание Описание статуса сеанса Автор Ворожев А. В. Страница 75 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 4. Для создания сеанса удалённого доступа нажать кнопку «Создать подключение» (Рисунок 45). Непосредственно после создания сеанс получает статус «Новое подключение». 5. Далее сеанс получает статус «Подготовка», во время которого на рабочей станции осуществляется конфигурирование и запуск службы удалённого подключения. 6. Если служба удалённого подключения запущена успешно, выполняется попытка соединения с сервером «Атом.Порт», сеанс получает статус «Активация», иначе сеанс получает статус «Ошибка». 7. Если соединение с сервером «Атом.Порт» выполнено успешно, сеанс получает статус «Активный», в столбце «Действия» таблицы сеансов удалённого доступа отображаются кнопки «Подключиться» и «Отключить» (Рисунок 45, поз. 2). 8. При нажатии кнопки «Подключиться» выполняется запрос разрешения пользователя рабочей станции на управление рабочим столом из интерфейса Программы, в случае получения разрешения начинается трансляция рабочего стола в окно интерфейса пользователя Программы (Рисунок 46). Рисунок 46 – Окно сеанса удалённого доступа Автор Ворожев А. В. Страница 76 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 9. Для передачи произвольного текста в окно сеанса используется кнопка «Буфер обмена». При нажатии кнопки выводится диалоговое окно (Рисунок 47). Рисунок 47 – Диалоговое окно буфера обмена 10. При нажатии кнопки «Закрыть» закрывается окно сеанса, но установленное соединение не прекращается, возможно повторное отображение окна сеанса нажатием кнопки «Подключиться» на странице управления сеансами удалённого доступа (Рисунок 45, поз. 2). 11. При нажатии кнопки «Отключить» на странице управления сеансами удалённого доступа выполняется остановка службы удалённого подключения на рабочей станции, подключение становится более недоступным. Статус сеанса меняется на «Деактивация», затем на «Неактивный». 12. При нажатии кнопки «Записи» открывается окно загрузки записи сеанса удалённого доступа (Рисунок 48). Рисунок 48 – Окно загрузки записи сеанса удалённого доступа Автор Ворожев А. В. Страница 77 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3.10 Создание отчётов В стандартный дистрибутив Программы «Атом.Порт: Целевой релиз» входит ряд стандартных отчётов: Наименование шаблона отчёта Форма т Базовый отчёт об АРМ PDF Отчёт об аппаратуре и ОС всех рабочих PDF станций Отчёт со статистикой по АРМ PDF Сводная таблица по АРМ XLS Таблица программного обеспечения XLS Табличный отчёт об инвентаризации XLS Для создания отчёта необходимо выполнить следующие операции: 1. В главном меню веб-интерфейса перейти на страницу «Рабочие станции». 2. Отметить флажками рабочие станции, для которых необходимо создать отчёт. Рисунок 49 – Выбор РС для групповой операции Автор Ворожев А. В. Страница 78 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3. Нажать кнопку «Групповые операции» (Рисунок 49, поз. 1). В открывшемся окне выбрать пункт «Создать отчёт» (Рисунок 49, поз. 2). 4. Откроется диалоговое выбора шаблона отчёта (Рисунок 50). Рисунок 50 – Диалоговое окно выбора шаблона отчёта 5. Выбрать шаблон отчёта из списка доступных нажать кнопку «Создать». 6. Перейти на страницу «Отчеты» (пункт «Отчеты» в подменю «Справочники» Главного меню) или на страницу «Отчеты» конкретной рабочей станции (пункт «Задачи» подменю доступного для данной рабочей станции клиента – для ОС Windows, ОС Linux или служебного клиента). В таблице 16 приведены сведения о полях, доступных для отображения в таблице автоматизаций (поля, отображаемые по умолчанию, указаны жирным шрифтом). Таблица 16 – Поля таблицы отчётов Поле Назначение ID Числовой идентификатор отчёта в установленном экземпляре Программы Создан Дата и время создания отчёта Выполнен Дата и время выполнения отчёта Шаблон Внутрисистемное имя шаблона отчёта Статус Статус выполнения («Успешно» или «Ошибка») Рабочие станции Список идентификаторов рабочих станций, для которых создан отчёт 7. Если отчёт создан успешно, в столбце «Скачать» записи отчёта будет доступна кнопка загрузки (Рисунок 51). Рисунок 51 – Загрузка сформированного отчёта Автор Ворожев А. В. Страница 79 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» ПЕРЕЧЕНЬ ТЕРМИНОВ Автоматизация Задание на изменение конфигурации РС, в ходе выполнения которого модуль управления конфигурацией транслирует агенту администрирования последовательность команд, обеспечивающую достижение требуемой конфигурации РС. Агент Клиентское приложение Программы для ОС Linux или ОС администрирования Windows, установленное на РС, передающее на сервер сведения об аппаратном обеспечении и актуальной конфигурации РС, принимающее и исполняющее команды модуля управления конфигурацией. Граф автоматизации Граф-схема алгоритма изменения конфигурации РС. Пользователь Технический сотрудник, управляющий рабочими Программы станциями через пользовательский интерфейс Программы Программа для ЭВМ «Система управления Программа конфигурациями «Атом.Порт: Целевой релиз» Сервер «Атом.Порт» ЭВМ, на которой установлено Ядро Программы Автор Ворожев А. В. Страница 80 Руководство пользователя Дата созд. 18.09.2023 Страниц 81 Система управления конфигурациями «Атом.Порт: Целевой релиз» ПЕРЕЧЕНЬ СОКРАЩЕНИЙ И УСЛОВНЫХ ОБОЗНАЧЕНИЙ АРМ Автоматизированное рабочее место МФУ Многофункциональное устройство ОЗУ Оперативное запоминающее устройство ОС Операционная система ПК Персональный компьютер ПО Программное обеспечение РС Рабочая станция ЦП Центральный процессор ЭВМ Электронная вычислительная машина HDD Накопитель на жёстких магнитных дисках Автор Ворожев А. В. Страница 81 Руководство пользователя Дата созд. 18.09.2023 Страниц 81"
  },
  {
    "title": "Атом.Порт_Руководство системного администратора",
    "url": null,
    "text": "ПРОГРАММА ДЛЯ ЭВМ «СИСТЕМА УПРАВЛЕНИЯ КОНФИГУРАЦИЯМИ «АТОМ.ПОРТ: ЦЕЛЕВОЙ РЕЛИЗ» Руководство системного администратора Листов: 29 Дата: 18.09.2023 Версия: 1.0 Система управления конфигурациями «Атом.Порт: Целевой релиз» АННОТАЦИЯ В настоящем документе приведено руководство системного администратора по установке и настройке программы для ЭВМ Система управления конфигурациями «Атом.Порт: Целевой релиз» (далее – Программа). В разделе «Общие сведения о программе» указаны назначение и функции Программы, сведения о технических и программных средствах, обеспечивающих выполнение Программы. В разделе «Структура программы» приведены сведения о структуре программы, ее составных компонентах и модулях. В разделе «Настройка программы» приведено описание действий по настройке Программы на условиях конкретного применения. В разделе «Проверка программы» приведено описание способов проверки, позволяющих дать общее заключение о работоспособности Программы. Структура и оформление настоящего документа соответствует ГОСТ 19.503-79. Примечание. В связи с постоянным развитием Программы элементы интерфейса и значения ее фактических параметров могут отличаться от документированных. Автор Ворожев А. В. Страница 2 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» СОДЕРЖАНИЕ 1 Общие сведения о программе ...................................................................................... 4 1.1 Назначение программы .......................................................................................... 4 1.2 Условия применения ............................................................................................... 5 1.2.1 Описание типовой инфраструктуры миграции .............................................. 5 1.2.2 Требования к серверу Программы «Атом.Порт» ........................................... 6 1.2.3 Требования к рабочим станциям ..................................................................... 7 1.2.4 Требования к сетевой инфраструктуре ........................................................... 7 1.2.4.1 Общие требования ..................................................................................... 7 1.2.4.2 Настройка сервера DHCP .......................................................................... 8 1.2.4.3 Настройка антивирусных систем и систем предотвращения вторжений .................................................................................................................... 9 1.2.4.3.1 Пример настройки исключений антивирусных продуктов Dr.WEB ......................... 9 1.2.4.3.2 Пример настройки исключений антивирусных продуктов Касперского ................ 11 2 Структура программы .................................................................................................. 13 3 Настройка программы .................................................................................................. 15 3.1 Установка серверных компонентов Программы................................................ 15 3.1.1 Установка сервера на виртуальную машину................................................ 15 3.2 Установка клиентских компонентов Программы ............................................... 17 3.2.1 Установка клиента с помощью пакетного файла......................................... 17 3.2.2 Установка клиента в интерактивном режиме ............................................... 18 3.2.3 Установка клиента с помощью групповых политик Microsoft AD ............... 21 4 Проверка программы ................................................................................................... 26 4.1 Мониторинг работы серверных компонентов Программы ............................... 26 4.1.1 Системные процессы ...................................................................................... 26 4.1.2 Проверка работоспособности Программы при помощи файлов журналов 27 4.2 Мониторинг работы клиента Программы ........................................................... 28 4.2.1 Мониторинг работы клиента в ОС Windows ................................................. 28 4.2.2 Мониторинг работы клиента в ОС Linux ....................................................... 29 4.2.3 Проверка работоспособности АРМ Администратора Программы ............ 29 Автор Ворожев А. В. Страница 3 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 1 Общие сведения о программе 1.1 Назначение программы Программа для ЭВМ «Система управления конфигурациями «Атом.Порт» (далее — Программа) — это программный комплекс, предназначенный для централизован- ного управления программными конфигурациями рабочих станций на базе операци- онных систем семейств GNU/Linux и Microsoft Windows. Программа предназначена для управления инфраструктурой рабочих мест госу- дарственных и коммерческих средних предприятий. Программа предназначена для осуществления следующих видов деятельности по автоматизации: 1. Инвентаризация автоматизированных рабочих мест (далее – АРМ) пользова- телей, включающая сбор, хранение и обработка данных о рабочих станциях (далее – РС); 2. Мониторинг состояния рабочих станций; 3. Конфигурирование рабочих станций и групп рабочих станций, в том числе миграция рабочих станций пользователей на отечественное ПО; 4. Управление конфигурациями гибридной инфраструктуры рабочих станций. Программа позволяет осуществлять следующие операции: 1. Получать актуальную и подробную информацию о действующем парке вычис- лительной техники предприятия. 2. Осуществлять автоматизированный процесс миграции рабочих станций поль- зователей на отечественное ПО: 2.1. миграция с созданием виртуальной машины; 2.2. миграция без создания виртуальной машины; 2.3. миграция с двойной загрузкой. 3. Управлять гибридной инфраструктурой по окончании процесса миграции: 3.1. устанавливать ПО, 3.2. добавлять сертификаты, 3.3. управлять локальными пользователями, 3.4. подключать печатно-копировальное оборудование. Автор Ворожев А. В. Страница 4 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 1.2 Условия применения 1.2.1 Описание типовой инфраструктуры миграции На рисунке 1 представлена схема типовой инфраструктуры миграции для локальной вычислительной сети предприятия с доступом в Интернет, имеющей в своём составе доверенные пользовательские сети и недоверенные сегменты (беспроводную сеть Wi-Fi и пр.). На схеме указаны номера портов TCP и UDP, используемых сетевыми службами компонентов Программы. Рисунок 1 – Схема типовой инфраструктуры миграции Автор Ворожев А. В. Страница 5 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 1.2.2 Требования к серверу Программы «Атом.Порт» Требования к аппаратному обеспечению сервера Программы «Атом.Порт» приведены в таблице 1. Таблица 1 – Требования к аппаратному обеспечению сервера Минимальное Рекомендуемое № Параметр значение значение 1. Арх итектура процессора x86_64 x86_64 2. Так товая частота процессора, ГГц 1.8 не менее 2 3. Кол ичество ядер процессора, шт. 4 8 4. Объ ем оперативной памяти, ГБ 8 16 5. Дос тупное свободное место на накопителе на жестких 50 200 магнитных дисках или твердотельном накопителе, Гбайт 6. Про пускная способность сетевого интерфейса, Мбит/с 100 1000 Для хранения резервных копий пользовательских данных и образов дисков с ОС Windows необходимо наличие дополнительного раздела достаточной ёмкости на локальном диске сервера или в автономном хранилище с доступом по протоколу SSH. Для сетевого интерфейса сервера должен быть выделен один IP-адрес в локальной сети. Для установки программного обеспечения на сервер используются образы: 1. Образ ПО Сlonezilla – свободного программного обеспечения для клонирования дисков, с помощью которого выполняется развёртывание серверных компонентов ПО Программы. Образ размещён по ссылке: https://clonezilla.org/downloads/download.php?branch=stable Для скачивания необходимо выбрать формат iso. 2. Образ диска с Программой (формат iso). Образ размещён по ссылке: https://cloud.charon.su/s/dLDMf2BcYKooogi Порядок установки серверных компонентов ПО Программы описан в разделе 3.1 настоящей инструкции. Автор Ворожев А. В. Страница 6 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 1.2.3 Требования к рабочим станциям Требования к аппаратному обеспечению рабочих станций приведены в таблице 2. Таблица 2 – Требования к аппаратному обеспечению рабочих станций Без создания С созданием виртуальной машины виртуальной машины № Параметр Минималь- Рекомендуе- Минималь- Рекомендуе- ное значение мое значение ное значение мое значение 1. Арх итектура процессора x86_64 x86_64 x86_64 x86_64 2. Так товая частота процессора, 1.2 1.2 1.8 2 ГГц 3. Кол ичество ядер процессора, шт. 2 2 4 4 4. Объ ем оперативной памяти, ГБ 2 4 8 8 5. Дос тупное свободное место на 20 50 100 200 накопителе на жестких магнитных дисках или твердотельном накопителе, Гбайт 6. Опе рационная система Windows 7 / 8 Windows 7 / 8 / Windows 7 / 8 Windows 7 / 8 / 8.1 / 10 8.1 / 10 / 8.1 / 10 / 8.1 / 10 В BIOS рабочих станций должен быть отключён режим загрузки Secure Boot. В BIOS рабочих станций должна быть включена виртуализация (Virtualization, VT-x, AMD-V, SVM, Vanderpool, Intel VT-d, AMD IOMMU). На рабочих станциях не должно быть шифрованных, сжатых и динамических томов. Порядок установки Программы на рабочие станции и порядок настройки антивирусного ПО описаны в разделе 3.2 настоящей инструкции. 1.2.4 Требования к сетевой инфраструктуре 1.2.4.1 Общие требования Для ввода рабочей станции в домен после перевода на использование отечественной ОС необходимо наличие сетевой доступности контроллеров домена. Должно отсутствовать клиентское оборудование, подключённое к рабочей станции в режиме моста (например, IP-телефоны). Сетевые коммутаторы должны позволять использование нескольких клиентских MAC-адресов на одном физическом интерфейсе. Автор Ворожев А. В. Страница 7 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» Для обеспечения работоспособности функции отслеживания онлайн-статуса рабочей станции при организации сетевого взаимодействия между сервером и рабочей станцией не должно применяться преобразование сетевых адресов (NAT). Для выполнения работ по миграции и обслуживанию к серверу управления миграцией должен быть организован внешний доступ при помощи технологии VPN. Доступ может быть организован средствами сервера управления миграцией в случае согласования соответствующих разрешающих правил сетевого доступа. Ключевое влияние на скорость процессов миграции оказывает скорость обмена данными между рабочей станцией, с одной стороны, и сервером управления миграцией и файловым хранилищем – с другой стороны. Основными факторами, определяющими скорость обмена, являются:  пропускная способность дисковых подсистем рабочих станций, сервера управления миграцией и хранилища;  пропускная способность сегментов сети между рабочей станцией и сервером управления миграцией, рабочей станцией и файловым хранилищем, включая сетевые интерфейсы сервера, хранилища и рабочей станции, а также всё коммутационное оборудование, образующее соответствующий сегмент сети. В качестве правила расчёта необходимой пропускной способности следует принять, что 100 Мбит/c пропускной способности необходимо на каждые три рабочие станции, одновременно участвующие в процессах миграции. 1.2.4.2 Настройка сервера DHCP Для рабочих станций, получающих сетевые параметры по протоколу DHCP, необходимо выполнение следующих условий:  рабочие станции, переводимые на отечественную ОС, должны быть объединены в один широковещательный домен для обеспечения корректного функционирования сервисов, предоставляемых сервером управления миграцией;  в случае распределения рабочих станций, переводимых на отечественную ОС, и сервера управления миграцией по разным широковещательным доменам, на коммутационном оборудовании Заказчика должна быть настроена пересылка широковещательных UDP-пакетов, в том числе, пересылка DHCP-запросов (Relay Option 82 по стандарту RFC 3046);  пул IP-адресов сервера DHCP должен быть достаточным для выдачи всем рабочим станциям и создаваемым виртуальным машинам. Автор Ворожев А. В. Страница 8 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 1.2.4.3 Настройка антивирусных систем и систем предотвращения вторжений Имена и полные пути файлов, номера портов TCP и UDP, используемых компонентами Программы, должны быть добавлены в списки исключений систем защиты информации от несанкционированного доступа и антивирусных систем, используемых на рабочих станциях. 1.2.4.3.1 Пример настройки исключений антивирусных продуктов Dr.WEB 1. Открыть «Dr.WEB →Центр безопасности → Превентивная защита →Поведенческий анализ», перейти на вкладку «Доступ приложений». Добавить новое правило: указать приложение „C:\\Program Files\\Salt Project\\Salt\\bin\\python.exe “, отметить флажок «Разрешить» для объекта «Файл HOSTS», нажать «ОК» (Рисунок 2). Рисунок 2 – Добавление правила для приложения python.exe Автор Ворожев А. В. Страница 9 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 2. Добавить новое правило: указать приложение „C:\\salt\\opt\\grub2\\grub- install.exe“, отметить флажок «Разрешать» для объекта «Низкоуровневый доступ к диску», нажать «ОК» (Рисунок 3). Рисунок 3 – Добавление правила для приложения grub-install.exe 3. В окне правил поведенческого анализа отображаются добавленные правила (Рисунок 4). Рисунок 4 – Правила доступа приложений Автор Ворожев А. В. Страница 10 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 1.2.4.3.2 Пример настройки исключений антивирусных продуктов Касперского 1. Открыть «Kaspersky →Настройка → Угрозы и исключения → Настроить исключения». Добавить новое правило: в поле «Файл или папка» указать „C:\\Program Files\\Salt Project\\Salt\\bin\\python.exe “, отметить в компонентах защиты «Предотвращение вторжений», статус «Активно», нажать «ОК» (Рисунок 5). Рисунок 5 – Добавление исключения для приложения python.exe Автор Ворожев А. В. Страница 11 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 2. Добавить новое правило: в поле «Файл или папка» указать „C:\\salt\\opt\\grub2\\grub-install.exe“, отметить в компонентах защиты «Предотвращение вторжений», статус «Активно», нажать «ОК» (Рисунок 6). Рисунок 6 – Добавление исключения для приложения grub-install.exe 3. В окне исключений отображаются добавленные исключения (Рисунок 7). Рисунок 7 – Добавленные исключения Автор Ворожев А. В. Страница 12 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 2 Структура программы Структура Программы и схема взаимодействия компонентов представлены на рисунке 8. Рисунок 8 – Структура Программы Автор Ворожев А. В. Страница 13 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» Службы и их функции, подготавливаемые в ходе установки ПО перечислены в таблице 3. Таблица 3 – Службы и их назначение Имя службы Назначение Примечание celery Распределённая Обеспечивает запуск заданий син- асинхронная оче- хронно и асинхронно, по расписанию, редь задач вложенные задания и т.д. runner.py Запуск команд Salt- Stack sniffer.py Отслеживание событий SaltStack nginx Веб-сервер Публикует пользовательский интер- фейс, обеспечивает взаимодействие с командной строкой администра- тора миньона на рабочей станции. uvicorn Асинхронный сер- вер приложений redis Сервер Redis Резидентная система управления ба- зами данных класса NoSQL с откры- тым исходным кодом, работающая со структурами данных типа «ключ — значение». Используется для реали- зации брокера сообщений модуля Celery salt-master Сервер SaltStack Система управления конфигурацией, включающая серверный компонент salt-master и клиенты salt-minion postgresql СУБД PostgreSQL Автор Ворожев А. В. Страница 14 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3 Настройка программы 3.1 Установка серверных компонентов Программы 3.1.1 Установка сервера на виртуальную машину 1. Подключить образ ПО Clonezilla к виртуальной машине. 2. Подключить образ диска сервера Программы к виртуальной машине для обеспечения доступа к нему из ПО Clonezilla. 3. Выполнить загрузку виртуальной машины с использованием образа ПО Clonezilla. 4. Выбрать язык — русский. 5. Оставить раскладку по умолчанию — US. 6. В диалоговом окне выбрать пункт: Enter_shell — Войти в командную строку 7. В командной строке ввести команду: $ sudo blkid -L ATOMPORT Рисунок 9 – Монтирование диска с данными Автор Ворожев А. В. Страница 15 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 8. В выводе команды будет указано устройство, на котором находится образ Программы. В данном примере это /dev/sr1. Далее ввести команду подключения устройства: $ sudo mount /dev/sr1 /home/partimag/ (см. Рисунок 9). 9. Ввести команду: $ exit 10. Выбрать пункт: Start_Clonezilla — Запуск Clonezilla 11. Выбрать пункт: device-image — работать с дисками или разделами, используя образы 12. Выбрать пункт: skip — использовать существующий /home/partimag... 13. Нажать“Enter” для продолжения… 14. Выбрать пункт: Expert — экспертный уровень… 15. Выбрать пункт: restore_disk — Восстановить_образ_на_локальный_диск 16. Выбрать образ диска сервера atomport Рисунок 10 – Выбор образа для установки Автор Ворожев А. В. Страница 16 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 17. Выбрать целевой диск — диск, на который будут установлены серверные компоненты Программы. 18. На 1-м экране («Установка дополнительных параметров»), ничего не меняя, нажать “<OK>”. 19. На 2-м экране («Установка дополнительных параметров») выбрать пункт: -k1 Создать таблицу разделов пропорционально 20. Выбрать пункт: -scr Нет, пропустить проверку до восстановления 21. Выбрать пункт: -p choose… 22. Нажать “Enter” для продолжения. 23. На запрос внести изменения и продолжить ввести “Y” и нажать “Enter”. 24. Ждать завершения процесса. 25. Нажать “Enter” для продолжения. 26. Выбрать пункт: reboot — Перезагрузка 27. После загрузки Программы необходимо указать актуальные значения IP-адресов сервера, шлюза по умолчанию и сервера DNS в файлах: /etc/network/interfaces, /etc/resolv.conf согласно инструкции: https://wiki.astralinux.ru/pages/viewpage.action?pageId=3277370#id- НастройкасетевыхподключенийвAstraLinux-Сетевыеинтерфейсывстатичныхсетях 3.2 Установка клиентских компонентов Программы 3.2.1 Установка клиента с помощью пакетного файла 1. Для установки клиентских компонентов Программы в «тихом» режиме запустить файл install.bat, который запустит инсталлятор клиента, соответствующий разрядности ОС. На запрос „Enter Salt master address (default: salt):“ ввести выделенный IP-адрес сервера. Рисунок 11 – Запуск инсталлятора клиента Программы Автор Ворожев А. В. Страница 17 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3.2.2 Установка клиента в интерактивном режиме 2. Для установки клиента Программы в интерактивном режиме запустить exe-файл инсталлятора, соответствующий разрядности ОС, без указания параметров запуска. 3. Нажать “Next >” в стартовом окне инсталлятора (Рисунок 12) Рисунок 12 – Стартовое окно инсталлятора службы salt-minion Автор Ворожев А. В. Страница 18 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 4. Нажать “I Agree” в окне лицензионного соглашения (Рисунок 13). Рисунок 13 – Окно лицензионного соглашения 5. Указать путь к папке инсталляции клиента (Рисунок 14). Рисунок 14 – Окно установки папки назначения Автор Ворожев А. В. Страница 19 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 6. В окне установки параметров службы salt-minion в первом поле указать выделенный IP-адрес сервера, значения Minion Name: hostname и Default config оставить без изменения (Рисунок 15). Нажать “Install” и дождаться окончания процесса установки клиента. Рисунок 15 – Окно установки параметров службы salt-minion 7. Нажать “Finish” в окне завершения установки службы salt-minion (Рисунок 16). Рисунок 16 – Окно завершения установки службы salt-minion Автор Ворожев А. В. Страница 20 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3.2.3 Установка клиента с помощью групповых политик Microsoft AD 1. В меню «Пуск» выбрать пункт «Администрирование / Управление групповой политикой» либо выбрать пункт «Выполнить» (Рисунок 17). Рисунок 17 – Запуск оснастки управления групповой политикой 2. В дереве объектов домена кликнуть правой кнопкой мыши на узле «Объекты групповой политики», выбрать пункт «Создать» (Рисунок 18). Рисунок 18 – Создание объекта групповой политики Автор Ворожев А. В. Страница 21 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 3. В диалоговом окне ввести наименование нового объекта групповой политики и нажать «ОК». В данном примере объект групповой политики называется «Установка клиента Атом.Порт» (Рисунок 19). Рисунок 19 – Ввод наименования нового объекта групповой политики 4. В дереве объектов домена кликнуть правой кнопкой мыши на нужном Organizational Unit (в данном примере – «Тестовое подразделение»), выбрать пункт «Связать существующий объект групповой политики» (Рисунок 20). Рисунок 20 – Создание связи Organizational Unit с объектом групповой политики Автор Ворожев А. В. Страница 22 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 5. В окне выбора объекта групповой политики выбрать объект «Установка клиента Атом.Порт». Рисунок 21 – Выбор объекта групповой политики для связи с Organizational Unit 6. В списке объектов групповой политики домена кликнуть правой кнопкой мыши на объекте «Установка клиента Атом.Порт», выбрать пункт «изменить» (Рисунок 22). Рисунок 22 – Изменение объекта групповой политики Автор Ворожев А. В. Страница 23 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 7. В открывшемся окне редактора управления групповыми политиками в узле «Конфигурация компьютера», «Конфигурация Windows» выбрать пункт «Сценарии» (Рисунок 23). 8. В окне со списком сценариев кликнуть правой кнопкой мыши на сценарии «Автозагрузка», выбрать пункт «Свойства» (Рисунок 23). Рисунок 23 – Изменение свойств сценария автозагрузки 9. В открывшемся окне свойств сценария автозагрузки на вкладке «Сценарии» нажать кнопку «Показать файлы» (Рисунок 24). Рисунок 24 – Свойства сценария автозагрузки Автор Ворожев А. В. Страница 24 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 10. В папку сценария автозагрузки, открывшуюся в проводнике Windows, скопировать файл install.bat и exe-файлы инсталляторов для ОС Windows 32- и 64-разрядной архитектуры (Рисунок 25). Рисунок 25 – Копирование файлов в папку сценария автозагрузки 11. Закрыть проводник и нажать кнопку «Добавить» на вкладке «Сценарии» окна свойств сценария автозагрузки (Рисунок 24). 12. Ввести имя install.bat и значение параметра – выделенный IP-адрес сервера и нажать «ОК» (Рисунок 26). Рисунок 26 – Ввод параметров сценария автозагрузки Автор Ворожев А. В. Страница 25 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 4 Проверка программы 4.1 Мониторинг работы серверных компонентов Программы 4.1.1 Системные процессы Ядро Программы функционирует в виде множества процессов, осуществляющих получение, обработку и хранение данных от АРМ и пользователей Программы, управление конфигурациями АРМ и взаимодействие между функциональными модулями Программы. Проверить состояние процессов ядра Программы можно с помощью команды: # systemctl list-units –all \\ charon-*.service \\ postgresql.service \\ nginx.service \\ salt-*.service \\ redis-server.service Пример вывода: UNIT LOAD ACTIVE SUB DESCRIPTION charon-celery-beat.service loaded active running Charon system Celery beat scheduler charon-celery-flower.service loaded active running Flower Celery Service charon-celery-worker@default.service loaded active running Charon system Celery default worker charon-celery-worker@process.service loaded active running Charon system Celery process worker charon-process-rule-runner.service loaded active running Charon system process rule runner charon-process-runner.service loaded active running Charon system process runner charon-remote-access-watcher.service loaded active running Charon system VNC watcher charon-sniffer.service loaded active running Charon system bus sniffer charon-uvicorn.service loaded active running Charon async backend nginx.service loaded active running A high performance web server and a reverse proxy server postgresql.service loaded active exited PostgreSQL RDBMS redis-server.service loaded active running Advanced key-value store salt-master.service loaded active running The Salt Master Server salt-minion.service loaded active running The Salt Minion LOAD = Reflects whether the unit definition was properly loaded. ACTIVE = The high-level unit activation state, i.e. generalization of SUB. SUB = The low-level unit activation state, values depend on unit type. 14 loaded units listed. To show all installed unit files use 'systemctl list-unit-files'. Проверить доступность клиентов Программы можно с помощью команды: salt '*' test.ping. В выводе команды должны отображаться результаты вида: <id клиента>: True для всех подключённых клиентов. Автор Ворожев А. В. Страница 26 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 4.1.2 Проверка работоспособности Программы при помощи файлов журналов В таблице 4 представлен перечень процессов и исполняемых файлов серверных компонентов Программы с указанием формируемых ими файлов журналов. Таблица 4 – Серверные компоненты Программы № Имя службы Назначение Файлы журналов 1 charon-celery-beat Сервер асинхронной оче- /var/log/syslog charon-celery-flower реди задач # journalctl -u charon-celery*.service charon-celery-worker 2 charon-process-rule-runner Запуск команд SaltStack /var/log/syslog charon-process-runner # journalctl -u charon-process*.service /var/log/charon/charon_runner.log /var/log/charon/charon_rule_runner.log 3 charon-remote-access- # journalctl -u charon-remote-access- watcher watcher.service /var/log/charon/remote_ac- cess_watcher.log 4 iperf3 /var/log/iperf3.log 5 nginx Веб-сервер /var/log/nginx/access.log /var/log/nginx/error.log 6 postgres Сервер СУБД PostgreSQL /var/log/postgresql/postgresql-14- atomport.log 7 pypiserver /var/log/pypiserver.log 8 redis-server /var/log/redis/redis-server.log 9 salt-master Сервер системы управле- /var/log/salt/master ния конфигурацией Salt- Stack 10 sa lt-minion /var/log/salt/minion 11 sn iffer Прослушивание событий /var/log/syslog SaltStack # journalctl -u charon-sniffer.service /var/log/charon/charon_sniffer.log 12 uv icorn ASGI-сервер /var/log/syslog # journalctl -u charon-uvicorn.service 13 ch aron Создание учётных записей /var/log/charon/charon_core.log пользователей, загрузка описаний автопроцессов 14 py thon3 Интерпретатор CPython Стандартный каталог для запуска Python-про- грамм Автор Ворожев А. В. Страница 27 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» В файлах журналов не должно быть сообщений о повторяющихся приоритетных ошибках (уровень «ERROR» и выше). 4.2 Мониторинг работы клиента Программы 4.2.1 Мониторинг работы клиента в ОС Windows Для выявления проблем в работе клиентских компонентов Программы в ОС Linux необходимо:  убедиться, что клиент Программы установлен – в списке установленных программ должна присутствовать запись salt minion;  убедиться, что клиент Программы запущен – при выполнении в командной строке команды sc query salt-minion должно отобразиться состояние «RUNNING». Пример вывода: Имя_службы: salt-minion Тип : 10 WIN32_OWN_PROCESS Состояние : 4 RUNNING (STOPPABLE, NOT_PAUSABLE, ACCEPTS_SHUTDOWN) Код_выхода_Win32 : 0 (0x0) Код_выхода_службы : 0 (0x0) Контрольная_точка : 0x0 Ожидание : 0x0  убедиться, что есть связь с сервером:  При выполнении команды ping <IP-адрес сервера Атом.Порт> должно выводиться сообщение об отсутствии потерь пакетов (0% потерь)  При выполнении команды salt-call test.ping должен выдаваться ответ: local: True  В выводе команды netstat -an | findstr 450 должна присутствовать строка: <IP-адрес сервера Атом.Порт>:4505 ESTABLESHED либо <IP-адрес сервера Атом.Порт>:4506 ESTABLESHED  убедиться, что архитектура системы и клиента совпадают, для этого запустить: C:\\Program Files\\Salt Project\\Salt\\bin\\python.exe. На экране в 64-разрядных системах должна появиться строка, содержащая текст: 64 bit (AMD64). Автор Ворожев А. В. Страница 28 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29 Система управления конфигурациями «Атом.Порт: Целевой релиз» 4.2.2 Мониторинг работы клиента в ОС Linux В таблице 5 представлен перечень процессов и утилит, выполняемых на АРМ, с указанием формируемых ими файлов журналов. Таблица 5 – Процессы, выполняемые на АРМ Имя процесса № Назначение Файлы журналов (исполняемого файла) 1 salt-minion Служба клиента SaltStack /var/log/salt/minion В файлах журналов не должно быть сообщений о повторяющихся приоритетных ошибках (уровень «ERROR» и выше). 4.2.3 Проверка работоспособности АРМ Администратора Программы Для проверки работоспособности АРМ администратора Программы необходимо:  Очистить локальное хранилище браузера и открыть в браузере веб- интерфейс Программы. Должна открыться страница входа в Программу.  На первый запрос сервер должен вернуть код «200».  Сообщения, свидетельствующие о проблемах в работе Программы, можно увидеть в консоли отладки JavaScript (в «инструментах разработчика» браузера). Автор Ворожев А. В. Страница 29 Руководство системного администратора Дата созд. 18.09.2023 Страниц 29"
  },
  {
    "title": "Описание применения",
    "url": null,
    "text": "УТВЕРЖДЕН ЧОГА.300317.31-01-ЛУ СИСТЕМА УПРАВЛЕНИЯ КОНФИГУРАЦИЯМИ АТОМ.ПОРТ Описание применения ЧОГА.300317.31-01 а т а д Листов 19 и ь с и п д о П .л б у д № .в н И № .в н и .м а з В а т а д и ь с и п д о П .л д 2021 о п № .в н И technicaldocs.ru 2 ЧОГА.300317.31-01 АННОТАЦИЯ В настоящем документе содержится описание применения программы для ЭВМ «Система управления конфигурациями “Атом.Порт”» (далее – Система). В документе представлена информация о назначении Системы, областях и условиях ее применения, а также о составе и функциях программных компонентов Системы. Описаны условия применения Системы, в том числе требования к программным и техническим средствам и устойчивости функционирования. В разделе «Назначение программы» приведено описание назначения программы, возможности данной программы, а также ее основные характеристики и ограничения, накладываемые на область применения программы. В разделе «Условия применения» определены условия, необходимые для выполнения программы (требования к необходимым для данной программы техническим средствам, и другим программам, а также требования организационного, технического и технологического характера). В разделе «Описание задачи» обозначены задачи и методы ее решения. В разделе «Входные и выходные данные» указаны общие характеристики входной и выходной информации. Структура и оформление настоящего документа соответствует ГОСТ 19.502-78. Примечание. В связи с постоянным развитием Системы элементы интерфейса и значения ее фактических параметров могут отличаться от документированных. 3 ЧОГА.300317.31-01 СОДЕРЖАНИЕ 1. Назначение программы ...............................................................................................................4 1.1. Общие сведения .................................................................................................................4 1.2. Возможности системы ........................................................................................................4 1.3. Область применения ..........................................................................................................4 1.4. Состав системы ..................................................................................................................4 2. Условия применения ...................................................................................................................6 2.1. Требования к программным и техническим средствам системы........................................6 2.1.1. Требования к АРМ ...........................................................................................................6 2.1.1.1. Миграция без создания виртуальной машины..............................................................6 2.1.1.2. Миграция с созданием виртуальной машины ...............................................................6 2.1.1.3. Общие требования .......................................................................................................7 2.1.1.4. Требования к серверу Системы ....................................................................................7 2.1.1.5. Требования к сетевой инфраструктуре ........................................................................8 2.2. Требования к персоналу .....................................................................................................9 3. Описание задачи ........................................................................................................................ 10 4. Входные и выходные данные .................................................................................................. 16 4.1. Входные данные ............................................................................................................... 16 4.2. Выходные данные ............................................................................................................ 16 Перечень СОКРАЩЕНИЙ И УСЛОВНЫХ ОБОЗНАЧЕНИЙ ........................................................... 18 4 ЧОГА.300317.31-01 1. НАЗНАЧЕНИЕ ПРОГРАММЫ 1.1. Общие сведения Система управления конфигурациями «Атом.Порт» (далее – Система) — это программа для ЭВМ, предназначенная для централизованного управления программными конфигурациями рабочих станций на базе операционных систем семейств GNU/Linux и Microsoft Windows. Система предназначена для автоматизации следующих процессов: 1. Инвентаризация автоматизированных рабочих мест (далее – АРМ) пользователей, включающая сбор, хранение и обработка данных о рабочих станциях (далее – РС); 2. Отслеживание активности и времени работы рабочих станций; 3. Создание алгоритмов изменения конфигурации РС на встроенном языке Системы; 4. Конфигурирование рабочих станций и групп рабочих станций, в том числе миграция рабочих станций пользователей на отечественное программное обеспечение (далее – ПО). 1.2. Возможности Системы Система позволяет выполнять следующие задачи: 1. Получать актуальную и подробную информацию о действующем парке вычислительной техники предприятия. 2. Осуществлять автоматизированный процесс миграции рабочих станций пользователей на отечественное ПО: 2.1. миграция с созданием виртуальной машины; 2.2. миграция без создания виртуальной машины; 2.3. миграция с двойной загрузкой. 3. Управлять гетерогенной инфраструктурой по окончании процесса миграции: 3.1. устанавливать ПО; 3.2. добавлять сертификаты; 3.3. управлять учётными записями локальных пользователей; 3.4. подключать печатно-копировальное оборудование. 1.3. Область применения Система может быть использована государственными и коммерческими средними предприятиями для решения таких задач, как инвентаризация ПО, перевод АРМ на использование отечественного ПО, управление гетерогенной инфраструктурой рабочих станций. 1.4. Состав Системы Компоненты Системы построены по модульному принципу. Выделяются следующие основные компоненты: 5 ЧОГА.300317.31-01 1. Ядро Системы обеспечивает подключение к рабочим станциям, хранение и обработку данных и взаимодействие модулей Системы. 2. Интерфейс пользователя представляет собой веб-интерфейс, оформленный в виде одностраничного приложения (SPA). 3. Подсистема развёртывания обеспечивает наиболее сложные сценарии конфигурирования рабочих станций, связанные с заменой операционной системы. Система включает в себя следующие модули: 1. модуль инвентаризации; 2. модуль резервного копирования; 3. модуль разбора конфигураций; 4. модуль управления клиентами; 5. модуль интерактивного удалённого управления; 6. модуль создания отчётов; 7. модуль отслеживания подключений. 6 ЧОГА.300317.31-01 2. УСЛОВИЯ ПРИМЕНЕНИЯ 2.1. Требования к программным и техническим средствам Системы 1. Система может быть установлена как на выделенный сервер, так и на виртуальную машину под управлением любого совместимого дистрибутива GNU/Linux. 2. Системе требуется один высокоскоростной сетевой интерфейс. Должен предоставляться сетевой адрес, корректно настроенный DNS-сервер и шлюз с доступом к сети Интернет. 3. Системе должно быть предоставлено достаточное дисковое хранилище, подключенное непосредственно к Серверу, либо предоставляемое по одному из следующих сетевых протоколов: NFS, CIFS, SSH. 4. Сетевой интерфейс Системы должен быть доступен для рабочих станций. Для обеспечения работоспособности всех функций Системы сетевые интерфейсы рабочих станций также должны быть доступны для Системы. Сетевой экран должен разрешать подключения к ряду предопределённых портов, указанных в разделе 2.1.1.5 настоящего руководства. 5. Система активно взаимодействует с управляемыми рабочими станциями с использованием нескольких сетевых протоколов и должна быть добавлена в разрешающий список системы предотвращения вторжений. 2.1.1. Требования к АРМ 2.1.1.1. Миграция без создания виртуальной машины Минимальная конфигурация ПК:  ЦП архитектуры x86-64, 2 ядра 1,2 ГГц.  ОЗУ 2 ГБ.  20 ГБ свободного дискового пространства на основном накопителе. Рекомендуемая конфигурация ПК:  ЦП архитектуры x86-64, 2 ядра 1,2 ГГц.  ОЗУ 4 ГБ.  50 ГБ свободного дискового пространства на основном накопителе. 2.1.1.2. Миграция с созданием виртуальной машины Минимальная конфигурация ПК:  ЦП архитектуры x86-64 с поддержкой технологии аппаратной виртуализации (Intel VT, AMD SVM), 4 ядра 1,8 ГГц.  Материнская плата с поддержкой виртуализации.  ОЗУ 8 Гбайт. 7 ЧОГА.300317.31-01  Свободное дисковое пространство на основном накопителе 100 ГБ. Рекомендуемая конфигурация ПК:  ЦП архитектуры x86-64 с поддержкой технологии аппаратной виртуализации (Intel VT, AMD SVM), 4 ядра 2 ГГц.  Материнская плата с поддержкой виртуализации.  ОЗУ 8 Гбайт.  Свободное дисковое пространство на основном SSD-накопителе 200 ГБ. 2.1.1.3. Общие требования  Оборудование должно быть совместимо с дистрибутивом развёртываемой операционной системы и отвечать его системным требованиям.  На рабочих станциях в настройках микропрограммы EFI должен быть отключен протокол Secure Boot.  На накопителе, содержащем системный раздел, не должно содержаться динамических и шифрованных разделов.  Недопустимы блокировки доступа к информации на HDD со стороны систем безопасности. Каталоги пользователей должны быть открыты на чтение и запись. 2.1.1.4. Требования к серверу Системы Аппаратные требования к серверу Системы определяются планируемой максимальной единовременной нагрузкой на Систему. Нагрузка зависит, в свою очередь, от количества обслуживаемых рабочих станций. Система может быть установлена как на выделенный сервер, так и на виртуальную машину. Минимальные требования для небольшой инфраструктуры (не более 100 рабочих станций):  ЦП архитектуры x86-64 4 ядра 2 ГГц  4 ГБ ОЗУ.  80 ГБ дискового пространства.  Сетевой интерфейс 100 Мбит/сек. Минимальные требования для инфраструктуры среднего размера (от 100 до 2000 рабочих станций):  ЦП архитектуры x86-64 8 ядер 2 ГГц;  8 ГБ ОЗУ;  80 ГБ дискового пространства;  Сетевой интерфейс 200 Мбит/сек. 8 ЧОГА.300317.31-01 2.1.1.5. Требования к сетевой инфраструктуре  Для рабочих станций должны быть доступны следующие TCP-порты сервера: 22 (SSH), 4505, 4506.  Оператору Системы должны быть доступны TCP-порты 22(SSH), 80 (HTTP), 443 (HTTPS) сервера.  Трансляция сетевых адресов (NAT) между сервером и рабочими станциями должна отсутствовать для обеспечения работоспособности функции отслеживания онлайн- статуса рабочих станций.  Для удалённого управления необходима доступность TCP-порта 22 (SSH) на рабочих станциях. Для графического доступа требуется доступность TCP-портов 5900, 5901, 3389 (RDP), а также UDP-порта 3389 (RDP).  Необходимо наличие доступного рабочим станциям DHCP-сервера. Сетевые интерфейсы рабочих станций должны быть настроены для получения IP-адреса и адреса сервера DNS по протоколу DHCP.  Для выполнения работ по миграции и обслуживанию рекомендуется организовать внешний доступ к серверу Системы при помощи технологии VPN. Доступ может быть организован средствами сервера Системы в случае согласования разрешительной политики.  В случае создания резервных копий и образов дисков необходимо дополнительное локальное хранилище на сервере Системы, либо автономное файловое хранилище с доступом по протоколу SSH. Для одновременной миграции 10 РС с созданием виртуальной машины рекомендуется хранилище от 1 ТБ.  Для ввода рабочих станций в домен после миграции необходимо обеспечить сетевой доступ рабочих станций к контроллеру домена.  В случае применения сценария, предполагающего создание виртуальной машины с сетевым интерфейсом в режиме моста, дополнительно требуется: o Пул адресов DHCP-сервера должен быть достаточным для выдачи адресов рабочим станциям и виртуальным машинам. o Отсутствие иного сетевого оборудования, подключенного к физическому сетевому интерфейсу рабочей станции в режиме моста (например, IP-телефонов). 9 ЧОГА.300317.31-01 o Сетевые коммутаторы должны позволять использование нескольких клиентских MAC-адресов на одном порту.  Ключевое влияние на скорость процессов миграции оказывает скорость обмена данными между рабочими станциями, с одной стороны, и сервером и файловым хранилищем, с другой стороны. Основными факторами, ограничивающими скорость, являются: o пропускная способность дисковых подсистем рабочих станций, сервера и хранилища; o пропускная способность сегментов сети между рабочей станцией и сервером, рабочей станцией и файловым хранилищем, включая сетевые интерфейсы сервера, файлового хранилища и рабочей станции, а также всё коммутационное оборудование, образующее соответствующий сегмент сети.  В качестве общего правила следует принять, что на каждые три рабочие станции, одновременно участвующие в процессах миграции, необходимо не менее 100 Мбит/c пропускной способности. 2.2. Требования к персоналу В рамках использования Системы предусмотрены следующие роли: 1. Пользователь рабочей станции. 2. Оператор Системы – технический специалист, управляющий рабочими станциями средствами Системы. Требования к квалификации оператора Системы определены в рамках «Руководства по техническому обслуживанию». 3. Администратор Системы – технический специалист, производящий развёртывание, обновление и настройку Системы. Требования к квалификации администратора Системы определены в рамках «Руководства системного администратора». 4. Программист Системы – технический специалист, редактирующий конфигурации Системы, расширяющие её возможности. Требования к квалификации программиста Системы определены в рамках «Руководства программиста». 10 ЧОГА.300317.31-01 3. ОПИСАНИЕ ЗАДАЧИ Система предназначена для решения задач перевода рабочих станций на отечественные ОС и ПО и управления гетерогенной инфраструктурой.  Модуль инвентаризации обеспечивает сбор данных о рабочих станциях.  Модуль резервного копирования обеспечивает сохранение данных с рабочей станции на внешнем носителе.  Модуль конфигураций обеспечивает загрузку и обработку сценариев управления рабочими станциями (графов).  Модуль управления конфигурациями динамически изменяет состояние рабочих станций.  Модуль интерактивного удалённого управления предоставляет оператору доступ к удалённому рабочему столу рабочей станции (на данный момент не реализовано).  Модуль создания отчётов предназначен для создания сводных отчётов по рабочим станциям и автоматическим процессам.  Модуль отслеживания подключений журналирует сетевую доступность рабочих станций для Системы. Для построения ядра Системы применяется следующее свободное программное обеспечение:  Python — динамический язык программирования, представленный интерпретатором CPython и инфраструктурой модулей;  SaltStack — система управления конфигурацией;  PostgreSQL — система управления базами данных;  Redis — резидентная система управления базами данных класса NoSQL с открытым исходным кодом, работающая со структурами данных типа «ключ — значение». Используется для реализации брокера сообщений модуля Celery;  Celery — асинхронная очередь задач. Компоненты ядра Системы выполняют следующие задачи:  Загрузка конфигураций Системы на языке YAML.  Подключение к рабочим станциям для сбора данных и постановки задач.  Хранение данных о рабочих станциях в базе данных.  Хранение резервных и служебных копий содержимого файловых систем рабочих станций на дисковом хранилище.  Предоставление программного веб-интерфейса для интерфейса пользователя. 1. Интерфейс пользователя 11 ЧОГА.300317.31-01 Интерфейс пользователя разработан с использование следующих технологий:  TypeScript — строго типизированное надмножество динамического языка программирования JavaScript, в т.ч. инфраструктура модулей;  RXJS — библиотека реактивного программирования;  Ramda — библиотека функционального программирования;  Angular 11 — фреймворк для разработки приложений уровня предприятия. Весь интерфейс строго типизирован и соответствует требованиям дизайна государственных систем России (http://gov.design). В проекте реализован набор компонентов, на котором основаны все элементы управления интерфейса. Интерфейс может быть запущен как на мобильных устройствах, так и на стационарных рабочих станциях с сохранением полной функциональности. В пользовательском интерфейсе реализована интеграция с OpenAPI 2/3 что позволяет значительно ускорить создание новых компонентов и фильтров данных, используя лишь описание REST API. Списочные и табличные компоненты имеют гибкую систему настроек, настраиваемые размеры колонок, порядок их следования на экране. Реализованы гибкие механизмы работы со множественными записями. Возможны несколько режимов выделения: множество, один из множества, интервальное выделение, одиночное выделение. Оператору Системы предоставлен необходимый инструментарий для настройки и организации интерфейса под свои нужды и предпочтения. Все настройки могут сохраняться на текущем устройстве. Возможна выгрузка настроек и передача их на другие устройства. Новые возможности могут быть добавлены в виде подключаемых модулей. Интерфейс разработан в реактивно-функциональной парадигме, позволяющей переиспользовать функциональные блоки. Это приводит к значительной экономии ресурсов на тестирование, так как программная база строится из небольшого числа хорошо протестированных блоков, а наличие строгой типизации делает возможным выявление ошибок на этапе сборки приложения. В качестве основного тестировочного фреймворка задействован Protractor в связке с Puppeteer. Обеспеченное функциональное тестирование покрывает до 90% процентов критической функциональности пользовательского интерфейса, а также полностью покрывает интеграцию с API. Пользовательский интерфейс имеет систему интернационализации. Новый перевод может быть добавлен созданием XML документа. 12 ЧОГА.300317.31-01 Интерфейс пользователя поддерживает фреймворк нативных приложений Electron и может распространяться как обособленное настольное приложение. 2. Подсистема развертывания Подсистема развёртывания представляет собой конфигурацию Системы и включает в себя сценарии для рабочих станций, образ вспомогательной операционной системы и набор утилит. Сценарий 1. Базовая миграция рабочих станций на отечественные ОС Для обеспечения автоматизированной миграции с операционных систем семейства Windows на отечественные операционные системы разработан базовый сценарий. Сценарий 2. Упрощенная миграция АРМ на отечественные ОС. Сценарий существует для случаев, когда технические характеристики рабочей станции или требования безопасности не позволяют создать виртуальную машину с исходной ОС, либо отсутствует такая потребность. Сценарий 3. Миграция АРМ на отечественные ОС посредством двойной загрузки В случаях, когда технические характеристики рабочей станции не позволяют запускать виртуальную машину, может быть применён данный сценарий. Операционные системы располагаются на одном системном диске и загружаются поочередно по выбору пользователя. Файловая система целевой ОС размещается в виде файла на главном дисковом разделе исходной ОС. Система обеспечивает возможность инвентаризации рабочих станций, одновременный перевод множества станций на использование отечественного офисного ПО и перенос профилей пользователей, а также управление конфигурациями этих рабочих станций. Количество одновременно мигрирующих рабочих станций рассчитывается с учётом пропускной способности локальной вычислительной сети и других требований. В рамках разработанной Системы реализован функционал для решение следующих задач: 1. Инвентаризация рабочих станций  сбор сведений и анализ характеристик рабочих станций, установивших подключение с сервером управления, в том числе: o основные характеристики аппаратного обеспечения; o список установленного программного обеспечения; o список подключённого периферийного оборудования; o список сетевых дисков, настроенных в ОС Microsoft Windows;  создание групп рабочих станций, в том числе, посредством отбора рабочих станций по определённому признаку из множества подключённых к серверу управления миграцией (например, по составу аппаратного обеспечения, набору установленного ПО для ОС Microsoft Windows и т.п.); 13 ЧОГА.300317.31-01  формирование в формате YAML описания задач, содержащих перечень операций для выполнения на рабочей станции; в числе задач предусмотрены задачи по установке набора дополнительного ПО, общего для группы рабочих станций, созданной на предыдущем шаге, и задачи по настройке подключений (монтированию) сетевых ресурсов, общих для группы, в которую входит пользователь РС.  загрузка описания задач и выполнение их валидации;  формирование плана выполнения задач на отдельных рабочих станциях или группах рабочих стаций с учетом установки набора дополнительного ПО и настройки стандартного набора сетевых дисков. 2. Проверка готовности рабочей станции к началу миграции  проверка наличия доступа к системным каталогам ОС Microsoft Windows;  проверка наличия возможности замены загрузчика ОС Microsoft Windows;  проверка наличия возможности выполнения операций реестром Windows: чтение, запись, удаление ветки. 3. Инициализация рабочей станции  деактивация режимов «гибернация», «сон»;  копирование на рабочую станцию необходимых компонентов и утилит для обеспечения миграции;  обнаружение подключённых периферийных устройств (МФУ, принтеров, сканеров);  обнаружение подключённых сетевых дисков;  определение установленных на ПК стационарных дисков, и их разделов;  определение локальных пользователей и пользователей домена AD, имеющих профили в ОС Microsoft Windows;  сбор информации о файловой системе ОС Microsoft Windows и каталогах профилей пользователей, в том числе, объёме хранящейся в них информации. 4. Проверка диска  поиск и исправление ошибок файловой системы в случае их обнаружения. 5. Загрузка вспомогательной ОС обеспечения миграции  замена стандартного загрузчика операционной системы ОС Microsoft Windows на загрузчик, совместимый с ОС семейства Linux;  доставка по сети на рабочую станцию вспомогательной ОС обеспечения миграции;  конфигурирование загрузчика для обеспечения автоматической загрузки рабочей станции под управлением вспомогательной ОС; 6. Создание образа жёсткого диска: 14 ЧОГА.300317.31-01  создание образа жёсткого диска во внешнем сетевом хранилище данных либо на устройстве хранения с интерфейсом USB, подключённому к рабочей станции;  преобразование образа диска в формат qcow при необходимости использования локальной виртуальной машины (далее - ЛВМ);  проверка целостности созданных образов. 7. Установка целевой ОС:  выбор образа ОС Astra Linux CE в зависимости от режима загрузки рабочей станции (UEFI или Legacy).  доставка по сети на рабочую станцию образа ОС Astra Linux CE;  конфигурирование загрузчика для обеспечения автоматической загрузки рабочей станции под управлением ОС Astra Linux CE; 8. Установка целевой ОС в имеющийся раздел системного жёсткого диска и конфигурирование загрузчика для альтернативной загрузки ОС:  доставка по сети на рабочую станцию файла образа ОС Astra Linux CE и его запись в свободное пространство системного раздела;  сохранение файловой системы системного раздела с исходной ОС Windows;  конфигурирование загрузчика для обеспечения возможности альтернативной загрузки рабочей станции под управлением ОС Astra Linux CE или исходной ОС Windows. 9. Создание виртуальной машины с исходной ОС:  копирование на рабочую станцию ранее созданного образа диска, совместимого с ПО виртуализации (в формате qcow);  настройка конфигурации и создание экземпляра виртуальной машины. 10. Первичное конфигурирование рабочей станции:  ввод рабочей станции с установленной ОС Astra Linux CE в домен AD, в который была введена ОС Microsoft Windows до миграции;  установка набора дополнительного ПО в зависимости от принадлежности рабочей станции определённой группе;  монтирование (подключение) созданных образов жёстких дисков (отдельных разделов жёстких дисков) для доступа к пользовательским данным из ОС Linux;  настройка подключения совместимого с ОС Astra Linux CE периферийного оборудования в соответствии с перечнем, полученным на шаге «Инициализация рабочей станции»; 15 ЧОГА.300317.31-01  монтирование (подключение) сетевых ресурсов в соответствии с перечнем, полученным на шаге «Инициализация рабочей станции» и сетевых ресурсов, общих для группы, в которую входит пользователь АРМ;  перенос почтовых сообщений и контактов из приложения Microsoft Outlook в приложение Р7-органайзер. 11. Управление программным обеспечением рабочей станции  создание задачи на установку (обновление, удаление) пакетов ПО для ОС, размещённых в локальном репозитории, для группы АРМ;  выполнение задачи на рабочей станции или на предварительно сформированной группе рабочих станций;  обеспечение визуализации и журналирования выполнения задачи. 16 ЧОГА.300317.31-01 4. ВХОДНЫЕ И ВЫХОДНЫЕ ДАННЫЕ 4.1. Входные данные Входными данными являются:  Автоматически получаемые сведения о программно-аппаратном составе и иные сведения о рабочих станциях. o Модель ЦПУ (строка) o Архитектура ЦПУ o Аппаратное наименование хоста от производителя (актуально, например, для ноутбуков и неттопов) o Версия микропрограммы (строка) o Дата выпуска микропрограммы (дата) o Семейство ОС (строка) o Наименование ОС o Список IP-адресов интерфейсов исключая петлевые (127.0.0.1...) o Объём ОЗУ в МБ (целое) o Полное доменное имя o Список локальных пользователей o Версия Python, используемая для запуска клиента o Список очередей печати o Список обнаруженных сканнеров o Список ПО (имя, описание) o Информация о накопителях  Перечень рабочих станций, для запуска процессов — список ключей (целочисленных идентификаторов) рабочих станций.  Перечень автоматических процессов, запускаемых на рабочих станциях. 4.2. Выходные данные Выходными данными являются:  Журнал доступности рабочей станции в виде графика (в базе – в виде серий временных меток в привязке к рабочей станции). 17 ЧОГА.300317.31-01  Отчет о программно-аппаратном составе рабочей станции на основании входных данных (сведения о занятом дисковом пространстве, техническом состоянии накопителей и известных локально пользователях).  Уведомления в режиме реального времени о статусе выполнения автоматических процессов, о ошибках.  Таблица со статусами выполнения автоматических процессов и информацией о произошедших ошибках.  Отчет об успешности выполнения автоматических процессов на определенный момент времени, данные о произошедших ошибках. 18 ЧОГА.300317.31-01 ПЕРЕЧЕНЬ СОКРАЩЕНИЙ И УСЛОВНЫХ ОБОЗНАЧЕНИЙ АРМ Автоматизированное рабочее место МФУ Многофункциональное устройство ОЗУ Оперативное запоминающее устройство ОС Операционная система ПК Персональный компьютер ПО Программное обеспечение РС Рабочая станция Система Программа для ЭВМ “Система управления конфигурациями «Атом.Порт»” ЦП Центральный процессор HDD Накопитель на жёстких магнитных дисках SSD Твердотельный накопитель 19 ЧОГА.300317.31-01 Лист регистрации изменений Номера листов (страниц) Всего № Входящий № листов докумен- сопроводит. Подп. Дата изменен- заменен- аннули- (страниц) Изм. новых та докум. и дата ных ных рованных в докум."
  },
  {
    "title": "Руководство оператора",
    "url": null,
    "text": "УТВЕРЖДЕН ЧОГА.300317.34-01-ЛУ СИСТЕМА УПРАВЛЕНИЯ КОНФИГУРАЦИЯМИ АТОМ.ПОРТ Руководство оператора ЧОГА.300317.34-01 а т Листов: 40 а д и ь с и п д о П .л б у д № .в н И № .в н и .м а з В а т а д и ь с и п д о П .л 2021 д о п № .в н И technicaldocs.ru 2 ЧОГА.300317.34-01 АННОТАЦИЯ В настоящем документе содержится руководство оператора программы для ЭВМ «Система управления конфигурациями “Атом.Порт”» (далее – Система). В документе представлена информация о назначении Системы, областях и условиях ее применения. Описан порядок выполнения программы, последовательность действий оператора Системы, сообщения, выдаваемые оператору Системы. В разделе «Назначение программы» приведено описание назначения Системы, её возможностей, а также основные характеристики и ограничения Системы, накладываемые на область её применения. В разделе «Условия выполнения программы» определены условия, необходимые для выполнения программы (требования к необходимым для данной программы техническим средствам и другим программам). В разделе «Выполнение программы» описана последовательность действий оператора в процессе решения практических задач, а также ожидаемые реакции программы на эти действия. В разделе «Сообщения оператору» приведены описания сообщений, выдаваемых в ходе выполнения программы, а также действия оператора в случае, если реакция программы не соответствует ожидаемой. Документ подготовлен в соответствии с ГОСТ 19.103-77 – в части наименования и обозначения, ГОСТ 19.106-78 – в части оформления, ГОСТ 19.508-79 – в части структуры и содержания. Примечание. В связи с постоянным развитием Системы элементы интерфейса и значения ее фактических параметров могут отличаться от документированных. 3 ЧОГА.300317.34-01 СОДЕРЖАНИЕ 1 Назначение программы .......................................................................................................... 4 1.1 Общие сведения ............................................................................................................... 4 1.2 Возможности системы ...................................................................................................... 4 1.3 Область применения ........................................................................................................ 4 2 Условия выполнения программы ......................................................................................... 5 2.1 Требования к программным и техническим средствам системы ..................................... 5 2.1.1 Требования к аппаратному обеспечению АРМ ..................................................... 5 2.1.1.1 Миграция без создания виртуальной машины ..................................................... 5 2.1.1.2 Миграция с созданием виртуальной машины ...................................................... 5 2.1.1.3 Общие требования ................................................................................................. 6 2.1.2 Требования к серверу Системы ............................................................................ 6 2.1.3 Требования к сетевой инфраструктуре ................................................................. 7 3 Выполнение программы ........................................................................................................ 9 3.1 Сценарии миграции рабочих станций на отечественные ОС ........................................... 9 3.1.1 Сценарий 1. Базовая миграция рабочих станций на отечественные ОС .............. 9 3.1.2 Сценарий 2. Упрощенная миграция рабочих станций на отечественные ОС ..... 10 3.1.3 Сценарий 3. Миграция рабочих станций на отечественные ОС посредством двойной загрузки ............................................................................................................ 10 3.2 Общие настройки Системы ............................................................................................ 11 3.2.1 Вход в Систему .................................................................................................... 11 3.2.2 Создание идентификаторов групп рабочих станций ........................................... 12 3.2.3 Управление учётными записями пользователей системы .................................. 14 3.2.4 Добавление информации о домене .................................................................... 18 3.3 Действия с рабочими станциями .................................................................................... 19 3.3.1 Просмотр состояния рабочей станции ................................................................ 19 3.3.2 Изменение состояния готовности рабочих станций к миграции .......................... 25 3.4 Управление миграцией рабочих станций ....................................................................... 29 3.4.1 Создание автопроцесса ...................................................................................... 29 3.4.2 Просмотр состояния автопроцесса ..................................................................... 32 3.5 Формирование отчета для рабочих станций .................................................................. 35 4 Сообщения оператору .......................................................................................................... 37 Перечень терминов ....................................................................................................................... 38 Перечень сокращений и условных обозначений ....................................................................... 39 4 ЧОГА.300317.34-01 1 НАЗНАЧЕНИЕ ПРОГРАММЫ 1.1 Общие сведения Система управления конфигурациями «Атом.Порт» (далее – Система) — это программа для ЭВМ, предназначенная для централизованного управления программными конфигурациями рабочих станций на базе операционных систем семейств GNU/Linux и Microsoft Windows. Система предназначена для автоматизации следующих процессов: 1. Инвентаризация автоматизированных рабочих мест (далее – АРМ) пользователей, включающая сбор, хранение и обработка данных о рабочих станциях (далее – РС); 2. Отслеживание активности и времени работы рабочих станций; 3. Создание алгоритмов изменения конфигурации РС на встроенном языке Системы. 4. Конфигурирование рабочих станций и групп рабочих станций, в том числе миграция рабочих станций пользователей на отечественное программное обеспечение (далее – ПО); 1.2 Возможности Системы Система позволяет выполнять следующие задачи: 1. Получать актуальную и подробную информацию о действующем парке вычислительной техники предприятия. 2. Осуществлять автоматизированный процесс миграции рабочих станций пользователей на отечественное ПО: 2.1. миграция с созданием виртуальной машины; 2.2. миграция без создания виртуальной машины; 2.3. миграция с двойной загрузкой. 3. Управлять гетерогенной инфраструктурой по окончании процесса миграции: 3.1. устанавливать ПО; 3.2. добавлять сертификаты; 3.3. управлять учётными записями локальных пользователей; 3.4. подключать печатно-копировальное оборудование. 1.3 Область применения Система может быть использована государственными и коммерческими средними предприятиями для решения таких задач, как инвентаризация ПО, перевод АРМ на использование отечественного ПО, управление гетерогенной инфраструктурой рабочих станций. 5 ЧОГА.300317.34-01 2 УСЛОВИЯ ВЫПОЛНЕНИЯ ПРОГРАММЫ 2.1 Требования к программным и техническим средствам Системы 1. Система может быть установлена как на выделенный сервер, так и на виртуальную машину под управлением любого совместимого дистрибутива GNU/Linux. 2. Системе требуется один высокоскоростной сетевой интерфейс. Должен предоставляться сетевой адрес, корректно настроенный DNS-сервер и шлюз с доступом к сети Интернет. 3. Системе должно быть предоставлено достаточное дисковое хранилище, подключенное непосредственно к Серверу, либо предоставляемое по одному из следующих сетевых протоколов: NFS, CIFS, SSH. 4. Сетевой интерфейс Системы должен быть доступен для рабочих станций. Для обеспечения работоспособности всех функций Системы сетевые интерфейсы рабочих станций также должны быть доступны для Системы. Сетевой экран должен разрешать подключения к ряду предопределённых портов, указанных в разделе 2.1.3 настоящего руководства. 5. Система активно взаимодействует с управляемыми рабочими станциями с использованием нескольких сетевых протоколов и должна быть добавлена в разрешающий список системы предотвращения вторжений. 2.1.1 Требования к аппаратному обеспечению АРМ 2.1.1.1 Миграция без создания виртуальной машины Минимальная конфигурация ПК:  ЦП архитектуры x86-64, 2 ядра 1,2 ГГц.  ОЗУ 2 ГБ.  20 ГБ свободного дискового пространства на основном накопителе. Рекомендуемая конфигурация ПК:  ЦП архитектуры x86-64, 2 ядра 1,2 ГГц.  ОЗУ 4 ГБ.  50 ГБ свободного дискового пространства на основном накопителе. 2.1.1.2 Миграция с созданием виртуальной машины Минимальная конфигурация ПК:  ЦП архитектуры x86-64 с поддержкой технологии аппаратной виртуализации (Intel VT, AMD SVM), 4 ядра 1,8 ГГц. 6 ЧОГА.300317.34-01  Материнская плата с поддержкой виртуализации.  ОЗУ 8 Гбайт.  Свободное дисковое пространство на основном накопителе 100 ГБ. Рекомендуемая конфигурация ПК:  ЦП архитектуры x86-64 с поддержкой технологии аппаратной виртуализации (Intel VT, AMD SVM), 4 ядра 2 ГГц.  Материнская плата с поддержкой виртуализации.  ОЗУ 8 Гбайт.  Свободное дисковое пространство на основном SSD-накопителе 200 ГБ. 2.1.1.3 Общие требования  Оборудование должно быть совместимо с дистрибутивом развёртываемой операционной системы и отвечать его системным требованиям.  На рабочих станциях в настройках микропрограммы EFI должен быть отключен протокол Secure Boot.  На накопителе, содержащем системный раздел, не должно содержаться динамических и шифрованных разделов.  Недопустимы блокировки доступа к информации на HDD со стороны систем безопасности. Каталоги пользователей должны быть открыты на чтение и запись. 2.1.2 Требования к серверу Системы Аппаратные требования к серверу Системы определяются планируемой максимальной единовременной нагрузкой на Систему. Нагрузка зависит, в свою очередь, от количества обслуживаемых рабочих станций. Система может быть установлена как на выделенный сервер, так и на виртуальную машину. Минимальные требования для небольшой инфраструктуры (не более 100 рабочих станций):  ЦП архитектуры x86-64 4 ядра 2 ГГц  4 ГБ ОЗУ.  80 ГБ дискового пространства.  Сетевой интерфейс 100 Мбит/сек. Минимальные требования для инфраструктуры среднего размера (от 100 до 2000 рабочих станций):  ЦП архитектуры x86-64 8 ядер 2 ГГц; 7 ЧОГА.300317.34-01  8 ГБ ОЗУ;  80 ГБ дискового пространства;  Сетевой интерфейс 200 Мбит/сек. 2.1.3 Требования к сетевой инфраструктуре  Для рабочих станций должны быть доступны следующие TCP-порты сервера: 22 (SSH), 4505, 4506.  Оператору Системы должны быть доступны TCP-порты 22(SSH), 80 (HTTP), 443 (HTTPS) сервера.  Трансляция сетевых адресов (NAT) между сервером и рабочими станциями должна отсутствовать для обеспечения работоспособности функции отслеживания онлайн- статуса рабочих станций.  Для удалённого управления необходима доступность TCP-порта 22 (SSH) на рабочих станциях. Для графического доступа требуется доступность TCP-портов 5900, 5901, 3389 (RDP), а также UDP-порта 3389 (RDP).  Для выполнения работ по миграции и обслуживанию рекомендуется организовать внешний доступ к серверу Системы при помощи технологии VPN. Доступ может быть организован средствами сервера Системы в случае согласования разрешительной политики.  В случае создания резервных копий и образов дисков необходимо дополнительное локальное хранилище на сервере Системы, либо автономное файловое хранилище с доступом по протоколу SSH. Для одновременной миграции 10 РС с созданием виртуальной машины рекомендуется хранилище от 1 ТБ.  Для ввода рабочих станций в домен после миграции необходимо обеспечить сетевой доступ рабочих станций к контроллеру домена.  В случае применения сценария, предполагающего создание виртуальной машины с сетевым интерфейсом в режиме моста, дополнительно требуется: o Наличие доступного рабочим станциям DHCP-сервера с пулом адресов, достаточным для выдачи рабочим станциям и виртуальным машинам. o Отсутствие иного сетевого оборудования, подключенного к физическому сетевому интерфейсу рабочей станции в режиме моста (например, IP-телефонов). 8 ЧОГА.300317.34-01 o Сетевые коммутаторы должны позволять использование нескольких клиентских MAC-адресов на одном порту.  Ключевое влияние на скорость процессов миграции оказывает скорость обмена данными между рабочими станциями, с одной стороны, и сервером и файловым хранилищем, с другой стороны. Основными факторами, ограничивающими скорость, являются: o пропускная способность дисковых подсистем рабочих станций, сервера и хранилища; o пропускная способность сегментов сети между рабочей станцией и сервером, рабочей станцией и файловым хранилищем, включая сетевые интерфейсы сервера, файлового хранилища и рабочей станции, а также всё коммутационное оборудование, образующее соответствующий сегмент сети.  В качестве общего правила следует принять, что на каждые три рабочие станции, одновременно участвующие в процессах миграции, необходимо не менее 100 Мбит/c пропускной способности. 9 ЧОГА.300317.34-01 3 ВЫПОЛНЕНИЕ ПРОГРАММЫ 3.1 Сценарии миграции рабочих станций на отечественные ОС В данном разделе описаны сценарии перевода АРМ на использование отечественного ПО, в соответствии с которыми оператор Системы может использовать инструментарий, реализованный в Системе, и имеющий средства управления в веб-интерфейсе Системы. 3.1.1 Сценарий 1. Базовая миграция рабочих станций на отечественные ОС Для обеспечения автоматизированной миграции с операционных систем семейства Windows на отечественные операционные системы разработан базовый сценарий, включающий в себя следующие операции: 1. Проверка готовности РС к миграции. Осуществляется тестирование РС на наличие необходимых для миграции прав доступа и версий клиентского программного обеспечения. Это позволяет минимизировать количество сбоев в процессе миграции. 2. Инициализация РС. Производится недеструктивная подготовка РС к миграции, осуществляется сбор данных, доставляются необходимые утилиты, изменяется схема электропитания. 3. Проверка диска. Средствами ОС производится проверка и исправление файловой системы. Это снижает риск сбоев в процессе создания образа виртуальной машины в дальнейшем. 4. Загрузка временной операционной системы. Осуществляется замена загрузчика операционной системы Windows, доставка временной операционной системы, конфигурирование загрузчика и перезагрузка рабочей станции во вспомогательную ОС. 5. Создание образа виртуальной машины. Создается файл, несущий в себе полную копию содержимого и структуры файловой системы и данных, находящихся на системном диске. Данный файл сохраняется во файловом хранилище. 6. Установка целевой ОС. Производится доставка и запись на системный диск образа отечественной операционной системы. По завершении этапа производится запуск целевой ОС. 7. Создание виртуальной машины с исходной ОС. Производится установка системы виртуализации, на базе ранее сохранённого образа системного диска создается виртуальная машина. 8. Настройка операционной системы и программного обеспечения. Завершающий этап, на котором осуществляется комплекс процессов, необходимых для ввода рабочей 10 ЧОГА.300317.34-01 станции в эксплуатацию: ввод в домен, установка дополнительного ПО, настройка прикладного ПО и информационных систем. 3.1.2 Сценарий 2. Упрощенная миграция рабочих станций на отечественные ОС Сценарий существует для случаев, когда технические характеристики рабочей станции или требования безопасности не позволяют создать виртуальную машину с исходной ОС, либо отсутствует такая потребность. Перечень операций идентичен базовому сценарию, за исключением операции по созданию виртуальной машины: 1. Проверка готовности РС к миграции. Осуществляется тестирование РС на наличие необходимых для миграции прав доступа и версий клиентского программного обеспечения. Это позволяет минимизировать количество сбоев в процессе миграции. 2. Инициализация РС. Производится недеструктивная подготовка РС к миграции, осуществляется сбор данных, доставляются необходимые утилиты, изменяется схема электропитания. 3. Проверка диска. Средствами ОС производится проверка и исправление файловой системы. Это снижает риск сбоев в процессе создания образа виртуальной машины в дальнейшем. 4. Загрузка временной операционной системы. Осуществляется подмена загрузчика операционной системы Windows, доставка временной операционной системы, конфигурирование загрузчика и перезагрузка рабочей станции во вспомогательную ОС. 5. Установка целевой ОС. Производится доставка и запись на системный диск образа отечественной операционной системы. По завершении этапа производится запуск целевой ОС. 6. Настройка операционной системы и программного обеспечения. Завершающий этап, на котором осуществляется комплекс процессов, необходимых для ввода рабочей станции в эксплуатацию: ввод в домен, установка дополнительного ПО, настройка прикладного ПО и информационных систем. 3.1.3 Сценарий 3. Миграция рабочих станций на отечественные ОС посредством двойной загрузки Данный сценарий может быть применён в случаях, когда технические характеристики рабочей станции не позволяют запускать виртуальную машину. Операционные системы располагаются на одном системном диске, при включении ПК загружается одна из них по выбору пользователя. Файловая система целевой ОС размещается в виде файла в главном дисковом разделе исходной ОС. Сценарий включает следующие операции: 11 ЧОГА.300317.34-01 1. Проверка готовности РС к миграции. Осуществляется тестирование РС на наличие необходимых для миграции прав доступа и версий клиентского программного обеспечения. Это позволяет минимизировать количество сбоев в процессе миграции. 2. Инициализация РС. Производится недеструктивная подготовка РС к миграции, осуществляется сбор данных, доставляются необходимые утилиты, изменяется схема электропитания. 3. Проверка диска. Средствами ОС производится проверка и исправление файловой системы. Это снижает риск сбоев в процессе создания образа виртуальной машины в дальнейшем. 4. Установка целевой операционной системы. Осуществляется подмена загрузчика операционной системы Windows, доставка образа целевой операционной системы, конфигурирование загрузчика и перезагрузка рабочей станции в целевую ОС. 5. Настройка операционной системы и программного обеспечения. Завершающий этап, на котором осуществляется комплекс процессов, необходимых для ввода рабочей станции в эксплуатацию: ввод в домен, установка дополнительного ПО, настройка прикладного ПО и информационных систем. 3.2 Общие настройки Системы 3.2.1 Вход в Систему На АРМ оператора, имеющем доступ к серверу Системы, ввести в строке адреса веб-браузера: http://<адрес сервера> Выполнить аутентификацию в Системе. В окне браузера должен отобразиться пользовательский интерфейс Системы (Рисунок 1). В левой части окна расположены пункты меню:  «Рабочие станции» (Рисунок 1, поз. 1) – открывает страницу со списком рабочих станций, зарегистрированных в Системе.  «Справочники» (Рисунок 1, поз. 2) – открывает страницу с конфигурационными элементами Системы. После авторизации в Системе в рабочем окне по умолчанию отображается таблица со списком рабочих станций, зарегистрированных на сервере Системы. В таблице, в частности, отображаются идентификаторы программных клиентов Системы (миньонов) – как установленных ранее (на предшествующих этапах жизненного цикла рабочей станции), так и функционирующих в момент просмотра таблицы. 12 ЧОГА.300317.34-01 Статус миньона отображается в виде цветного кружка: красного ● – в случае отсутствия соединения с миньоном (Рисунок 1, поз. 3), зелёного ● – в случае наличия соединения с миньоном (Рисунок 1, поз. 4), серого ● – в случае, когда миньон для данной ОС ещё не был установлен. В нижней части страницы справа размещены элементы управления отображением страницы (Рисунок 1, поз. 5). В верхней части страницы справа размещены пиктограммы, активирующие:  диалоговое окно выбора языка интерфейса Системы (Рисунок 1, поз. 6);  диалоговое окно управления профилем активного пользователя Системы (Рисунок 1, поз. 7);  страницу системных сообщений (Рисунок 1, поз. 8). Рисунок 1 – Рабочее окно пользовательского интерфейса Системы 3.2.2 Создание идентификаторов групп рабочих станций Группа рабочих станций в системе управления конфигурациями «Атом.Порт» – это подмножество рабочих станций из числа зарегистрированных в Системе, объединённых по произвольному признаку для удобства управления и с целью разграничения прав пользователей Системы на операции с ними. Для создания нового идентификатора группы необходимо: 1. В главном меню веб-интерфейса перейти на страницу «Справочники» / «Группы» (Рисунок 2, поз. 1). Откроется список групп. 13 ЧОГА.300317.34-01 2. Для создания нового идентификатора группы нажать пиктограмму «+» (Рисунок 2, поз. 2). Рисунок 2 – Список групп 3. Ввести название группы (Рисунок 3, поз. 1), заполнить поле «Описание» (необязательное поле), нажать кнопку «Сохранить». В списке групп отобразится новый идентификатор группы (Рисунок 4). Рисунок 3 – Окно создания группы 14 ЧОГА.300317.34-01 Рисунок 4 – Обновлённый список групп 3.2.3 Управление учётными записями пользователей Системы Для удобства работы с группами рабочих станций и разграничения прав по управлению их миграцией в Системе предусмотрена возможность регистрации пользователей. Привилегированный пользователь обладает полномочиями регистрации новых пользователей Системы и может управлять миграцией рабочих станций, входящих в любые группы, или не входящих ни в одну из групп. Непривилегированный пользователь не обладает полномочиями регистрации новых пользователей Системы и может управлять миграцией только тех рабочих станций, которые входят в те группы, которые назначены пользователю. Как привилегированным, так и непривилегированным пользователям может быть назначено несколько групп. Ниже описан порядок добавления пользователя Системы и назначения ему группы. 15 ЧОГА.300317.34-01 1. В главном меню веб-интерфейса перейти на страницу «Справочники» / «Пользователи». Откроется список пользователей Системы (Рисунок 5). Рисунок 5 – Список пользователей Системы 2. Для добавления учётной записи пользователя нажать на пиктограмму «+» (Рисунок 5, поз. 1). 3. В открывшемся диалоговом окне (Рисунок 6) ввести данные пользователя: адрес электронной почты, имя пользователя и пароль пользователя. С помощью переключателя «Администратор» установить тип пользователя. Нажать кнопку «Сохранить». 16 ЧОГА.300317.34-01 Рисунок 6 – Окно создания пользователя Системы 4. Для просмотра или редактирования информации о пользователе Системы нажать кнопку «Подробнее» (Рисунок 5, поз. 2). Откроется окно информации о пользователе Системы (Рисунок 7). 17 ЧОГА.300317.34-01 5. Для назначения пользователю группы рабочих станций нажать пиктограмму редактирования (Рисунок 7, поз. 1). В открывшемся диалоговом окне выбрать группы, назначаемые пользователю (Рисунок 8, поз. 1) и нажать кнопку «Сохранить» (Рисунок 8, поз. 2). В окне информации о пользователе Системы отобразится список назначенных групп (Рисунок 9). Рисунок 7 – Окно информации о пользователе Системы Рисунок 8 – Окно назначения групп пользователя 18 ЧОГА.300317.34-01 Рисунок 9 – Окно информации о пользователе Системы со списком назначенных групп 3.2.4 Добавление информации о домене Для того, чтобы в процессе миграции ввести рабочие станции в домен, необходимо добавить в Систему информацию о домене. 1. В главном меню веб-интерфейса перейти на страницу «Справочники» / «Домены» (Рисунок 10, поз. 1). Рисунок 10 – Список доменов 19 ЧОГА.300317.34-01 2. Для создания описания нового домена нажать пиктограмму «+» (Рисунок 10, поз. 2). 3. В открывшемся диалоговом окне ввести информацию о домене:  «Name» (Рисунок 11, поз. 1) – имя домена – обязательное поле  «Admin name» – имя администратора – обязательное поле  «Password» (Рисунок 11, поз. 2) – пароль администратора – обязательное поле  «Description» – описание домена – необязательное поле  «Server» – имя контроллера домена – необязательное поле  «Transfer domain» – целевой домен (домен, в который будет введена рабочая станция после установки новой ОС) – необязательное поле Нажать кнопку «Создать» (Рисунок 11, поз. 3). Рисунок 11 – Форма сведений о домене 3.3 Действия с рабочими станциями 3.3.1 Просмотр состояния рабочей станции В жизненном цикле управляемой рабочей станции выделяются следующие этапы: 1) подключение рабочей станции к серверу Системы; 2) инициализация рабочей станции; 3) замена системного загрузчика; 4) установка вспомогательной ОС обеспечения миграции; 5) создание образа системного диска; 6) установка целевой ОС; 7) копирование образа системного диска в файловую систему целевой ОС; 8) установка дополнительного ПО и окончательное конфигурирование; 20 ЧОГА.300317.34-01 9) эксплуатация рабочей станции под управлением целевой ОС. Информация о текущем этапе жизненного цикла, данные об аппаратной и программной конфигурации и статистика доступности рабочей станции представлены на странице сводной информации о рабочей станции. 1. В главном меню веб-интерфейса перейти на страницу «Рабочие станции». Нажать на пиктограмму детальной информации о рабочей станции (Рисунок 12, поз. 1). Рисунок 12 – Переход на страницу детальной информации о рабочей станции 21 ЧОГА.300317.34-01 2. На открывшейся странице детальной информации о рабочей станции в блоке «Этапы жизненного цикла» значком «✔» отмечены завершённые этапы, а порядковыми номерами – предстоящие (Рисунок 13). Рисунок 13 – Страница детальной информации о рабочей станции 3. В средней части страницы детальной информации о рабочей станции на диаграмме отображается информация о доступности рабочей станции. Справа над диаграммой размещена пиктограмма активации окна настройки временного интервала диаграммы и пиктограмма активации окна вывода исходных данных статистики доступности миньонов (Рисунок 13, поз. 1). 22 ЧОГА.300317.34-01 4. В левой части рабочего окна расположены ссылки на списки объектов, связанных с рабочей станцией (Рисунок 14): «Автопроцесс» – список автопроцессов, запущенных на данной рабочей станции (см. раздел 3.4): «Ключ-значение» – специальный справочник атрибутов рабочей станции; «Отчёты» – список отчётов, созданных для данной рабочей станции (см. раздел 3.5). Рисунок 14 – Справочник атрибутов рабочей станции 5. В нижней части страницы детальной информации о рабочей станции отображаются блоки с информацией, полученной от программных клиентов Системы – миньонов (Рисунок 13). При нажатии пиктограммы (Рисунок 13, поз. 2) происходит переключение на вкладку детальной информации миньона. Также переключение возможно посредством прямого выбора вкладки в верхней части окна. 6. На открывшейся вкладке детальной информации миньона в правой нижней части окна расположены переключатели типа отображаемой информации. На рисунке 15 приведён пример окна информации об идентификаторах миньона. На рисунке 16 приведён пример окна информации об аппаратной конфигурации. На рисунке 17 приведён пример окна информации о системном ПО миньона. 23 ЧОГА.300317.34-01 На рисунке 18 приведён пример окна информации о ПО клиента Системы. Рисунок 15 – Информация об идентификаторах миньона Рисунок 16 – Информация об аппаратной конфигурации 24 ЧОГА.300317.34-01 Рисунок 17 – Информация о системном ПО миньона Рисунок 18 – Информация о ПО клиента Системы 25 ЧОГА.300317.34-01 7. В левой части окна детальной информации миньона расположены ссылки на списки объектов, связанных с миньоном (Рисунок 19): «ПО» – список ПО, установленного в ОС миньона; «Принтеры» – список принтеров, подключенных к миньону; «Сканеры» – список сканеров, подключенных к миньону; «Пользователи» – список пользователей ОС миньона; «Job» – список задач по управлению конфигурацией, назначенных миньону. Рисунок 19 – Перечень ссылок на списки объектов, связанных с рабочей станцией 3.3.2 Изменение состояния готовности рабочих станций к миграции Перед началом миграции рабочих станций необходимо изменить их состояние готовности к играции на «Принято», что позволяет избежать случайного запуска процесса миграции. 26 ЧОГА.300317.34-01 1. В главном меню веб-интерфейса перейти на страницу «Рабочие станции». Открыть таблицу с рабочими станциями, не допущенными к миграции, выбрав значение состояния «Не принятые» (Рисунок 20, поз. 1): Рисунок 20 – Список непринятых РС 2. Выбрать рабочие станции для выполнения групповой операции (Рисунок 21, поз. 1) и нажать пиктограмму «Действия» (Рисунок 21, поз. 2): Рисунок 21 – Выбор РС для групповой операции 27 ЧОГА.300317.34-01 3. В открывшемся окне выбрать пункт «Изменить состояние» (Рисунок 22, поз. 1) и нажать кнопку «Далее» (Рисунок 22, поз. 2): Рисунок 22 – Выбор групповой операции «Изменить состояние» 4. Выбрать состояние «Принятые» (Рисунок 23, поз. 1) и нажать кнопку «Далее» (Рисунок 23, поз. 2): Рисунок 23 – Выбор нового состояния РС – «Принята» 28 ЧОГА.300317.34-01 5. Нажать кнопку «Выполнить» (Рисунок 24, поз. 1), затем нажать кнопку «Закрыть»: Рисунок 24 – Подтверждение операции изменения состояния РС Выбрать значение состояния «Принятые» (Рисунок 25, поз. 1). Рабочая станция с изменённым состоянием отобразится в списке. Рисунок 25 – Список РС с новым состоянием 29 ЧОГА.300317.34-01 3.4 Управление миграцией рабочих станций 3.4.1 Создание автопроцесса 1. В окне со списком РС, допущенных к миграции, выбрать рабочие станции для выполнения групповой операции (Рисунок 26, поз. 1) и нажать пиктограмму «Действия» (Рисунок 26, поз. 2): Рисунок 26 – Выбор РС для групповой операции 30 ЧОГА.300317.34-01 2. В открывшемся окне выбрать пункт «Создать автопроцесс» (Рисунок 27, поз. 1) и нажать кнопку «Далее» (Рисунок 27, поз. 2): Рисунок 27 – Выбор групповой операции «Создать автопроцесс» 3. Выбрать требуемый шаблон автопроцесса (Рисунок 28, поз. 1) и нажать кнопку «Далее» (Рисунок 28, поз. 2): Рисунок 28 – Выбор шаблона автопроцесса 31 ЧОГА.300317.34-01 Доступный набор шаблонов алгоритмов, зависит от набора сценариев миграции (см. раздел Ошибка! Источник ссылки не найден.), предусмотренного в конкретном варианте поставки Системы. 4. Установить максимально допустимую продолжительность автопроцесса (Рисунок 29, поз. 1) и нажать кнопку «Далее» (Рисунок 29, поз. 2): Рисунок 29 – Установка параметров автопроцесса 5. Проверить параметры автопроцесса и нажать кнопку «Выполнить» (Рисунок 30, поз. 1): Рисунок 30 – Запуск автопроцесса 32 ЧОГА.300317.34-01 6. Нажать кнопку «Закрыть» (Рисунок 31, поз. 1): Рисунок 31 – Сводная информация о запущенном автопроцессе 3.4.2 Просмотр состояния автопроцесса Во время выполнения автопроцесса Оператор Системы может наблюдать его текущее состояние. Для этого необходимо перейти в раздел «Рабочие станции», нажать пиктограмму списка автопроцессов (Рисунок 32, поз. 1) и открыть страницу детальной информации об автопроцессе, выбрав его из списка (Рисунок 33). Для каждого автопроцесса в списке указано время его создания и текущий статус (Рисунок 34). Рисунок 32 – Открытие списка автопроцессов, связанных с рабочей станцией 33 ЧОГА.300317.34-01 Рисунок 33 – Список автопроцессов, связанных с рабочей станцией Рисунок 34 – Список стадий автопроцесса (списочное представление) На странице детальной информации автопроцесс представлен в виде графа (Рисунок 35). Граф автопроцесса имеет начальную и конечную вершины (отображаются в виде квадрата). Вершины графа, отображаемые в виде круга, соответствуют атомарным операциям, выполняемым на РС (или группе РС). Каждая вершина маркирована парой значений – количество сделанных попыток выполнения операции и количество запланированных попыток. 34 ЧОГА.300317.34-01 Цвет вершины зависит от результата выполнения операции:  запланированные (синий);  выполненные успешно (зелёный);  при выполнении выдано предупреждение (оранжевый);  вызвавшие неустранимую ошибку (красный). Предупреждения и сообщения об ошибках выводятся в текстовое поле на странице детальной информации об автопроцессе при выборе любой из его вершин (Рисунок 36, поз. 1). В правой нижней части страницы размещены элементы управления отображением страницы:  Переключатель представления автопроцесса (графическое / табличное)  Переключатель автообновления страницы. Операции, вызвавшие неустранимую ошибку, вызывают останов выполнения автопроцесса и требуют вмешательства Оператора Системы. Также оператор Системы может просмотреть диагностические сообщения в словаре сообщений Системы, как указано в разделе 4. Рёбра графа соответствуют переходам от одной операции к другой. Каждое ребро маркировано числовым значением, соответствующим приоритету выполнения. Если в автопроцессе предусмотрено ветвление, то первым будет выполнен переход по ребру с меньшим значением (более высоким приоритетом). Рисунок 35 – Графическое представление автопроцесса 35 ЧОГА.300317.34-01 Рисунок 36 – Сообщения, связанные с выполнением автопроцесса 3.5 Формирование отчета для рабочих станций 1. Выбрать рабочие станции для выполнения групповой операции (Ошибка! Источник ссылки не найден., поз. 1) и нажать пиктограмму «Действия» (Ошибка! Источник ссылки не найден., поз. 2): Рисунок 37 – Выбор РС для групповой операции 36 ЧОГА.300317.34-01 2. В открывшемся окне выбрать пункт «Создать отчет» (Рисунок 38, поз. 1), нажать кнопку «Далее» (Рисунок 38, поз. 2) затем кнопки «Выполнить» и «Закрыть»: Рисунок 38 – Выбор групповой операции «Создать отчёт» 3. В главном меню веб-интерфейса перейти на страницу «Справочники» / «Отчеты» (Рисунок 39): Рисунок 39 – Страница «Отчёты» 4. В отобразившейся таблице выбрать сформированный отчет и нажать пиктограмму «Загрузить» (Рисунок 40): Рисунок 40 – Загрузка сформированного отчёта 5. Выбрать местоположение для сохранения отчета в формате PDF и открыть загруженный файл. 37 ЧОГА.300317.34-01 4 СООБЩЕНИЯ ОПЕРАТОРУ 1. Нажать пиктограмму «Сообщения» в главном меню веб-интерфейса (Рисунок 41, поз. 1). Рисунок 41 – Переход на страницу просмотра сообщений Системы 2. В открывшемся журнале сообщений о событиях Системы выбрать нужный источник сообщений и просмотреть имеющиеся сообщения (столбец «Данные») (Рисунок 42, поз. 1). Рисунок 42 – Список сообщений Системы 38 ЧОГА.300317.34-01 ПЕРЕЧЕНЬ ТЕРМИНОВ Автопроцесс Запланированное задание на изменения конфигурации одной РС или группы РС, в ходе выполнения которого модуль управления конфигурацией транслирует на агент администрирования последовательность команд, обеспечивающую достижение требуемой конфигурации РС. Агент Клиентское приложение Системы для ОС Linux или ОС Windows, администрирования установленное на РС, передающее на сервер Системы сведения об аппаратном обеспечении и актуальной конфигурации РС, принимающее и исполняющее команды модуля управления конфигурацией. Граф автопроцесса Алгоритм изменения конфигурации РС, описанный на встроенном языке Системы. Конфигурация РС Совокупность ОС, системного и прикладного ПО, установленного на РС, а также их настроек, сохранённых в специальных файлах и базах данных, размещённых на РС. Оператор Системы Технический сотрудник, управляющий рабочими станциями через интерфейс Системы 39 ЧОГА.300317.34-01 ПЕРЕЧЕНЬ СОКРАЩЕНИЙ И УСЛОВНЫХ ОБОЗНАЧЕНИЙ АРМ Автоматизированное рабочее место МФУ Многофункциональное устройство ОЗУ Оперативное запоминающее устройство ОС Операционная система ПК Персональный компьютер ПО Программное обеспечение РС Рабочая станция Система Программа для ЭВМ “Система управления конфигурациями «Атом.Порт»” ЦП Центральный процессор HDD Накопитель на жёстких магнитных дисках SSD Твердотельный накопитель 40 ЧОГА.300317.34-01 ЛИСТ РЕГИСТРАЦИИ ИЗМЕНЕНИЙ Номера листов (страниц) Всего № Входящий № листов докумен- сопроводит. Подп. Дата изменен- заменен- аннули- (страниц) в Изм. новых та докум. и дата ных ных рованных докум."
  },
  {
    "title": "Руководство системного администратора",
    "url": null,
    "text": "УТВЕРЖДЕН ЧОГА.300317.32-01-ЛУ СИСТЕМА УПРАВЛЕНИЯ КОНФИГУРАЦИЯМИ АТОМ.ПОРТ Руководство системного администратора ЧОГА.300317.32-01 а т а д Листов 17 и ь с и п д о П .л б у д № .в н И № .в н и .м а з В а т а д и ь с и п д о П .л д 2021 о п № .в н И technicaldocs.ru 2 ЧОГА.300317.32-01 АННОТАЦИЯ В настоящем документе приведено руководство системного администратора по установке и настройке программы для ЭВМ «Система управления конфигурациями “Атом.Порт”» (далее – Cистема). В разделе «Общие сведения о программе» указаны назначение и функции Системы, сведения о технических и программных средствах, обеспечивающих функционирование Системы. В разделе «Структура программы» приведены сведения о структуре программы, ее составных компонентах и модулях. В разделе «Настройка программы» приведено описание действий по настройке Системы на условиях конкретного применения. В разделе «Проверка программы» приведено описание способов проверки, позволяющих дать общее заключение о работоспособности Системы. Структура и оформление настоящего документа соответствует ГОСТ 19.503-79. Примечание. В связи с постоянным развитием Системы элементы интерфейса и значения ее фактических параметров могут отличаться от документированных. 3 ЧОГА.300317.32-01 СОДЕРЖАНИЕ 1. Общие сведения о программе .............................................................................................4 1.1. Общие сведения ..............................................................................................................4 1.2. Возможности системы ......................................................................................................4 1.3. Область применения ........................................................................................................4 1.4. Условия применения ........................................................................................................5 2. Структура программы ..........................................................................................................6 3. Настройка программы ........................................................................................................ 10 4. Проверка программы ......................................................................................................... 15 5. Перечень принятых сокращений .............................................................................................. 16 4 ЧОГА.300317.32-01 1. ОБЩИЕ СВЕДЕНИЯ О ПРОГРАММЕ 1.1. Общие сведения Система управления конфигурациями «Атом.Порт» (далее Система) — это программа для ЭВМ, предназначенная для централизованного управления программными конфигурациями рабочих станций на базе операционных систем семейств GNU/Linux и Microsoft Windows. Система предназначена для управления инфраструктурой рабочих мест государственных и коммерческих средних предприятий. Система предназначена для осуществления следующих видов деятельности по автоматизации: 1. Инвентаризация автоматизированных рабочих мест (далее – АРМ) пользователей, включающая сбор, хранение и обработка данных о рабочих станциях (далее – РС); 2. Мониторинг состояния рабочих станций; 3. Конфигурирование рабочих станций и групп рабочих станций, в том числе миграция рабочих станций пользователей на отечественное ПО; 4. Управление конфигурациями гибридной инфраструктуры рабочих станций. 1.2. Возможности Системы Система позволяет осуществлять следующие операции: 1. Получать актуальную и подробную информацию о действующем парке вычислительной техники предприятия. 2. Осуществлять автоматизированный процесс миграции рабочих станций пользователей на отечественное ПО: 2.1. миграция с созданием виртуальной машины; 2.2. миграция без создания виртуальной машины; 2.3. миграция с двойной загрузкой. 3. Управлять гибридной инфраструктурой по окончании процесса миграции: 3.1. устанавливать ПО, 3.2. добавлять сертификаты, 3.3. управлять локальными пользователями, 3.4. подключать печатно-копировальное оборудование. 1.3. Область применения Система может быть использована государственными и коммерческими средними предприятиями в первую очередь для решения таких задач, как инвентаризация ПО, миграция на отечественное ПО, управление гибридной инфраструктурой рабочими станциями на отечественном ПО. 5 ЧОГА.300317.32-01 1.4. Условия применения 1. Система может быть установлена как на выделенный сервер, так и на виртуальную машину под управлением совместимого дистрибутива GNU/Linux. 2. Системе требуется один высокоскоростной сетевой интерфейс. Должен предоставляться сетевой адрес, корректно настроенный DNS-сервер и шлюз с доступом к сети Интернет. 3. Системе должно быть предоставлено достаточное дисковое хранилище, подключенное непосредственно к Серверу, либо предоставляемое по одному из поддерживаемых сетевых протоколов. 4. Сетевой интерфейс Системы должен быть доступен для рабочих станций. Для работоспособности всех функций Системы, сетевые интерфейсы рабочих станций также должны быть доступны для Системы. Сетевой экран должен позволять подключения к ряду предопределённых портов. 5. Система активно взаимодействует с управляемыми рабочими станциями с использованием нескольких сетевых протоколов и должна быть добавлена в разрешающий список системы предотвращения вторжений. 6 ЧОГА.300317.32-01 2. СТРУКТУРА ПРОГРАММЫ Компоненты Системы построены по модульному принципу. Выделяются следующие основные компоненты: 1. Ядро Системы обеспечивает подключение к рабочим станциям, хранение и обработку данных и взаимодействие модулей Системы. 2. Интерфейс пользователя представляет собой веб-интерфейс, оформленный в виде одностраничного приложения (SPA). 3. Подсистема развёртывания обеспечивает наиболее сложные сценарии конфигурирования рабочих станций, связанные с заменой операционной системы. Система включает в себя следующие модули: 1. модуль инвентаризации; 2. модуль резервного копирования; 3. модуль конфигураций; 4. модуль управления конфигурациями; 5. модуль интерактивного удалённого управления; 6. модуль создания отчётов; 7. модуль отслеживания подключений. 7 ЧОГА.300317.32-01 Структура продукта и схема взаимодействия составных частей представлены на рисунке Рисунок 1. Рисунок 1 Основные компоненты продукта:  Python — динамический язык программирования, представленный интерпретатором CPython и инфраструктурой модулей;  SaltStack — система управления конфигурацией, включающая серверный компонент salt- master и клиенты salt-minion;  PostgreSQL — система управления базами данных;  Redis — резидентная система управления базами данных класса NoSQL с открытым исходным кодом, работающая со структурами данных типа «ключ — значение». Используется для реализации брокера сообщений модуля Celery;  Celery — асинхронная очередь задач. 8 ЧОГА.300317.32-01 Службы и их функции, подготавливаемые в ходе установки ПО перечислены в таблице Таблица 1 Таблица 1 Службы и их назначение Имя службы Назначение Примечание celery Распределённая Обеспечивает запуск заданий очередь заданий синхронно и асинхронно, по расписанию, вложенные задания и т.д. runner.py Запуск команд SaltStack sniffer.py Отслеживание событий SaltStack nginx Веб-сервер Публикует пользовательский интерфейс, обеспечивает взаимодействие с командной строкой администратора миньона на рабочей станции. gunicorn Сервер приложений redis Сервер Redis salt-master Сервер SaltStack postmaster СУБД PostgreSQL Взаимодействие оператора с Системой происходит через веб-интерфейс, разработанный на открытой платформе Angular. Оператору предоставлен необходимый инструментарий для настройки и организации интерфейса под свои нужды и предпочтения. Внешний вид интерфейса приведён на рисунке Рисунок 2. Система позволяет осуществлять следующие операции: 1. Получать актуальную и подробную информацию о действующем парке вычислительной техники предприятия. 2. Осуществлять автоматизированный процесс миграции рабочих станций пользователей на отечественное ПО:  миграция с созданием виртуальной машины;  миграция без создания виртуальной машины;  миграция с двойной загрузкой. 3. Управлять гибридной инфраструктурой по окончании процесса миграции:  устанавливать ПО,  добавлять сертификаты,  управлять локальными пользователями, 9 ЧОГА.300317.32-01  подключать печатно-копировальное оборудование. Рисунок 2 10 ЧОГА.300317.32-01 3. НАСТРОЙКА ПРОГРАММЫ 3.1. Настройки серверной инфраструктуры Для перевода АРМ с используемой ОС Windows на ОС Astra Linux развёртывается серверная инфраструктура на виртуальных вычислительных ресурсах VMware. Серверная инфраструктура предназначена для автоматизированной обработки запросов ТР и хранения данных в необходимом для функционирования ТР объёме. Минимальные требования к серверу инфраструктуры до 100 рабочих мест:  ЦП архитектуры x86-64 4 ядра 2 ГГц;  ОЗУ 4 ГБ;  Дисковое пространство 80 ГБ;  Сетевой интерфейс 100 Мбит/сек. Требования для объёма от 100 до 2000 АРМ:  ЦП архитектуры x86-64 8 ядер 2 ГГц;  ОЗУ 8 ГБ;  Дисковое пространство 80 ГБ;  Сетевой интерфейс 200 Мбит/сек/ На сервере может быть установлен любой совместимый дистрибутив GNU/Linux. До начала миграции должны быть разрешены следующие сетевые взаимодействия:  рабочие станции должны иметь доступ к серверу с использованием TCP портов 22(SSH), 4505, 4506;  с АРМ оператора Системы должны быть доступны TCP порты сервера 22(SSH), 80(HTTP), 443(HTTPS);  на рабочих станциях должны быть доступны с АРМ оператора Системы обеспечивающие удалённое управление TCP-порты 22(SSH), 5900, 5901, 3389(RDP) и UDP-порт 3389(RDP). Рекомендуется обеспечить внешний доступ к серверу с использованием технологии VPN с открытием необходимых для этого сетевых взаимодействий. Сервер и АРМ должны находиться в одном сетевом сегменте, трансляции адресов (NAT) при сетевом взаимодействии между ними происходить не должно. В случае создания резервных копий и образов дисков на удалённом хранилище, необходимо предусмотреть дополнительное локальное хранилище на сервере Системы, либо автономное файловое хранилище с доступом по протоколу SSH. Для одновременной миграции с созданием виртуальной машины каждых десяти АРМ рекомендуется хранилище от 1 ТБ. В случае 11 ЧОГА.300317.32-01 необходимости ввода рабочих станций в домен после процесса миграции, необходимо наличие доступного рабочим станциям контроллера домена. Применение сценария, предполагающего создание виртуальной машины с сетевым интерфейсом в режиме моста, дополнительно требует обеспечить наличие доступного рабочим станциям DHCP-сервера с пулом адресов, достаточным по размерам для выдачи рабочим станциям (хостовым машинам) и гостевым виртуальным машинам, развёрнутым на них. При планировании миграции следует учитывать, что ключевое влияние на скорость и успешность процессов миграции влияет скорость обмена данными рабочих станций с сервером и файловым хранилищем. Основными факторами, ограничивающими эту скорость, являются:  Пропускная способность дисковых подсистем рабочих станций, сервера и хранилища;  Пропускная способность сегментов сети между рабочей станцией и сервером, рабочей станцией и хранилищем, включая сетевые интерфейсы сервера, хранилища и рабочей станции, а также всё коммутационное оборудование, образующее сегмент сети, в котором они размещены. Общее правило, обеспечивающее приемлемую скорость миграции, заключается в том, что на каждые три рабочие станции, одновременно участвующие в процессе миграции, должно приходиться не менее 100 Мбит/c пропускной способности сети. 3.2. Аппаратное обеспечение АРМ Для функционирования ПО необходима следующая минимальная конфигурация оборудования АРМ, таблица 1. Таблица 1. Рекомендуемое значение № Параметр Без виртуализации С виртуализацией 1. Процессор, архитектура x86_64 x86_64 2. Процессор, тактовая частота, ГГц, не менее 1.2 2 3. Объем оперативной памяти, ГБ, не менее 4 8 4. Накопитель на жестких магнитных дисках 50 100 (свободное доступное место) ГБ, не менее 5. Процессор, количество ядер, не менее 2 4 Материнская плата АРМ при миграции с применением виртуализации должна поддерживать технологию виртуализации. АРМ должен иметь возможность локального или сетевого подключения к печатающему устройству. Колонки, сканер, видеокамера могут подключаться по необходимости. АРМ должен иметь сетевое подключение к серверной инфраструктуре, описанной в пункте 3.1 настоящего документа. 12 ЧОГА.300317.32-01 3.3. Установка программного обеспечения Для установки программного обеспечения на сервер используется модуль CharonSandboxCreator. Его развёртывание и установка ПО осуществляются с выполнением следующих операций: 1. Установить и настроить ПО виртуализации QEMU/KVM: sudo apt install -y libvirt-clients libvirt-daemon-system sudo usermod -aG libvirt $(whoami) newgrp libvirt При настройке виртуализации необходимо дать доступ к подготовленным образам дисков машин. Каждый директорий в пути к хранилищу образов должен быть доступен на чтение и запуск (o+rx). 2. Установить зависимости: sudo apt install -y libvirt-dev python3-pip python3-venv git 3. Создать клон репозитория и назначить директорий проекта текущим: git clone https://dev.charon.su/developers/sandbox_creator.git cd sandbox_creator 4. Установить пакет в виртуальное окружение: python3 -m venv env 5. Активировать созданное виртуальное окружение: source ./env/bin/activate 6. Для предотвращения ошибок при сборке пакета libvirt-python следует установить пакет wheel: pip3 install wheel 7. Задать режим «редактирование» устанавливаемого модуля: pip3 install -e Необходимо заметить, что при повторных запусках оболочки виртуальное окружение должно быть активировано для каждой оболочки индивидуально: source ./env/bin/activate Для запуска модуля SandboxCreator следует использовать консольную команду следующего синтаксиса: sandbox_creator [--config FILE] [--download] [--prod] [--debug] [-- help] [--stages STAGES ...] где: --config: задаёт конфигурационный файл FILE, который может переопределять параметры конфигурации по умолчанию; --download: требует скачать образы виртуальных машин, если они не будут обнаружены локально; 13 ЧОГА.300317.32-01 --prod: инициирует производственную сборку песочницы; --debug: осуществляет вывод подробных сообщений; --stages: позволят выбрать этапы процесса развёртывания, по умолчанию — все. Могут быть указаны следующие этапы: download - загрузка образов виртуальных машин; deploy - развёртывание виртуальных машин и клиентов; deploy:install_server -установка сервера; migrate запуск миграции; browser_test - тестовые операции. Например, при установке Charon на предварительно установленную ОС Linux необходимо в конфигурационном файле задать параметр charon_address, указав в его значении ip-адрес хоста, а затем запустить програму командой: sandbox_creator --config FILE --stages deploy:install_server Пример содержимого конфигурационного файла: # Имя сервера (будет установлено) sandbox_name: charon_tmp # Сетевой адрес подготовленной машины charon_address: 192.168.0.2 # Данные суперпользователя на подготовленной машине charon_ssh_username: 'root' # После установки root можно отключить charon_ssh_password: 'password' # Обнулённый список тестовых миньонов minions: [] 3.4. Настройка клиентской части В домене Windows клиентская часть развёртывается с помощью групповых политик. Доменные групповые политики позволяют установить программное обеспечение путём рассылки программного обеспечения компьютеру-члену домена, входящему в группу рассылки. После назначения рассылки ПО оно устанавливается на всех входящих в группу компьютерах при следующем за рассылкой старте компьютера. Если задача рассылки ПО назначена компьютеру, то оно устанавливается независимо от того, какой пользователь авторизовался на компьютере при запуске. Назначение и настройка задачи рассылки программного обеспечения осуществляется с помощью ММС консоли управления групповыми политиками. Запуск консоли продемонстрирован на рисунке Рисунок 3. 14 ЧОГА.300317.32-01 Рисунок 3 15 ЧОГА.300317.32-01 4. ПРОВЕРКА ПРОГРАММЫ По завершении установки необходимо убедиться, что операция прошла корректно. Для этого необходимо запустить команду sandbox_creator --help Если программа работает корректно, будет выведена краткая встроенная справка: usage: sandbox_creator [-h] [--config CONFIG] [--debug] [--disable- progress-bar] [--download] [--fail-on-minion-error] [--prod] [-- stages [STAGES ...]] [--snapshots] [--truncate-images] create vm... optional arguments: -h, --help show this help message and exit --config CONFIG point to overriding config file --debug be verbose --disable-progress-bar do not show animated progress bars --download enable download stage: overwrite images from cloud --fail-on-minion-error stop and exit instantly on minion setup or migration --prod every service will be installed with production configuration --stages [STAGES ...] run only specified stages (download, deploy, deploy:install_server, migrate, browser_test) --snapshots Create snapshots of virtual machines for major stages --truncate-images Delete files from image directories which is not mentioned in config Командой, представленной ниже (вводится одной строкой), можно получить информацию о состоянии служб, обеспечивающих нормальную работу решения: systemctl list-units --all gunicorn.service sniffer.service process_runner.service 'celery-*' salt-master.service redis.service postgresql.service nginx.service В ответной выдаче команды все перечисленные компоненты должны быть загружены (“Loaded”) и активны (“Active”). Проверка доступности клиентов производится командой salt ‘*’ test.ping В ответной выдаче должны быть представлены идентификаторы всех активных клиентов с признаком наличия связи “True”. 16 ЧОГА.300317.32-01 ПЕРЕЧЕНЬ ПРИНЯТЫХ СОКРАЩЕНИЙ АРМ Автоматизированное рабочее место ГОСТ Государственный стандарт России ОЗУ Оперативное запоминающее устройство ОС Операционная система ПК Персональный компьютер ПО Программное обеспечение РС Рабочая станция Система Программа для ЭВМ “Система управления конфигурациями «Атом.Порт»” ЦП Центральный процессор 17 ЧОГА.300317.32-01 Лист регистрации изменений Номера листов (страниц) Всего № Входящий № листов докумен- сопроводит. Подп. Дата изменен- заменен- аннули- (страниц) Изм. новых та докум. и дата ных ных рованных в докум."
  }
]